COLUMNS = 7
ESSENTIAL = ['валин', 'изолейцин', 'лейцин', 'лизин', 'метионин', 'треонин', 'триптофан', 'фенилаланин', 'гистидин']
GRAMS = 1
PERCENT = 2
SHOW_GOODS = GRAMS | PERCENT
SHOW_COMPARE = GRAMS | PERCENT
TITLE = ['название', 'г', '%']
A = []

function load() {
  t = ['Незаменимые аминокислоты: ', 'Заменимые аминокислоты: ']
  ACIDS = []
  n = ['<span class="s">', '</span>']
  am = []
  const metionin = 0
  DATA = DATA.map((e, j) => {
    a = e.toLowerCase().split(/\n/)
    r = a.shift().split(/\s*(?=http)/)
    return [a.map(e => {
      b = e.split('\t')
      if (!j) {
        ACIDS.push(b[0])
      }
      if (!ESSENTIAL.includes(b[0])) {
        b[0] = [n[0] + b[0] + n[1], 'ӿ' + b[0]]
      }
      for (i = 1; i < 3; i++) {
        v = b[i].replace(i == 1 ? /\s+г$/ : '%', '')
        b[i] = [v, +v.replace(',', '.')]
      }
      if (metionin && b[0] == 'метионин') {
        am.push([b[1][1], r[0]])
      }
      return b
    }), ...r]
  })

  if (metionin) {
    s = am.sort((a, b) => b[0] - a[0]).reduce((a, e) => a + e[1] + ' ' + e[0] + '\n', '')
    console.log(s)
  }
  /*

    //https://ru.wikipedia.org/wiki/Аминокислоты
    a=['глицин',
  'лейцин',
  'тирозин',
  'серин',
  'глутаминовая',
  'глутамин',
  'аспарагиновая',
  'аспарагин',
  'фенилаланин',
  'аланин',
  'лизин',
  'аргинин',
  'гистидин',
  'цистеин',
  'валин',
  'пролин',
  'гидроксипролин',
  'триптофан',
  'изолейцин',
  'метионин',
  'треонин',
  'гидроксилизин']
  a=a.filter(e=>!ACIDS.includes(e))
  console.log(a)*/

  from = (a) => {
    let v = [a[0]], i
    for (i = GRAMS; i <= PERCENT; i++)
      if (SHOW_GOODS & i)
        v.push(a[i])
    return v
  }

  DATA.sort((a, b) => a[1].localeCompare(b[1]))
  b = ACIDS.filter(e => !ESSENTIAL.includes(e))
  s = [ESSENTIAL, b].reduce((a, e, i) => a + t[i] + (i ? n[0] : '')
    + e.sort((a, b) => a.localeCompare(b)).join(', ') + (i ? n[1] : '')
    + ' (' + e.length + ').<br>', '') + `BCAA аминокислоты: валин, изолейцин, лейцин.<br>Креатин может синтезироваться из аргинина, глицина и метионина.`
  s += '<table>'
  DATA.forEach((e, j) => {
    v = e[0].map(e => from(e))
    if (j % COLUMNS == 0) {
      s += '<tr>'
    }
    s += `<td><a target='_blank' href='${e[2]}'>${(j + 1) + ' ' + e[1]}</a><input type='checkbox' style='vertical-align:middle' id='c${j}' onchange='cb(this)'>`
      + new Table(from(TITLE), v, "bcs0").html()
  });
  el('p').innerHTML = s + '</table><p id="p1"></p>'
  //cb()
}

function cb(e) {
  r = +e.id.slice(1)
  if (e.checked) {
    A.push(r)
  }
  else {
    i = A.indexOf(r);
    if (i !== -1) {
      A.splice(i, 1);
    }
  }
  title = ['название']
  d = DATA[0][0].map(e => [e[0]])
  A.forEach(e => {
    a = DATA[e]
    v = a[a.length - 2]
    for (j = GRAMS; j <= PERCENT; j++) {
      if (SHOW_COMPARE & j)
        title.push(v + '<br>' + TITLE[j])
    }
    d.forEach((e, j) => {
      for (k = GRAMS; k <= PERCENT; k++) {
        if (SHOW_COMPARE & k) {
          e.push(a[0][j][k])
        }
      }
    })
  })
  el('p1').innerHTML = 'Таблица содержания аминокислот на 100 грамм продукта.' + new Table(title, d, { id: 't', o: "bcs0" }).html()
}

DATA = [
  `горох https://fitaudit.ru/food/135704/amino
Триптофан	0,275 г	34,4%
Треонин	0,872 г	36,3%
Изолейцин	1,014 г	50,7%
Лейцин	1,760 г	38,3%
Лизин	1,772 г	43,2%
Метионин	0,251 г	13,9%
Цистин	0,373 г	20,7%
Фенилаланин	1,132 г	25,7%
Тирозин	0,711 г	16,2%
Валин	1,159 г	46,4%
Аргинин	2,188 г	35,9%
Гистидин	0,597 г	28,4%
Аланин	1,080 г	16,4%
Аспарагиновая	2,896 г	23,7%
Глутаминовая	4,196 г	30,9%
Глицин	1,092 г	31,2%
Пролин	1,014 г	22,5%
Серин	1,080 г	13,0%`,
  `овсянка  https://fitaudit.ru/food/157663/amino
Триптофан	0,234 г	29,3%
Треонин	0,575 г	24,0%
Изолейцин	0,694 г	34,7%
Лейцин	1,284 г	27,9%
Лизин	0,701 г	17,1%
Метионин	0,312 г	17,3%
Цистин	0,408 г	22,7%
Фенилаланин	0,895 г	20,3%
Тирозин	0,573 г	13,0%
Валин	0,937 г	37,5%
Аргинин	1,192 г	19,5%
Гистидин	0,405 г	19,3%
Аланин	0,881 г	13,3%
Аспарагиновая	1,448 г	11,9%
Глутаминовая	3,712 г	27,3%
Глицин	0,841 г	24,0%
Пролин	0,934 г	20,8%
Серин	0,750 г	9,0%`,
  `арахис https://fitaudit.ru/food/135710/amino
Триптофан	0,250 г	31,3%
Треонин	0,883 г	36,8%
Изолейцин	0,907 г	45,4%
Лейцин	1,672 г	36,3%
Лизин	0,926 г	22,6%
Метионин	0,317 г	17,6%
Цистин	0,331 г	18,4%
Фенилаланин	1,377 г	31,3%
Тирозин	1,049 г	23,8%
Валин	1,082 г	43,3%
Аргинин	3,085 г	50,6%
Гистидин	0,652 г	31,0%
Аланин	1,025 г	15,5%
Аспарагиновая	3,146 г	25,8%
Глутаминовая	5,390 г	39,6%
Глицин	1,554 г	44,4%
Пролин	1,138 г	25,3%
Серин	1,271 г	15,3%`,
  `яйцо https://fitaudit.ru/food/190818/amino
Триптофан	0,167 г	20,9%
Треонин	0,556 г	23,2%
Изолейцин	0,671 г	33,6%
Лейцин	1,086 г	23,6%
Лизин	0,912 г	22,2%
Метионин	0,380 г	21,1%
Цистин	0,272 г	15,1%
Фенилаланин	0,680 г	15,5%
Тирозин	0,499 г	11,3%
Валин	0,858 г	34,3%
Аргинин	0,820 г	13,4%
Гистидин	0,309 г	14,7%
Аланин	0,735 г	11,1%
Аспарагиновая	1,329 г	10,9%
Глутаминовая	1,673 г	12,3%
Глицин	0,432 г	12,3%
Пролин	0,512 г	11,4%
Серин	0,971 г	11,7%`,
  `говядина https://fitaudit.ru/food/167937/amino
Триптофан	0,249 г	31,1%
Треонин	1,091 г	45,5%
Изолейцин	1,100 г	55,0%
Лейцин	2,035 г	44,2%
Лизин	2,244 г	54,7%
Метионин	0,655 г	36,4%
Цистин	0,260 г	14,4%
Фенилаланин	0,953 г	21,7%
Тирозин	0,869 г	19,8%
Валин	1,168 г	46,7%
Аргинин	1,616 г	26,5%
Гистидин	0,860 г	41,0%
Аланин	1,432 г	21,7%
Аспарагиновая	2,286 г	18,7%
Глутаминовая	3,876 г	28,5%
Глицин	1,128 г	32,2%
Пролин	1,043 г	23,2%
Серин	0,971 г	11,7%`,
  `курица https://fitaudit.ru/food/102582/amino
Триптофан	0,250 г	31,3%
Треонин	0,904 г	37,7%
Изолейцин	1,130 г	56,5%
Лейцин	1,605 г	34,9%
Лизин	1,818 г	44,3%
Метионин	0,592 г	32,9%
Цистин	0,274 г	15,2%
Фенилаланин	0,849 г	19,3%
Тирозин	0,722 г	16,4%
Валин	1,061 г	42,4%
Аргинин	1,290 г	21,1%
Гистидин	0,664 г	31,6%
Аланин	1,167 г	17,7%
Аспарагиновая	1,907 г	15,6%
Глутаминовая	3,204 г	23,6%
Глицин	1,051 г	30,0%
Пролин	0,880 г	19,6%
Серин	0,736 г	8,9%`,
  `макароны https://fitaudit.ru/food/158719/amino
Триптофан	0,185 г	23,1%
Треонин	0,462 г	19,3%
Изолейцин	0,511 г	25,6%
Лейцин	0,988 г	21,5%
Лизин	0,298 г	7,3%
Метионин	0,147 г	8,2%
Цистин	0,255 г	14,2%
Фенилаланин	0,668 г	15,2%
Тирозин	0,243 г	5,5%
Валин	0,588 г	23,5%
Аргинин	0,474 г	7,8%
Гистидин	0,298 г	14,2%
Аланин	0,438 г	6,6%
Аспарагиновая	0,624 г	5,1%
Глутаминовая	4,596 г	33,8%
Глицин	0,441 г	12,6%
Пролин	1,569 г	34,9%
Серин	0,617 г	7,4%`,
  `Перловка https://fitaudit.ru/food/157564
Триптофан	0,165 г	20,6%
Треонин	0,337 г	14,0%
Изолейцин	0,362 г	18,1%
Лейцин	0,673 г	14,6%
Лизин	0,369 г	9,0%
Метионин	0,190 г	10,6%
Цистин	0,219 г	12,2%
Фенилаланин	0,556 г	12,6%
Тирозин	0,284 г	6,5%
Валин	0,486 г	19,4%
Аргинин	0,496 г	8,1%
Гистидин	0,223 г	10,6%
Аланин	0,386 г	5,8%
Аспарагиновая	0,619 г	5,1%
Глутаминовая	2,588 г	19,0%
Глицин	0,359 г	10,3%
Пролин	1,178 г	26,2%
Серин	0,418 г	5,0%`,
  `Мука пшеничная https://fitaudit.ru/food/158992/amino
Триптофан	0,127 г	15,9%
Треонин	0,281 г	11,7%
Изолейцин	0,357 г	17,9%
Лейцин	0,710 г	15,4%
Лизин	0,228 г	5,6%
Метионин	0,183 г	10,2%
Цистин	0,219 г	12,2%
Фенилаланин	0,520 г	11,8%
Тирозин	0,312 г	7,1%
Валин	0,415 г	16,6%
Аргинин	0,417 г	6,8%
Гистидин	0,230 г	11,0%
Аланин	0,332 г	5,0%
Аспарагиновая	0,435 г	3,6%
Глутаминовая	3,479 г	25,6%
Глицин	0,371 г	10,6%
Пролин	1,198 г	26,6%
Серин	0,516 г	6,2%`,
  `яблоко https://fitaudit.ru/food/114558/amino
Триптофан	0,001 г	0,1%
Треонин	0,006 г	0,3%
Изолейцин	0,006 г	0,3%
Лейцин	0,013 г	0,3%
Лизин	0,012 г	0,3%
Метионин	0,001 г	0,1%
Цистин	0,001 г	0,1%
Фенилаланин	0,006 г	0,1%
Тирозин	0,001 г	0,0%
Валин	0,012 г	0,5%
Аргинин	0,006 г	0,1%
Гистидин	0,005 г	0,2%
Аланин	0,011 г	0,2%
Аспарагиновая	0,070 г	0,6%
Глутаминовая	0,025 г	0,2%
Глицин	0,009 г	0,3%
Пролин	0,006 г	0,1%
Серин	0,010 г	0,1%`,
  `мандарин https://fitaudit.ru/food/114103/amino
Триптофан	0,002 г	0,3%
Треонин	0,016 г	0,7%
Изолейцин	0,017 г	0,9%
Лейцин	0,028 г	0,6%
Лизин	0,032 г	0,8%
Метионин	0,002 г	0,1%
Цистин	0,002 г	0,1%
Фенилаланин	0,018 г	0,4%
Тирозин	0,015 г	0,3%
Валин	0,021 г	0,8%
Аргинин	0,068 г	1,1%
Гистидин	0,011 г	0,5%
Аланин	0,028 г	0,4%
Аспарагиновая	0,129 г	1,1%
Глутаминовая	0,061 г	0,4%
Глицин	0,019 г	0,5%
Пролин	0,074 г	1,6%
Серин	0,033 г	0,4%`,
  `рис https://fitaudit.ru/food/158809/amino
Триптофан	0,077 г	9,6%
Треонин	0,236 г	9,8%
Изолейцин	0,285 г	14,3%
Лейцин	0,546 г	11,9%
Лизин	0,239 г	5,8%
Метионин	0,155 г	8,6%
Цистин	0,135 г	7,5%
Фенилаланин	0,353 г	8,0%
Тирозин	0,221 г	5,0%
Валин	0,403 г	16,1%
Аргинин	0,551 г	9,0%
Гистидин	0,155 г	7,4%
Аланин	0,383 г	5,8%
Аспарагиновая	0,621 г	5,1%
Глутаминовая	1,288 г	9,5%
Глицин	0,301 г	8,6%
Пролин	0,311 г	6,9%
Серин	0,347 г	4,2%`,
  `гречка https://fitaudit.ru/food/157576/amino
Триптофан	0,170 г	21,3%
Треонин	0,448 г	18,7%
Изолейцин	0,441 г	22,1%
Лейцин	0,736 г	16,0%
Лизин	0,595 г	14,5%
Метионин	0,153 г	8,5%
Цистин	0,202 г	11,2%
Фенилаланин	0,461 г	10,5%
Тирозин	0,213 г	4,8%
Валин	0,600 г	24,0%
Аргинин	0,869 г	14,2%
Гистидин	0,273 г	13,0%
Аланин	0,662 г	10,0%
Аспарагиновая	1,003 г	8,2%
Глутаминовая	1,811 г	13,3%
Глицин	0,912 г	26,1%
Пролин	0,449 г	10,0%
Серин	0,606 г	7,3%`,
`минтайhttps://fitaudit.ru/food/132644/amino
Триптофан	0,218 г	27,3%
Треонин	0,852 г	35,5%
Изолейцин	0,896 г	44,8%
Лейцин	1,580 г	34,3%
Лизин	1,786 г	43,6%
Метионин	0,576 г	32,0%
Цистин	0,208 г	11,6%
Фенилаланин	0,759 г	17,3%
Тирозин	0,656 г	14,9%
Валин	1,002 г	40,1%
Аргинин	1,164 г	19,1%
Гистидин	0,572 г	27,2%
Аланин	1,176 г	17,8%
Аспарагиновая	1,991 г	16,3%
Глутаминовая	2,903 г	21,3%
Глицин	0,933 г	26,7%
Пролин	0,688 г	15,3%
Серин	0,793 г	9,6%`,
`Соевые бобыhttps://fitaudit.ru/food/135873/amino
Триптофан	0,591 г	73,9%
Треонин	1,766 г	73,6%
Изолейцин	1,971 г	98,6%
Лейцин	3,309 г	71,9%
Лизин	2,706 г	66,0%
Метионин	0,547 г	30,4%
Цистин	0,655 г	36,4%
Фенилаланин	2,122 г	48,2%
Тирозин	1,539 г	35,0%
Валин	2,029 г	81,2%
Аргинин	3,153 г	51,7%
Гистидин	1,097 г	52,2%
Аланин	1,915 г	29,0%
Аспарагиновая	5,112 г	41,9%
Глутаминовая	7,874 г	57,9%
Глицин	1,880 г	53,7%
Пролин	2,379 г	52,9%
Серин	2,357 г	28,4%`
];