//String.raw
const gr = [
	`Ватрушка
/https://www.youtube.com/watch?v=mJ5_CugzhA8
/выпекать при 180 градусах 30 минут 
мука 340
дрожжи 10
молоко 3.2% 200
сахар 25
соль 5
масло подсолнечное 30
тесто
творог 9% 540
сахар 100
яйцо 2c0
ванилин 1
изюм 100
начинка
#Пирог с капустой
мука 340
дрожжи 10
молоко 3.2% 200
сахар 25
соль 5
масло подсолнечное 30
тесто
капуста 700
сахар 25
соль 7
масло сливочное 82.5% 40
яйцо 2c0
начинка
#Веганский пирог с капустой
мука 340
вода 200
дрожжи 10
соль 1чл
сахар 1стл
масло растительное 2стл
тесто
1/4{
капуста 2067
лук 480
морковь 533
масло растительное 100
соль 30
/перец
}
начинка
#капустный пирог
/https://www.youtube.com/watch?v=shQRPLpJODs
/выпекать при 180 градусах 30 минут 
мука 250 г. 
/разрыхлитель 3 г.
растительное масло 100 мл.
вода теплая 100 мл.
соль 3 г.
тесто
капуста 400 г. 
опята 200 г.
морковь 120 г.
лук 120 г.
растительное масло 30 мл.
/соль перец зелень.
начинка
сода ¼ ч.л.
вода 30 мл
намазка
`
	, `баклажанная икра
/любовь ким https://www.youtube.com/watch?v=vA_moTMHEm8
1{
баклажаны 4 кг.
помидоры 2 кг
лук 1.5  кг.
болгарский перец 1.5 кг.
чеснок 120 гр.
соль 3 стл
сахар 4 стл.
масло растительное  600 мл.
кинза зеленая 100 г.
}
#баклажанная икра
/кухня армянки https://www.youtube.com/watch?v=KIwQj_ASeZM
1{
баклажаны 5 кг 
/взвешиваем в запеченном, очищенном виде
болгарский перец 1,2 кг
/ ( запечённые ) (красный+зеленый (по ровну)вместе 1,2 кг) 
лук 350
морковь 250
/ (я добавила еще 400 г )
сахар 90
соль 100
масло подсолнечное 900 мл 
помидоры 500
вода 350 
/зелень (я добавила петрушку. По рецепту нужен так же укроп) по вкусу
/специи 1 ч/л острый перец Чили 
/черный перец 1стл  
/1 ст/л сладкий перец 
}
#баклажанная икра
/дастарханчик https://www.youtube.com/watch?v=N1FVMNHXrfs
1{
баклажаны 1200
лук 400
помидоры 650
красный болгарский перец 600
растительное масло 50 мл.
соль 26
сахар 2 ч.л.
чеснок 50 г.
/хмели-сунели - 1 ст.л. ( по вкусу )
/кориандр - 0,5 ч.л.
/1/3чл=2г bolshoyvopros.ru/questions/2562151-skolko-gramm-chernogo-perca-v-chajnoj-lozhke.html
черный перец 2
/петрушка - 30 г.
}
#баклажанная икра
/ольга уралочка https://www.youtube.com/watch?v=lBVvkTYLwxA
1{
баклажаны 3.5 кг
помидоры 2 кг
лук 1.5 кг
болгарский перец 1.5 кг
чеснок 120 г
/перец острый 2 шт
соль 3 стл 
сахар 4 стл 
масло растительное 500 г
уксус 70% 3 чл
кинза зелёная 100 г
}
#баклажанная икра
/андрей ростовский https://www.youtube.com/watch?v=IOTxxhMk5Ik&t=45s
1{
баклажаны 2500  
томаты 1500
лук 1000
морковь 800
перец болгарский 700
чеснок 100
перец черный горошком 0
сахар 20
соль 25
/пока нет массы, в рецепте не указано
масло растительное 0
}
`
, String.raw`кабачковая икра "Царевна"
\рецепт матери
кабачки 3 кг
морковь 1 кг 
лук 1 кг
помидоры 1кг 
/в ориг. рец. томатная паста 4 стл, мать кладёт 1кг помидор
масло подсолнечное 0.5 л 
уксус 70% 1 стл
соль 2.5 стл
/сахар по вкусу

#кабачковая икра
/Любовь Ким
/https://www.youtube.com/watch?v=-meMPbiRp40
кабачки 5 кг.
морковь 1.7 кг.
лук 1.5 кг.
/томатная паста 5 ст. ложек.
масло растительное 600 мл.
уксус 70% 35мл
/уксус 70%  3 ст .ложки(не полные) . ЛОЖКИ У ВСЕХ РАЗНЫЕ. МОЖНО ИСПОРТИТЬ. НАПИСАЛА В МЛ. (35 мл)
соль  130
сахар 250
/перец черный по - вкусу.`
, `грибная икра
/канал Елена Туряница - Учимся Готовить Вместе!
/https://www.youtube.com/watch?v=CUM972gJUDA
/опята отваренные
опята 1,5кг
лук 400гр
морковь 400гр
растительное масло 100
соль 3ч.л
уксус 9% 50мл
сахар 3ч.л
/перец молотый 0.5ч.л
/чеснок 4-5зубчиков

#грибная икра
/канал "От Татьяны с любовью!"
/https://www.youtube.com/watch?v=BnPSglFq7cc
/опята отваренные
опята 1 кг
лук 250
морковь 200
/чеснок 2-3зубчика
растительное масло 100
соль 20
уксус 9% 2стл
/черный молотый перец по вкусу

#грибная икра
/Калнина Наталья
/https://www.youtube.com/watch?v=1sTpYHEwq3U
опята 1,5 кг.
лук 500 г
морковь 300 г
растительное масло 100мл
/соль 1ст.л. с горкой
соль 1ст.л.
уксус 9% 2 ст.л. 
помидоры 1 кг
/чеснок -3-4зуб.
/черный перец 1/2ч.л.

#грибная икра
/https://www.youtube.com/watch?v=0BsbuBLKNH4
опята варёные 3 кг
морковь 700 гр
лук  700 гр
/масло уменьшить в 2-2.5 раза
масло растительное 400 мл
масло растительное 100 мл
/чеснок 3 зубчика  (по желанию)
соль 2,5ст ложки
/сахар 0,5 ст ложки
/томатная паста 1ст ложка
уксус 9% 2,5 ст ложки`

,`#пельмени
/https://www.youtube.com/watch?v=_0Q2WyhqHLA
мука 600 гр.
соль 1 ч.л.
вода 190 мл. 
растительное масло 60 мл.
яйцо 2 шт.
тесто
фарш свиной 600гр.
лук 400
/луковица 2 шт.
/чеснок 3-4 зуб.
вода 70 мл.
соль 1ч.л.
начинка
/масло сливочное

#пельмени
/фуди 185шт
/https://www.youtube.com/watch?v=UHjO2OBlnp0
/ккал/10штук 4264/185*10=230.5
просеянная пшеничная мука 500 гр
горячая вода 70-75 градусов 250 мл
яйцо 1 шт.
соль 1 ч. л.
растительное масло 25 г
тесто
свиной фарш 550 гр
лук репчатый 200 гр
сало 30 гр
вода 80 гр
соль 1 ч. л.
/черный перец по вкусу
начинка
/масло сливочное`

]
/*
	, `пастила из яблок
яблоко 1000 остаток183
сахар 200
#пастила из ревеня
ревень 1000 остаток106
сахар 200
#малиновый компот
сахар 250
малина 700
вода 3000-250-700`
	, `суп на свиных костях
вода 3494-(100+160+123+60+35)
свиные кости 1256 потеря100%
перловка 100
морковь 160
лук 123
крапива 60
соль 35
#тарелка супа на свиных костях
суп 3*120{
вода 3494-(100+160+123+60+35)
свиные кости 1256 потеря100%
перловка 100
морковь 160
лук 123
крапива 60
соль 35
}
/сухари из батона арбатского, для пересчёта в хлеб масса делится на 1-0.364
батон арбатский 10/(1-0.364)
крапива 14
майонез 4
/перец черный
`
	//need to set #сныть маринованная на банку 720мл otherwise recognise as сныть which is in database
	//should parse only part on string because of "растительное масло для теста" pancakes
	, `#сныть маринованная на банку 720мл
сныть 423.5
уксус 70% 0.5 чл
гвоздика 2 штуки потеря 100%
черный перец 2 штуки потеря 100%
черный душистый перец 2 штуки потеря 100%
соль 7.2
сахар 3.6
вода 720-437`

	, `гречка с печенью
гречка 45
вода 132-45
1/12{
печень цыпленка бройлера 702+786
соль 30
лук 1500
масло подсолнечное 862-757
}`
	, `перловка с тушеной капустой
перловка 45
вода 132-45
перловка
тушеная капуста 3000/15{
капуста 2000
лук 500
морковь 500
соль 30
масло подсолнечное 78
/рассол
}
тушеная капуста
#тушеная капуста
капуста 2000
лук 500
морковь 500
соль 30
масло подсолнечное 78
/рассол`
	, `кекс столичный
/люда изи кук
/https://youtu.be/f1C39SpO6Yo?t=77
мука 300
сахар 225
яйцо 4со
масло сливочное 82.5% 225
разрыхлитель 7 бжу 0.2 0 19.6
соль 1/3чл
изюм 225
/сметана 70
/сок апельсина 40
/цедра апельсина 1стл
/экстракт ванили 1чл

#кекс столичный с цукатами
/любимая работа
/https://youtu.be/WV6OEyB5xwA?t=86
/в комментах
масло сливочное 1 кг
сахар 1 кг. 
яйцо 20co 
изюм 1 кг.
мука 1300 
ванилин 4 гр.
/по желанию разрыхлитель

#слоеное тесто
/Калнина Наталья
/https://www.youtube.com/watch?v=q9iIyUOuq7E
мука 650гр.
масло сливочное 82.5% 360
вода 220
соль 1 ч.л.
уксус 9% 1 ч.л.

#ватрушка на песочном тесте
/люда изи кук
/https://www.youtube.com/watch?v=nbXYtRz-BsM
масло сливочное 82.5% 150
мука 300
яйцо 1со
разрыхлитель 5 бжу 0.2 0 19.6
сахар 100
соль 1/4чл
/экстракт ванили 1чл
тесто
творог 9% 500
сметана 15% 300
яйцо 3со
сахар 125
/экстракт ванили 1чл
/кукурузный крахмал 300
начинка`

,`хлеб
/https://www.youtube.com/watch?v=YUZm9yRgyTA
мука пшеничная 350
вода теплая 210
дрожжи сухие 5
сахар 1 ч.л.
соль 1 ч.л.
растительное масло 30

#хлеб остаток 571
/https://www.youtube.com/watch?v=kLDklTtKu5E
мука 400
вода 300 остаток#
дрожжи 5
соль 1чл
растительное масло 1 стл`
*/