gdate='2023-02-14';gdata=`Моргенштерн, Егор Крид 35397263 2021-9-16 6223
Анастасия Волочкова, Владимир Винокур 31789442 2022-1-12 6034
Рустам Рептилоид, Богдан Титомир, Азамат Мусагалиев, Денис Дорохов, Джиган 52880873 2021-12-30 12205
Александр Ревва, Сергей Орлов 40110299 2021-12-16 7074
Амиран Сардаров, Расул Чабдаров 29665519 2021-12-1 7512
DAVA, Паша Техник 26069616 2021-10-28 4399
Евгений Понасенков, Александр Емельяненко 33560694 2021-10-7 4501
Юрий Лоза, Андрей Бебуришвили 28494301 2021-8-5 5444
Иван Дорн, Заур Байцаев 28349672 2021-6-23 6265
Михаил Галустян, Григорий Лепс 46051491 2021-6-3 6189
Евгений Чебатков, Big Russian Boss 32494772 2021-5-19 6117
Даня Милохин, Иван Абрамов 37287431 2021-4-21 7076
Павел Воля, Сергей Детков 33072856 2021-4-1 6517
Антон Лапенко, Александр Гудков 37007278 2021-1-13 5866
Дмитрий Губерниев, Настя Ивлеева, Олег Майами, Гарик Харламов, Джиган 75277288 2020-12-30 10479
Павел Деревянко, Денис Дорохов 40127229 2020-12-9 5186
Слава Комиссаренко, Отар Кушанашвили 27738486 2020-11-18 4271
Никита Джигурда, Павел Дедищев 34747799 2020-10-29 7483
Богдан Титомир, Василий Уткин 29470330 2020-10-7 4976
HammAli & Navai, Братья Пономаренко 25640509 2020-9-17 4611
Алексей Смирнов, Михаил Шуфутинский 22520358 2020-9-3 4813
Доминик Джокер, Виталий Милонов 20018113 2020-8-20 4888
Антон Шастун, NILETTO 32884642 2020-7-30 5548
Джиган, Ваня Усович 44504875 2020-7-9 4778
Настя Ивлеева, Тимати 55554974 2020-6-18 6772
Витя АК, Митя Фомин 19453682 2020-5-13 4044
Незлобин, Вассерман 22399913 2020-4-23 4639
Юрий Дудь, Лолита 42998199 2020-4-2 5353
Мигель, Сарик Андреасян, Артур Чапарян 28633475 2020-1-14 5356
Шура, Азамат, Дмитрий Губерниев 22277400 2019-12-26 4642
Моргенштерн, Артемий Лебедев 38958405 2019-12-12 4305
Вадим Галыгин, Джиган 38665909 2019-11-28 5686
Анатолий Цой, КраСава 26609658 2019-11-14 4783
Александр Шпак, Сергей Минаев 21611507 2019-10-31 3474
Илья Соболев, Давидыч 31279098 2019-10-17 4433
Стас Костюшкин, Семён Слепаков 26253435 2019-10-3 4830
Гарик Мартиросян, Олег Майами 39671943 2019-9-20 4049
Крид, Азамат, Белый, Сергеич 43123357 2019-8-1 6123
Kyivstoner, Михаил Шац 31440135 2019-7-11 2724
Тимур Батрутдинов, Тимур Каргинов 19811457 2019-6-20 3009
Николай Соболев, Тарзан 28438522 2019-6-7 3343
Jah Khalib, Иосиф Пригожин 16793622 2019-5-23 1456
Баста, Прохор Шаляпин 19607291 2019-5-10 1458
Гарик Харламов, Мигель 31510601 2019-4-25 2320
Гурам Амарян, Демис Карибидис removed 2021-7-16 4386`