function load() {
	/*https://www.youtube.com/watch?v=Fgm__UK8yuU
	modified ольга уютный уголок 6 чебуреков, на сковороду диаметра 21см, тесто подходит для пельменей, вареников
	*/
	recipeLoad({p:`#6 чебуреков на сковороду ⌀ 21 сантиметр
мука 300 ц45.89/2
вода 150
соль 0.5ч.л. ц11.89
масло подсолнечное 1стл ц92.99/0.9*0.92
тесто
фарш свиной 300 ц399.9
лук 150 ц49.99
соль 1чл ц11.89
перец черный 3 ц55.99/0.020
вода 50
начинка
масло подсолнечное 60 ц92.99/0.9*0.92
масло для жарки
#4 чебурека на сковороду ⌀ 21 сантиметр
2/3{
мука 300 ц45.89/2
вода 150
соль 0.5ч.л. ц11.89
масло подсолнечное 1стл ц92.99/0.9*0.92
тесто
фарш свиной 300 ц399.9
лук 150 ц49.99
соль 1чл ц11.89
перец черный 3 ц55.99/0.020
вода 50
начинка
масло подсолнечное 60 ц92.99/0.9*0.92
масло для жарки
}`
, columns: { "строка в чеке / дата чека": 0 }
,price:'55.99/0.125'
,mass:65
,days:1
})
}
