function load() {
	s = '<table class="table_border table_color"><thead><th>буква<th>кол-во<th>список стран</thead>'
	ma = new Map();
	const st = 1
	g = st - 1
	tg = Array.from(ti, () => [])
	for (m of data.matchAll(/^(\d+)\t.+?\t(.+?)\t/gm)) {
		if (m[1] == 1) {
			g++
		}
		c = m[2]
		if (g != st) {
			tg[g - 1].push(c)
		}
		ma.set(c, (ma.get(c) ?? '') + g)
	}
	l = ''
	sg = ''
	t = [0, 0]
	r = 0
	rt = 0
	ru = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	fu = () => {
		t[0]++;
		s += `<tr><td>` + l + '<td>' + c + (r ? '/' + r : '') + '<td>' + sg
		ru = ru.replace(l, '')
	}
	[...ma.entries()].sort((a, b) => a[0].localeCompare(b[0])).forEach(e => {
		k = e[0]
		v = e[1]
		f = k[0]
		t[1]++
		if (f != l) {
			if (l) {
				fu()
			}
			l = f
			c = 1
			r = 0
			sg = ''
		}
		else {
			sg += ', '
			c++
		}
		sg += k
		if (v != st) {
			sg += '<sub>' + v + '</sub>'
			r++
			rt++
		}
	})
	fu()
	s += `<tr><td>${t[0]}<td>${t[1] + '/' + rt}<td>отсутствующие буквы ` + ru.toLowerCase()
	s += '</table>'
	el('p').innerHTML = s + ti.reduce((a, e, i) => a + '<li>' + e +
		(i ? ': ' + tg[i].join(', ') + ` [${tg[i].length}]` : '') + '.', '<ol>') + '</ol>'
}
ti = ['Член ООН', 'Постоянные наблюдатели при ООН, не являющиеся членом ООН', 'Члены ООН, имеющие ограниченное признание', 'Не члены ООН, признанные хотя бы одним членом ООН', 'Не члены ООН, не признанные ни одним членом ООН', 'Государства, ассоциированные с Новой Зеландией']
//https://ru.wikipedia.org/wiki/Список_государств
data = `1	Австралия	Австралия	Австралийский Союз
2	Австрия	Австрия	Австрийская Республика
3	Азербайджан	Азербайджан	Азербайджанская Республика
4	Албания	Албания	Республика Албания
5	Алжир	Алжир	Алжирская Народная Демократическая Республика
6	Ангола	Ангола	Республика Ангола
7	Андорра	Андорра	Княжество Андорра
8	Антигуа и Барбуда	Антигуа и Барбуда	Антигуа и Барбуда
9	Аргентина	Аргентина	Аргентинская Республика
10	Армения	Армения	Республика Армения
11	Афганистан	Афганистан	Исламский Эмират Афганистан
12	Багамские Острова	Багамы	Содружество Багамских Островов
13	Бангладеш	Бангладеш	Народная Республика Бангладеш
14	Барбадос	Барбадос	Барбадос
15	Бахрейн	Бахрейн	Королевство Бахрейн
16	Беларусь	Беларусь	Республика Беларусь
17	Белиз	Белиз	Белиз
18	Бельгия	Бельгия	Королевство Бельгия
19	Бенин	Бенин	Республика Бенин
20	Болгария	Болгария	Республика Болгария
21	Боливия	Боливия	Многонациональное Государство Боливия
22	Босния и Герцеговина	Босния и Герцеговина	Босния и Герцеговина
23	Ботсвана	Ботсвана	Республика Ботсвана
24	Бразилия	Бразилия	Федеративная Республика Бразилия
25	Бруней	Бруней	Государство Бруней-Даруссалам
26	Буркина-Фасо	Буркина-Фасо	Буркина-Фасо
27	Бурунди	Бурунди	Республика Бурунди
28	Бутан	Бутан	Королевство Бутан
29	Вануату	Вануату	Республика Вануату
30	Великобритания	Великобритания	Соединённое Королевство Великобритании и Северной Ирландии
31	Венгрия	Венгрия	Венгрия
32	Венесуэла	Венесуэла	Боливарианская Республика Венесуэла
33	Восточный Тимор	Восточный Тимор	Демократическая Республика Восточный Тимор
34	Вьетнам	Вьетнам	Социалистическая Республика Вьетнам
35	Габон	Габон	Габонская Республика
36	Республика Гаити	Гаити	Республика Гаити
37	Гайана	Гайана	Кооперативная Республика Гайана
38	Гамбия	Гамбия	Республика Гамбия
39	Гана	Гана	Республика Гана
40	Гватемала	Гватемала	Республика Гватемала
41	Гвинея	Гвинея	Гвинейская Республика
42	Гвинея-Бисау	Гвинея-Бисау	Республика Гвинея-Бисау
43	Германия	Германия	Федеративная Республика Германия
44	Гондурас	Гондурас	Республика Гондурас
45	Гренада	Гренада	Гренада
46	Греция	Греция	Греческая Республика
47	Грузия	Грузия	Грузия
48	Дания	Дания	Королевство Дания
49	Джибути	Джибути	Республика Джибути
50	Доминика	Доминика	Содружество Доминики
51	Доминиканская Республика	Доминикана	Доминиканская Республика
52	Египет	Египет	Арабская Республика Египет
53	Замбия	Замбия	Республика Замбия
54	Зимбабве	Зимбабве	Республика Зимбабве
55	Израиль	Израиль	Государство Израиль
56	Индия	Индия	Республика Индия
57	Индонезия	Индонезия	Республика Индонезия
58	Иордания	Иордания	Иорданское Хашимитское Королевство
59	Ирак	Ирак	Республика Ирак
60	Иран	Иран	Исламская Республика Иран
61	Ирландия	Ирландия	Республика Ирландия
62	Исландия	Исландия	Исландия
63	Испания	Испания	Королевство Испания
64	Италия	Италия	Итальянская Республика
65	Йемен	Йемен	Йеменская Республика
66	Кабо-Верде	Кабо-Верде	Республика Кабо-Верде
67	Казахстан	Казахстан	Республика Казахстан
68	Камбоджа	Камбоджа	Королевство Камбоджа
69	Камерун	Камерун	Республика Камерун
70	Канада	Канада	Канада
71	Катар	Катар	Государство Катар
72	Кения	Кения	Республика Кения
73	Республика Кипр	Кипр	Республика Кипр
74	Кирибати	Кирибати	Республика Кирибати
75	Китай	Китай	Китайская Народная Республика
76	Колумбия	Колумбия	Республика Колумбия
77	Коморы	Коморы	Союз Коморских Островов
78	Республика Конго	Конго	Республика Конго
79	Демократическая Республика Конго	ДР Конго	Демократическая Республика Конго
80	Корейская Народно-Демократическая Республика	КНДР	Корейская Народно-Демократическая Республика
81	Республика Корея	Корея	Республика Корея
82	Коста-Рика	Коста-Рика	Республика Коста-Рика
83	Кот-д’Ивуар	Кот-д’Ивуар	Республика Кот-д’Ивуар
84	Куба	Куба	Республика Куба
85	Кувейт	Кувейт	Государство Кувейт
86	Кыргызстан	Кыргызстан	Кыргызская Республика
87	Лаос	Лаос	Лаосская Народно-Демократическая Республика
88	Латвия	Латвия	Латвийская Республика
89	Лесото	Лесото	Королевство Лесото
90	Либерия	Либерия	Республика Либерия
91	Ливан	Ливан	Ливанская Республика
92	Ливия	Ливия	Государство Ливия
93	Литва	Литва	Литовская Республика
94	Лихтенштейн	Лихтенштейн	Княжество Лихтенштейн
95	Люксембург	Люксембург	Великое Герцогство Люксембург
96	Маврикий	Маврикий	Республика Маврикий
97	Мавритания	Мавритания	Исламская Республика Мавритания
98	Мадагаскар	Мадагаскар	Республика Мадагаскар
99	Малави	Малави	Республика Малави
100	Малайзия	Малайзия	Малайзия
101	Мали	Мали	Республика Мали
102	Мальдивы	Мальдивы	Мальдивская Республика
103	Мальта	Мальта	Республика Мальта
104	Марокко	Марокко	Королевство Марокко
105	Маршалловы Острова	Маршалловы Острова	Республика Маршалловы Острова
106	Мексика	Мексика	Мексиканские Соединённые Штаты
107	Федеративные Штаты Микронезии	Микронезия	Федеративные Штаты Микронезии
108	Мозамбик	Мозамбик	Республика Мозамбик
109	Молдова	Молдова	Республика Молдова
110	Монако	Монако	Княжество Монако
111	Монголия	Монголия	Монголия
112	Мьянма	Мьянма	Республика Союз Мьянма
113	Намибия	Намибия	Республика Намибия
114	Науру	Науру	Республика Науру
115	Непал	Непал	Федеративная Демократическая Республика Непал
116	Нигер	Нигер	Республика Нигер
117	Нигерия	Нигерия	Федеративная Республика Нигерия
118	Нидерланды	Нидерланды	Королевство Нидерландов
119	Никарагуа	Никарагуа	Республика Никарагуа
120	Новая Зеландия	Новая Зеландия	Новая Зеландия
121	Норвегия	Норвегия	Королевство Норвегия
122	Объединённые Арабские Эмираты	ОАЭ	Объединённые Арабские Эмираты
123	Оман	Оман	Султанат Оман
124	Пакистан	Пакистан	Исламская Республика Пакистан
125	Палау	Палау	Республика Палау
126	Панама	Панама	Республика Панама
127	Папуа — Новая Гвинея	Папуа — Новая Гвинея	Независимое Государство Папуа — Новая Гвинея
128	Парагвай	Парагвай	Республика Парагвай
129	Перу	Перу	Республика Перу
130	Польша	Польша	Республика Польша
131	Португалия	Португалия	Португальская Республика
132	Россия	Россия	Российская Федерация
133	Руанда	Руанда	Республика Руанда
134	Румыния	Румыния	Румыния
135	Сальвадор	Сальвадор	Республика Эль-Сальвадор
136	Самоа	Самоа	Независимое Государство Самоа
137	Сан-Марино	Сан-Марино	Республика Сан-Марино
138	Сан-Томе и Принсипи	Сан-Томе и Принсипи	Демократическая Республика Сан-Томе и Принсипи
139	Саудовская Аравия	Саудовская Аравия	Королевство Саудовская Аравия
140	Флаг Северной Македонии	Северная Македония	Республика Северная Македония
141	Сейшельские Острова	Сейшелы	Республика Сейшельские Острова
142	Сенегал	Сенегал	Республика Сенегал
143	Сент-Винсент и Гренадины	Сент-Винсент и Гренадины	Сент-Винсент и Гренадины
144	Сент-Китс и Невис	Сент-Китс и Невис	Федерация Сент-Китс и Невис
145	Сент-Люсия	Сент-Люсия	Сент-Люсия
146	Сербия	Сербия	Республика Сербия
147	Сингапур	Сингапур	Республика Сингапур
148	Сирия	Сирия	Сирийская Арабская Республика
149	Словакия	Словакия	Словацкая Республика
150	Словения	Словения	Республика Словения
151	Соединённые Штаты Америки	США	Соединённые Штаты Америки
152	Соломоновы Острова	Соломоновы Острова	Соломоновы Острова
153	Сомали	Сомали	Федеративная Республика Сомали
154	Судан	Судан	Республика Судан
155	Суринам	Суринам	Республика Суринам
156	Сьерра-Леоне	Сьерра-Леоне	Республика Сьерра-Леоне
157	Таджикистан	Таджикистан	Республика Таджикистан
158	Таиланд	Таиланд	Королевство Таиланд
159	Танзания	Танзания	Объединённая Республика Танзания
160	Того	Того	Тоголезская Республика
161	Тонга	Тонга	Королевство Тонга
162	Тринидад и Тобаго	Тринидад и Тобаго	Республика Тринидад и Тобаго
163	Тувалу	Тувалу	Тувалу
164	Тунис	Тунис	Тунисская Республика
165	Туркменистан	Туркменистан	Туркменистан
166	Турция	Турция	Турецкая Республика
167	Уганда	Уганда	Республика Уганда
168	Узбекистан	Узбекистан	Республика Узбекистан
169	Украина	Украина	Украина
170	Уругвай	Уругвай	Восточная Республика Уругвай
171	Фиджи	Фиджи	Республика Фиджи
172	Филиппины	Филиппины	Республика Филиппины
173	Финляндия	Финляндия	Финляндская Республика
174	Франция	Франция	Французская Республика
175	Хорватия	Хорватия	Республика Хорватия
176	Центральноафриканская Республика	ЦАР	Центральноафриканская Республика
177	Чад	Чад	Республика Чад
178	Черногория	Черногория	Черногория
179	Чехия	Чехия	Чешская Республика
180	Чили	Чили	Республика Чили
181	Швейцария	Швейцария	Швейцарская Конфедерация
182	Швеция	Швеция	Королевство Швеция
183	Флаг Шри-Ланки	Шри-Ланка	Демократическая Социалистическая Республика Шри-Ланка
184	Эквадор	Эквадор	Республика Эквадор
185	Экваториальная Гвинея	Экваториальная Гвинея	Республика Экваториальная Гвинея
186	Эритрея	Эритрея	Государство Эритрея
187	Эсватини	Эсватини	Королевство Эсватини
188	Эстония	Эстония	Эстонская Республика
189	Эфиопия	Эфиопия	Федеративная Демократическая Республика Эфиопия
190	Южно-Африканская Республика	ЮАР	Южно-Африканская Республика
191	Южный Судан	Южный Судан	Республика Южный Судан
192	Ямайка	Ямайка	Ямайка
193	Япония	Япония	Государство Япония
Постоянные наблюдатели при ООН
Номер	Флаг	Страна	Полное название страны	Дата получения статуса наблюдателя при ООН
1	Ватикан	Ватикан	Государство-город Ватикан	1964 год
2	Палестина (историческая область)	Палестина	Государство Палестина	29 ноября 2012 года
Государства с неполными признаниями
См. также: Непризнанные и частично признанные государства
Государства — члены ООН, имеющие ограниченное признание
Государства — члены ООН, не признанные хотя бы одним государством — членом ООН.

Номер	Флаг	Страна	Полное название страны
1	Армения	Армения	Республика Армения
2	Израиль	Израиль	Государство Израиль
3	Республика Кипр	Кипр	Республика Кипр
4	Китай	Китай	Китайская Народная Республика
5	Корейская Народно-Демократическая Республика	КНДР	Корейская Народно-Демократическая Республика
6	Республика Корея	Корея	Республика Корея
Частично признанные государства
Государства — не члены ООН, признанные хотя бы одним государством — членом ООН.

Номер	Флаг	Страна	Полное название страны
1	Республика Абхазия	Абхазия	Республика Абхазия
2	Республика Косово	Косово	Республика Косово
3	Палестина (историческая область)	Палестина	Государство Палестина
4	Сахарская Арабская Демократическая Республика	САДР	Сахарская Арабская Демократическая Республика
5	Китайская Республика (Тайвань)	Тайвань	Китайская Республика (Тайвань)
6	Турецкая Республика Северного Кипра	ТРСК	Турецкая Республика Северного Кипра
7	Южная Осетия	Южная Осетия	Республика Южная Осетия
Непризнанные государства
Государства — не члены ООН, не признанные ни одним государством — членом ООН.

Номер	Флаг	Страна	Полное название страны
1	Приднестровская Молдавская Республика	ПМР	Приднестровская Молдавская Республика
2	Сомалиленд	Сомалиленд	Республика Сомалиленд
Иные образования
Государства, ассоциированные с Новой Зеландией
Номер	Флаг	Страна	Полное название страны
1	Ниуэ	Ниуэ	Ниуэ
2	Острова Кука	Острова Кука	Острова Кука`;
