gdate='2023-02-13';gdata=`Певчих – что коррупция сделала с Россией 12331520 2023-2-5 14331
Разговор с тем, кто поддерживает армию России 20778235 2023-1-16 10305
Парфенов – что происходит с Россией 10860157 2022-12-28 7812
Вера Полозкова – поэзия и война 5423558 2022-12-15 10337
Муратов – что происходит с Россией 10888067 2022-11-21 8982
Лобков – Чечня и Украина, журналистика и пропаганда 7446974 2022-11-8 10518
Noize MC – война и новая жизнь 9306735 2022-10-27 7570
Пропаганда – топливо войны 8735709 2022-10-11 7911
Маша Гессен – стыдные вопросы про Америку 5732520 2022-9-20 6926
Молочников – когда тебя отменяют в России 5957076 2022-9-7 9000
Баунов – что происходит с Россией 8634046 2022-8-4 7831
Серебренников – власть, арест, война 6280118 2022-7-21 8046
Яшин – быть против Путина, но оставаться в России 9983412 2022-6-16 6983
ещенепознер – до и во время войны 8344446 2022-6-10 9872
Романов – комики во время войны 9156109 2022-5-24 5501
Тиньков – болезнь и война 22928014 2022-5-11 6895
Машкова – как война разделяет семьи 13237980 2022-5-6 6974
Человек во время войны 7555001 2022-4-11 5254
Fасе – многое изменилось 12725188 2022-3-30 5969
Эйдельман – как устроена диктатура 12883662 2022-3-17 6302
Акунин – что происходит с Россией 25874538 2022-3-4 4744
Кватания – из чего получаются клипы и кино 3718176 2022-2-15 6601
Как жить, если лишают родины 10593474 2022-1-26 9694
Масяня – легенда русского интернета 7938605 2021-12-14 6575
Почему в России пытают 12727995 2021-12-7 8412
Комиссаренко – новая жизнь после протестов в Беларуси 14459539 2021-11-11 7397
«Ширли-мырли» – недооцененный шедевр про 90-е 4694189 2021-10-19 6246
Slava Marlow – суперуспех и депрессия в 21 год 13147450 2021-9-28 7508
Усачев уехал из России. Почему? 7935324 2021-9-14 6232
Loqiemean – другой рэп 5156004 2021-8-24 6550
Гордон – от «Закрытого показа» до «Мужское/Женское» 17097307 2021-8-2 5921
Орлов – комедия русской хтони 14140379 2021-7-13 7516
Гордеева – голос русской боли 7740935 2021-6-18 6921
Тима Белорусских – приговор, дочь, Беларусь 8034029 2021-6-3 6984
Animal Джаz – мировой стрит-арт и русская музыка 3602429 2021-5-26 6865
Ирина Кайратовна – новые звезды из Казахстана 11327132 2021-5-13 6874
Павлов-Андреевич – из телевизора в акционизм 3969763 2021-4-22 6797
Как просвещение может менять провинцию 5675080 2021-3-30 4220
Ивангай – где он пропадал 22227403 2021-3-17 7120
Чебатков – стендап для мозга 11086298 2021-3-3 6191
Бортич – протесты и рок-н-ролл 8555944 2021-2-18 5174
Сигарев – очень дерзкий режиссер 5126180 2021-2-3 6786
Птушкин – главный путешественник ютуба 26783310 2020-12-27 6208
Смирняга – как пересобрать карьеру в юморе 9226358 2020-12-16 5543
Антон Долин – стыдные вопросы про кино 13021811 2020-12-1 8683
Марков – как живет русская провинция 14886303 2020-11-18 7742
MORGENSHTERN – главный шоумен России-2020 30670583 2020-11-3 10039
Монеточка – новая жизнь, новый дом, новый альбом 7819522 2020-10-19 6177
Навальные – интервью после отравления 35113328 2020-10-5 8431
NEXTA – главное медиа белорусского протеста 9518397 2020-9-17 5665
Глуховский – рок-звезда русской литературы 7375777 2020-9-10 8001
Юра Борисов 6699893 2020-9-1 4863
Козырев – любить страну и ненавидеть государство 5732858 2020-8-13 6801
Усович – белорусские протесты и русский стендап 14344738 2020-7-29 4583
Лошак – как оставаться журналистом 6422630 2020-7-14 6546
IC3PEAK – music and modern art 8882988 2020-6-30 5592
Камчатка – полуостров, про который забыли 12927983 2020-6-2 6986
Деревянко – депрессия, Венесуэла, фрилав 8650388 2020-5-19 5210
Как устроена IT-столица мира 49252841 2020-4-23 11252
Ира Горбачева – очень необычная актриса 11626702 2020-4-7 6132
Anacondaz – про Россию и Родину-мать 5720328 2020-3-17 4869
Лапенко – новая звезда русского интернета 22913467 2020-3-3 4854
Андрей Колесников — летописец Путина 6479691 2020-2-18 4749
ВИЧ в России 23888828 2020-2-11 6506
Щербаков - спецназ, панк-рок, любовь 26846839 2020-1-28 5947
Антоха. Путешествие из Магадана в Европу 10363503 2019-12-17 5958
Бардаш - почему распались «Грибы»? Первое большое интервью 9505530 2019-12-3 8093
Долгополов - депрессия, политика, секс втроем 8642569 2019-11-25 5051
Батыгин – русская звезда мировой науки 10034450 2019-11-11 4866
Бекмамбетов - реклама в «Елках», BadComedian, дом Диснея 6109271 2019-10-31 5249
«Порнофильмы» – песни о сегодняшней России 6350554 2019-10-15 4516
Нурлан Сабуров – семья, страх, ЧтоБылоДальше 29392144 2019-10-8 4253
Гуриев - пенсионная реформа, демедведизация, доллар 24290041 2019-10-1 4497
Реутов ТВ: понять Россию через юмор 7121625 2019-9-26 6600
Беслан. Помни 25580512 2019-9-2 11407
ГРОТ - рэп о том, как живет Россия 5495199 2019-6-25 4368
Балагов 5114138 2019-6-11 4506
Егор Крид - уход из Black Star и звонок Поперечному 25058854 2019-5-28 6783
Алексей Иванов - о сытой Москве и небесном Челябинске 6398747 2019-5-22 4818
Давидыч – огромное интервью о жизни после тюрьмы 18649345 2019-5-15 8116
Русская Замбия 5343472 2019-5-7 2965
Колыма - родина нашего страха 28216626 2019-4-23 8257
Русский Голливуд 6544337 2019-4-2 5960
Таир Мамедов - почему он эмигрировал из России 9314538 2019-3-20 4619
Айсултан 7632588 2019-3-5 4777
Идов - чекисты, Монеточка, застой 4735982 2019-2-26 4244
Гордон - Украина, Россия, Ukraine, Russia 33304475 2019-2-19 5293
Первый рок-фест в СССР 5545507 2019-2-12 5575
Киселев - брат в США, племянник на войне, пенсия 13165165 2019-2-5 6094
Бурунов – ЦСКА, Ди Каприо, психотерапевт 23595212 2018-12-5 3802
Михалков - власть, гимн, BadComedian 13745718 2018-11-27 6548
Олег Табаков: как он воспитывал свободных людей 3723314 2018-11-20 4799
Новый русский юмор: Гудков, Соболев, Satyr 14426114 2018-11-13 7577
GONE.Fludd - главное рэп-открытие года 9200108 2018-10-23 3801
Чача – Санта-Барбара, Россия, Америка 3509319 2018-10-16 3844
Толоконникова - бисексуальность, FACE, тюрьма 10867629 2018-10-10 5223
Pharaoh - суки, слава, стиль 15358293 2018-10-2 4231
Кинчев - чувства верующих, самогон, рок-н-ролл 5356300 2018-9-25 4188
Нагиев - пенсии, стих в Кремле 36630159 2018-9-18 4839
Johnyboy - жизнь после поражения от Оксимирона 9908600 2018-9-11 5866
Белый - сроки за мемы, Версус, Поперечный 11921929 2018-9-5 4957
Лимонов - смерть, Навальный, устрицы 6145459 2018-8-28 4293
Ивлеева - про Элджея, секс и пластику 36317516 2018-8-21 3564
Доренко - о русском народе, Путине и деньгах 9673746 2018-8-14 4935
Сергей Супонев - друг всех детей 4877485 2018-8-7 4246
Ефремов - жить в России и кайфовать 10804046 2018-6-5 4321
Бледный - наркота, смерть, спасение 6426061 2018-5-29 4892
Колокольников 4035240 2018-5-22 4365
Балабанов – гениальный русский режиссер 12305051 2018-5-15 7806
Хабенский - «Метод-2» и Брэд Питт 13521166 2018-4-26 4710
Шило - о Кровостоке, психушке и совке 8827056 2018-4-24 3846
Олег ЛСП - о себе и Роме Англичанине 7722185 2018-4-17 4205
Цекало - «Норд-Ост», маньяки, выборы 7481082 2018-4-10 4273
MTV - главный канал нашего детства 6680326 2018-4-2 6381
Венедиктов – Путин, Путин, Леся, Путин 10773876 2018-3-13 5864
Пошлая Молли - рок-звезда поколения соцсетей 7799526 2018-3-7 2438
Агутин - о пьянстве, мемах и доме в Америке 6179791 2018-2-27 3792
Серебряков - об эмиграции и законе подлецов 14365130 2018-2-20 3713
Поперечный - о цензуре, геях и чувствах верующих 14096797 2018-2-13 3980
Грудинин: Сталин наш лучший лидер за 100 лет 9550740 2018-2-6 4293
Невзоров – о Фараоне и ориентации Милонова 24147150 2018-1-30 5100
Ройзман - о предателях и легалайзе 5911445 2018-1-23 5616
Новая Россия: The Hatters, Аксенова, Покрас Лампас, Пязок 6160014 2018-1-17 3990
Человек после войны 12314145 2018-1-8 2138
Петров - о BadComedian и лучшем русском режиссере 10091779 2017-12-25 3390
Feduk - автор главного хита этой осени 6624016 2017-12-19 2317
Слепаков - о "Нашей Russia" и современной России 10639389 2017-12-12 3778
Шевчук - о батле с Путиным и войне в Чечне 10024683 2017-12-7 3538
Артемий Лебедев - магистр мата и отец 10 детей 9974571 2017-12-4 4156
Собчак - о Навальном, крестном и выборах 17628308 2017-10-24 5807
Познер – цензура, страх и Путин 17122545 2017-10-18 4684
Face - почему от него фанатеет молодежь 16258609 2017-10-11 3080
Парфенов - о преемнике, Серебренникове и мате 7203376 2017-10-6 3557
Хлебников - лучший русский фильм-2017вДудь 3034424 2017-10-3 3346
Сергей Бодров - главный русский супергерой 14059726 2017-9-26 4034
Нейромонах Феофан - кто он на самом деле 6537528 2017-9-19 3140
Мартиросян - о рэпе, Хованском и танце с Медведевым 11679373 2017-9-12 4089
Роднянский - о Бондарчуке, "Оскаре" и киногонорарах 3287870 2017-9-4 4019
Жириновский - о драках, мемах и фашизме 18148938 2017-8-29 4371
Гнойный - большое интервью после батла 13342737 2017-8-23 3512
Jah Khalib - о деньгах, религии и Оксимироне 6045223 2017-8-15 3596
Ходорковский - об олигархах, Ельцине и тюрьме 24944305 2017-8-8 4950
Александр Паль - о "Горько", Бодрове и самой жесткой драке 8233379 2017-8-1 3559
Чичваркин #2 - об Украине, Навальном и возвращении домой 6488976 2017-7-27 2761
Чичваркин #1 - о Медведеве, контрабанде и дружбе с Сурковым 11903486 2017-7-25 3873
Юрий Быков - о "Методе", Хабенском и BadComedian 5751279 2017-6-20 3809
Тиньков - о Путине, Навальном и телках 11895967 2017-6-12 3497
Скриптонит - большое откровенное интервью 16292797 2017-6-6 2966
Дмитрий Маликов - о Хованском, Версусе и жизни после славы 4811285 2017-5-30 3173
Влади (Каста) - о Навальном, новом альбоме и Максе Корже 4112912 2017-5-23 3402
Максим Фадеев - о конфликте с Эрнстом и русском рэпе 9246957 2017-5-16 3131
BadComedian - о Бондарчуке, Саше Грей и 10 лучших русских фильмах 19221449 2017-5-10 3820
Гуф - о героине, разводе и новой жизни 16168419 2017-5-2 2834
Noize MC - о провале на Версусе, Первом канале и Хованском 7210689 2017-4-25 2555
Навальный - о революции, Кавказе и Спартаке 21730510 2017-4-18 3917
Иван Дорн - об оттепели и Егоре Криде 6266192 2017-4-11 3422
Соболев - о Путине, митингах и сексе 8167924 2017-4-4 3595
Илья Найшуллер - о Ленинграде, Ла-Ла Ленде и Тарантино 4454920 2017-3-28 3594
Ильич (Little Big) - о Киркорове и худшем видео в истории 8414585 2017-3-21 2384
Амиран (Дневник Хача) - сколько он зарабатывает 10683506 2017-3-13 2945
Ресторатор - об Оксимироне, цензуре и бабле 8588859 2017-3-7 2888
Шнур - об Алисе, Познере и рэпе 15604535 2017-2-21 2865
L'One - о баттле с Оксимироном, Украине и Фараоне 4716571 2017-2-14 2860
Баста - о Немагии и своей зарплате. Большое интервью 10965799 2017-2-7 3132`