/*виды сыроежек пока только один
*/
gMushroom = [
	/*съедобные употребляю*/['белый', 'валуй', 'вешенка обыкновенная', 'гиропорус синеющий', 'груздь черный'
		, 'дождевик грушевидный', 'дождевик жемчужный', 'дождевик луговой', 'дрожалка оранжевая', 'ежовик желтый'
		, 'зонтик краснеющий', 'зонтик пестрый', 'маслёнок обыкновенный', 'маслёнок перечный', 'млечник обыкновенный'
		, 'моховик зеленый', 'моховик трещиноватый', 'мухомор серо-розовый', 'опенок зимний', 'опенок летний'
		, 'опенок осенний', 'плютей олений', 'подберезовик', 'подосиновик', 'польский гриб'
		, 'поплавок белый', 'поплавок желто-коричневый', 'поплавок серый', 'порховка чернеющая', 'рядовка фиолетовая'
		, 'саркосцифа алая', 'сыроежка зеленая', 'трутовик серно-желтый', 'чесночник обыкновенный', 'шампиньон перелесковый'
		, '', '', '', '', '', '']
	,/*съедобные не употребляю, не пробовал*/['веселка', 'говорушка дымчатая', 'ежовик коралловидный', 'ложноопенок кирпично-красный', 'мухомор красный'
		, 'навозник белый', 'навозник мерцающий', 'навозник серый', 'паутинник триумфальный', 'подруздок белый'
		, 'подруздок черный', 'рыжик', 'рядовка желто-красная', 'строчок гигантский', 'строчок обыкновенный'
		, '', '', '', '', '', '']
	,/*съедобные не употребляю, не нравится*/['желчный гриб (горчак)', 'ложноопенок серо-пластинчатый', 'скрипица', 'трутовик чешуйчатый', 'чешуйчатка чешуйчатая'
		, '', '', '', '', '', '']
	,/*несъедобные, неядовитые*/['трутовик березовый', 'урнула бокальчатая', '', '', '', '', '', '']
	,/*ядовитые*/['бледная поганка', 'галерина окаймленная', 'гебелома клейкая', 'ложнодождевик обыкновенный', 'ложноопенок серно-желтый'
		, 'мухомор пантерный', 'свинушка тонкая', '', '', '', '', '', '']
	,/*неизвестные*/['', '', '', '', '', '']
	,/*неизвестные съедобность не указана в книгах*/['', '', '', '', '', '']
];

/*грибы отсортированы по группам, + в начале значит знал раньше
+'белый','гиропорус синеющий','масленок перечный','масленок обыкновенный','моховик зеленый','моховик трещиноватый','подберезовик','польский гриб'
,'зонтик краснеющий','зонтик пестрый'
,'мухомор серо-розовый','поплавок белый','поплавок желто-коричневый','поплавок серый'
,'чесночник обыкновенный'
,'опенок зимний'
,'шампиньон перелесковый'
+,'опенок осенний'
,'дождевик грушевидный','дождевик жемчужный','дождевик луговой','порховка'

'вешенка обыкновенная'
'ежовик желтый'
,'рядовка фиолетовая'

'дрожалка оранжевая'
'саркосцифа алая'

,'опенок летний'
,'плютей олений'
+,'сыроежка зеленая'
,'трутовик серно-желтый'

+'валуй'
+'груздь черный'
,'млечник обыкновенный'
*/
/*бузина красная
https://fermilon.ru/sad-i-ogorod/dekorativnye-kustarniki/buzina-krasnaya-lechebnye-svoystva-i-protivopokazaniya.html
*/
