/*https://гто76.рф/sdayushchemu/summary_table.html
data generated parseData() see begin of load() function*/
g = [[[21, 24, 35, 18, 21, 30], [27, 32, 42, 24, 27, 36], [32, 36, 46, 28, 30, 40], [35, 39, 49, 31, 34, 43], [36, 40, 50, 33, 36, 44], [33, 37, 48, 32, 35, 43], [30, 35, 45, 24, 29, 37], [26, 31, 41, 19, 22, 33], [24, 29, 39, 17, 20, 29], [22, 27, 35, 14, 16, 25], [19, 24, 31, 10, 12, 21], [14, 19, 27, 8, 11, 18], [11, 15, 24, 7, 9, 15], [9, 12, 21, 5, 7, 13], [6, 9, 16, 4, 6, 11], [4, 6, 14, 2, 4, 8]], [[1, 3, 7, 3, 5, 9], [2, 4, 8, 3, 5, 11], [3, 5, 9, 4, 6, 13], [4, 6, 11, 5, 8, 15], [6, 8, 13, 7, 9, 16], [6, 8, 13, 8, 11, 16], [5, 7, 12, 7, 9, 14], [3, 5, 11, 5, 7, 13], [2, 4, 10, 4, 6, 12], [1, 3, 9, 2, 4, 11], [0, 2, 8, 2, 4, 10], [-1, 1, 7, 1, 3, 9], [-2, 0, 5, 1, 3, 8], [-6, -4, -1, 0, 2, 6], [-8, -6, -4, -4, -1, 2], [-10, -8, -6, -6, -4, 0]], [[2, 3, 4, "-", "-", "-"], [2, 3, 5, "-", "-", "-"], [3, 4, 7, "-", "-", "-"], [6, 8, 12, "-", "-", "-"], [9, 11, 14, "-", "-", "-"], [10, 12, 15, "-", "-", "-"], [7, 9, 13, "-", "-", "-"], [5, 7, 12, "-", "-", "-"], [4, 6, 10, "-", "-", "-"], [4, 6, 9, "-", "-", "-"], [3, 5, 8, "-", "-", "-"], [2, 4, 7, "-", "-", "-"], [2, 3, 6, "-", "-", "-"], ["-", "-", "-", "-", "-", "-"], ["-", "-", "-", "-", "-", "-"], ["-", "-", "-", "-", "-", "-"]], [[7, 10, 17, 4, 6, 11], [10, 13, 22, 5, 7, 13], [13, 18, 28, 7, 9, 14], [20, 24, 36, 8, 10, 15], [27, 31, 42, 9, 11, 16], [28, 32, 44, 10, 12, 17], [22, 25, 39, 9, 11, 16], [16, 19, 32, 5, 7, 13], [13, 17, 29, 4, 6, 11], [13, 17, 28, 3, 5, 10], [11, 15, 27, 3, 5, 9], [9, 12, 24, 3, 5, 8], [7, 10, 18, 2, 4, 7], ["-", "-", "-", "-", "-", "-"], ["-", "-", "-", "-", "-", "-"], ["-", "-", "-", "-", "-", "-"]]]
A = [6, 9, 11, 13, 16, 18, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70];

B = ['бронза', 'серебро', 'золото']
MW = ['мужчины', 'женщины']
AB = [
	'Поднимание туловища из положения лежа  на спине (скручивания)',
	'Наклон вперед из положения стоя с прямыми ногами (наклоны)',
	'Подтягивание из виса на высокой перекладине (подтягивания)',
	'Сгибание и разгибание рук в упоре лежа на полу (отжимания)'
];
CLR = ['#CD7F32', '#C0C0C0', '#FFD700'
	, '#CD7F32', '#C0C0C0', '#FFD700'
]

T = (CLR.slice(0, 3).map(e => `<th style='background:${e}'>`).join('')).repeat(2);
Q = MW.map(e => '<th colspan=3>' + e).join('')
W = A.map((_, i) => A[i] + '-' + (i == A.length - 1 ? '∞' : A[i + 1] - 1))

TT = ['туловища из положения лежа', 'наклон вперед', 'подтягивание из виса на', 'сгибание и разгибание рук в упоре лежа']

function load() {
	/*
	//gd in scripts/gto_data.js file
	parseData()// output da=[...] g=[...]
	return
	//*/
	sr = s = ''
	da.split(/\n(?=1\D)/).forEach((e, i) => {
		if (i > 4 && i < 15) {
			j = i - 1 + i % 2
			s1 = A[j] + '-' + A[j + 2] + ' ' + MW[+!(i % 2)]
			a = i % 2 ? [0, 0] : [1, 1]
			s2 = a.reduce((a, e, i) => a + '<th colspan=3>' + MW[e] + ' ' + W[j + i], '')
		}
		else {
			s1 = W[i]
			a = [0, 1]
			s2 = a.reduce((a, e) => a + '<th colspan=3>' + MW[e], '')
		}
		a = `Возраст ${s1}`
		sr += `<a href='#${i}'>${a}</a><br>`
		s += `<h4 id='${i}'>${a}</h4><table class='table_border table_color q'><thead><tr><td colspan=2>${s2}<tr><td colspan=2>&nbsp;${T}</thead>`
			+ e.split(/\n/).map(e => '<tr>' +
				e.split('#').map((e, i, a) =>
					'<td' + (e.length > 90 ? ` style="font-size:75%"` : '') + (a.length == 3 && i == 2 ? ' colspan=6' : '') + '>' + e
				).join('')
			).join('')
			+ '</table>'
	})

	el('p').innerHTML = sr + AB.map((e, i) => `<a href="#${i + A.length}">${e}</a>`).join('<br>') + s
		+ AB.map((e, i) => `<h4 id="${i + A.length}">${e}</h4><table><tr><td>${ta(g[i])}<td id="td${i}"></table>`).join('')

	o = { width: 800, type: 'line', borderWidth: 3, color: CLR, ticksOnlyFirst: 1, sameScale: 1 }
	for (i = 0; i < AB.length; i++) {
		names = []
		data = []
		for (j = 0; j < 2; j++) {
			B.forEach((e, k) => {
				l = k + 3 * j
				names.push(e + ' [' + 'мж'[j] + ']')
				data.push(g[i].map(e => e[l] === '-' ? NaN : e[l]))//invalid should be NaN see createNGraphs
			});
		}
		createNGraphs('td' + i, names, W, data, o)
	}
}

function ta(e) {
	return `<table class="table_border table_color t"><thead><tr><td>${Q}<tr><th>возраст${T}</thead><tbody>`
		+ e.map((e, i) => `<tr><td>${W[i]}<td>` + e.join('<td>')).join('')
		+ '</table>'
}

function parseData() {
	x = new Map();
	w = A.map((_, i) => A[i] + '-' + (i == A.length - 1 ? '∞' : A[i + 1] - 1))
	redirectUrl()

	i = gd.indexOf('Возрастная группа от 25 до 29 лет ( более 12 часов)')
	j = gd.indexOf('<h3>', i)
	gd = gd.slice(0, i) + gd.slice(j);
	[['&ndash;', '-'], ['мин,с', 'мин, с'], ['90см', '90 см'], ['ё', 'е'], [':', ''], ['туритских', 'туристских']
		, ['3 х 10', '3х10'], ['количество раз в 1 мин', 'количество раз за 1 мин']
		, ['от уровня скамьи - см', 'см']

	].forEach(e => gd = gd.replaceAll(e[0], e[1]))
	gd = gd.replace(/<\/?span>|(?<=Б)\s(?=ег)/g, '').replace(/\s+/g, ' ')

	const RS = String.raw`\s*<td(?:\s+colspan="\d+")?>(.+?)<\/td>`
	const W = 7
	re = new RegExp(String.raw`<tr>\s*<td(?:\s+colspan="\d+")?(?:\s+rowspan="(\d+)")?>\s*(\d+)\s*\.?\s*<\/td>\s*` + RS.repeat(W), 'msg')
	s = sr = ''
	pn = 0;
	count = 0;
	g = []
	f = ''
	TT.forEach(() => g.push([]))
	for (e of gd.matchAll(re)) {
		e[2] = +e[2]
		if (e[2] == 1) {
			if (count) {
				s += '</table>'
			}
			b = count > 4 && count < 15
			if (b) {
				j = count - 1 + count % 2
				s1 = A[j] + '-' + A[j + 2] + ' ' + MW[+!(count % 2)]
				a = count % 2 ? [0, 0] : [1, 1]
				s2 = a.reduce((a, e, i) => a + '<th colspan=3>' + MW[e] + ' ' + w[j + i], '')
			}
			else {
				s1 = w[count]
				a = [0, 1]
				s2 = a.reduce((a, e) => a + '<th colspan=3>' + MW[e], '')
			}
			a = `Возраст ${s1}`
			sr += `<a href='#${count}'>${a}</a>\n`
			s += `<h4 id='${count}'>${a}</h4><table class='table_border table_color'><thead><tr><td colspan=2>${s2}<tr><td colspan=2>&nbsp;${T}</thead>`
			count++;
		}
		else if (e[2] != pn + 1) {
			console.log('error' + e[2] + ' ' + pn);
		}
		pn = e[2]
		s += '<tr><td>' + e[2]
		f += (f.length ? '\n' : '') + e[2]

		for (i = 0; i < W; i++) {
			b = e[i + 3].includes('colspan')
			v = n(e[i + 3])
			v1 = (b ? parseInt(e[i + 3]) : v)
			s += '<td' + (b ? ' colspan=6' : '') + '>' + v1;
			f += '#' + v1
			if (!i) {
				pp(v, e, x, 4)
			}
			if (b) {
				break
			}
		}

		if (e[1]) {
			i = e.index + e[0].length
			o = gd.slice(i, i + 5000)
			u = new RegExp(`<tr>` + RS.repeat(W), 'ms')
			for (i = 0; i < e[1] - 1; i++) {
				m = o.match(u)
				o = o.slice(m.index + m[0].length)
				s += '<tr><td>'
				f += '\n'
				v = n(m[1]).toLowerCase()
				if (v.startsWith('или ')) {
					v = v.slice(4)
				}
				//console.log(v,m)
				pp(v, m, x, 2)

				for (k = 0; k < W; k++) {
					v = n(m[k + 1])
					if (!v.length) {
						v = '-';
					}
					s += '<td>' + v
					f += '#' + v
				}
			}
		}
	}
	s += '</table>'
	//s1  = [...x].sort((a, b) => a[0].localeCompare(b[0])).map(e=>e.join(' ')).join('\n')

	for (k = 2; k < 4; k++) {
		g[k] = g[k].map(e => e.map(e => isNaN(e) ? '-' : e))
	}
	for (i = 5; i < 15; i += 2) {
		g[2].splice(i + 1, 0, ['-', '-', '-', '-', '-', '-'])
	}
	for (i = 0; i < 2; i++) {
		g[2].push(['-', '-', '-', '-', '-', '-'])
	}
	for (i = 0; i < 3; i++) {
		g[3].push(['-', '-', '-', '-', '-', '-'])
	}
	for (k = 0; k < 4; k++) {
		for (i = 5; i < 15; i += 2) {
			for (j = 0; j < 3; j++) {
				[g[k][i][j + 3], g[k][i + 1][j]] = [g[k][i + 1][j], g[k][i][j + 3]]
			}
		}
	}
	el('p').innerHTML = sr + s + "<pre>da=`" + f + "`</pre>g=" + JSON.stringify(g)
}

function n(s) {
	s = s.replaceAll(/<[^>]+>/g, '').replaceAll(/&lt;\*+?&gt;/g, '').replaceAll(/&nbsp;|<br \/>/g, ' ').replaceAll(/\s+/g, ' ').trim();
	return s
}

function pp(v, e, x, l) {
	v = v.toLowerCase()
	let j = TT.findIndex(e => v.includes(e))
	if (j != -1) {
		g[j].push(e.slice(l).map(e => +e))
	}
	x.set(v, (x.get(v) ?? 0) + 1)
}

da = `1#Челночный бег 3х10 м (с)#10,3#10,0#9,2#10,6#10,4#9,5
#или бег на 30 м (с)#6,9#6,7#6,0#7,1#6,8#6,2
2#Смешанное передвижение на 1 км (мин, с )#7.10#6.40#5.20#7.35#7.05#6.00
3#Подтягивание из виса на высокой перекладине (количество раз)#2#3#4#-#-#-
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#6#9#15#4#6#11
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#7#10#17#4#6#11
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+1#+3#+7#+3#+5#+9
5#Прыжок в длину с места толчком двумя ногами (см)#110#120#140#105#115#135
6#Метание теннисного мяча в цель, дистанция 6 м (количество попаданий)#2#3#4#1#2#3
7#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#21#24#35#18#21#30
8#Бег на лыжах на 1 км (мин, с)#10.15#9.00#8.00#11.00#9.30#8.30
#или смешанное передвижение по пересеченной местности на 1 км (мин, с)#9.00#7.00#6.00#9.30#7.30#6.30
9#Плавание 25 м (мин, с)#3.00#2.40#2.30#3.00#2.40#2.30
1#Бег на 30 м (с)#6,2#6,0#5,4#6,4#6,2#5,6
#или бег на 60 м (с)#11,9#11,5#10,4#12,4#12,0#10,8
2#Бег на 1 км (мин, с)#6.10#5.50#4.50#6.30#6.20#5.10
3#Подтягивание из виса на высокой перекладине (количество раз)#2#3#5#-#-#-
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#9#12#20#7#9#15
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#10#13#22#5#7#13
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+2#+4#+8#+3#+5#+11
5#Челночный бег 3х10 м (с)#9,6#9,3#8,5#9,9#9,5#8,7
6#Прыжок в длину с разбега (см)#210#225#285#190#200#250
#или прыжок в длину с места толчком двумя ногами (см)#130#140#160#120#130#150
7#Метание мяча весом 150 г (м)#19#22#27#13#15#18
8#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#27#32#42#24#27#36
9#Бег на лыжах на 1 км (мин, с)#8.15#7.45#6.45#10.00#8.20#7.30
#или кросс на 2 км (бег по пересеченной местности) (мин, с)#18.00#16.00#13.00#19.00#17.30#15.00
10#Плавание на 50 м (мин, с)#3.00#2.40#2.30#3.00#2.40#2.30
1#Бег на 30 м (с)#5,7#5,5#5,1#6,0#5,8#5,3
#или бег на 60 м (с)#10,9#10,4#9,5#11,3#10,9#10,1
2#Бег на 1,5 км (мин, с)#8.20#8.05#6.50#8.55#8.29#7.14
#или бег на 2 км (мин, с)#11.10#10.20#9.20#13.00#12.10#10.40
3#Подтягивание из виса на высокой перекладине (количество раз)#3#4#7#-#-#-
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#11#15#23#9#11#17
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#13#18#28#7#9#14
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+3#+5#+9#+4#+6#+13
5#Челночный бег 3х10 м (с)#9,0#8,7#7,9#9,4#9,1#8,2
6#Прыжок в длину с разбега (см)#270#280#335#230#240#300
#или прыжок в длину с места толчком двумя ногами (см)#150#160#180#135#145#165
7#Метание мяча весом 150 г (м)#24#26#33#16#18#22
8#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#32#36#46#28#30#40
9#Бег на лыжах на 2 км (мин, с)#14.10#13.50#12.30#15.00#14.40#13.30
#или кросс на 3 км (бег по пересеченной местности (мин, с)#18.30#17.30#16.00#21.00#20.00#17.40
10#Плавание на 50 м (мин, с)#1.30#1.20#1.00#1.35#1.25#1.05
11#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол и с упора для винтовки, дистанция - 10 м (очки)#10#15#20#10#15#20
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#13#20#25#13#20#25
12#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#5
1#Бег на 30 м (с)#5,3#5,1#4,7#5,6#5,4#5,0
#или бег на 60 м (с)#9,6#9,2#8,2#10,6#10,4#9,6
2#Бег на 2 км (мин, с)#10.00#9.40#8.10#12.10#11.40#10.00
#или бег на 3 км (мин, с)#15.20#14.50#13.00#-#-#-
3#Подтягивание из виса на высокой перекладине (количество раз)#6#8#12#-#-#-
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#13#17#24#10#12#18
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#20#24#36#8#10#15
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+4#+6#+11#+5#+8#+15
5#Челночный бег 3х10 м (с)#8,1#7,8#7,2#9,0#8,8#8,0
6#Прыжок в длину с разбега (см)#340#355#415#275#290#340
#или прыжок в длину с места толчком двумя ногами (см)#170#190#215#150#160#180
7#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#35#39#49#31#34#43
8#Метание мяча весом 150 г (м)#30#34#40#19#21#27
9#Бег на лыжах на 3 км (мин, с)#18.50#17.40#16.30#22.30#21.30#19.30
#или бег на лыжах на 5 км (мин, с)#30.00#29.15#27.00#-#-#-
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#16.30#16.00#14.30#19.30#18.30#17.00
10#Плавание на 50 м (мин, с)#1.25#1.15#0.55#1.30#1.20#1.03
11#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
12#Самозащита без оружия (очки)#15-20#21-25#26-30#15-20#21-25#26-30
13#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#10
1#Бег на 30 м (с)#4,9#4,7#4,4#5,7#5,5#5,0
#или бег на 60м (с)#8,8#8,5#8,0#10,5#10,1#9,3
#или бег на 100 м (с)#14,6#14,3#13,4#17,6#17,2#16,0
2#Бег на 2 км (мин, с)#-#-#-#12.00#11.20#9.50
#Бег на 3 км (мин, с)#15.00#14.30#12.40#-#-#-
3#Подтягивание из виса на высокой перекладине (количество раз)#9#11#14#-#-#-
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#-#-#-#11#13#19
#или рывок гири 16 кг (количество раз)#15#18#33#-#-#-
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#27#31#42#9#11#16
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+6#+8#+13#+7#+9#+16
5#Челночный бег 3х10 м (с)#7,9#7,6#6,9#8,9#8,7#7,9
6#Прыжок в длину с разбега (см)#375#385#440#285#300#345
#или прыжок в длину с места толчком двумя ногами (см)#195#210#230#160#170#185
7#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#36#40#50#33#36#44
8#Метание спортивного снаряда весом 700 г (м)#27#29#35#-#-#-
#весом 500 г (м)#-#-#-#13#16#20
9#Бег на лыжах на 3 км (мин, с)#-#-#-#20.00#19.00#17.00
#Бег на лыжах на 5 км (мин, с)#27.30#26.10#24.00#-#-#-
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#-#-#-#19.00#18.00#16.30
#или кросс на 5 км (бег по пересеченной местности) (мин, с)#26.30#25.30#23.30#-#-#-
10#Плавание на 50 м (мин, с)#1.15#1.05#0.50#1.28#1.18#1.02
11#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция -10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
12#Самозащита без оружия (очки)#15-20#21-25#26-30#15-20#21-25#26-30
13#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#10
1#Бег на 30 м (с)#4,8#4,6#4,3#5,4#5,0#4,6
#или бег на 60 м (с)#9,0#8,6#7,9#9,5#9,1#8,2
#или бег на 100 м (с)#14,4#14,1#13,1#15,1#14,8#13,8
2#Бег на 3 км (мин, с)#14.30#13.40#12.00#15.00#14.40#12.50
3#Подтягивание из виса на высокой перекладине (количество раз)#10#12#15#7#9#13
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#28#32#44#22#25#39
#или рывок гири 16 кг (количество раз)#21#25#43#19#23#40
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+6#+8#+13#+5#+7#+12
5#Челночный бег 3х10 м (с)#8,0#7,7#7,1#8,2#7,9#7,4
6#Прыжок в длину с разбега (см)#370#380#430#-#-#-
#или прыжок в длину с места толчком двумя ногами (см)#210#225#240#205#220#235
7#Метание спортивного снаряда весом 700 г (м)#33#35#37#33#35#37
8#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#33#37#48#30#35#45
9#Бег на лыжах на 5 км (мин, с)#27.00#25.30#22.00#27.30#26.30#22.30
#или кросс на 5 км (бег по пересеченной местности) (мин, с)#26.00#25.00#22.00#26.30#26.00#22.30
10#Плавание на 50 м (мин, с)#1.10#1.00#0.50#1.15#1.05#0.55
11#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
12#Самозащита без оружия (очки)#15-20#21-25#26-30#15-20#21-25#26-30
13#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#15
1#Бег на 30 м (с)#5,9#5,7#5,1#6,4#6,1#5,4
#или бег на 60 м (с)#10 , 9#10,5#9,6#11,2#10,7#9,9
#или бег на 100 м (с)#17,8#17,4#16,4#18,8#18,2#17,0
2#Бег на 2 км (мин, с)#13.10#12.30#10.50#14.00#13.10#11.35
3#Подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#10#12#18#9#11#17
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#10#12#17#9#11#16
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+8#+11#+16#+7#+9#+14
5#Челночный бег 3х10 м (с)#9,0#8,8#8,2#9,3#9,0#8,7
6#Прыжок в длину с разбега (см)#270#290#320#-#-#-
#или прыжок в длину с места толчком двумя ногами (см)#170#180#195#165#175#190
7#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#32#35#43#24#29#37
8#Метание спортивного снаряда весом 500 г (м)#14#17#21#13#15#18
9#Бег на лыжах на 3 км (мин, с)#21.00#19.40#18.10#22.30#20.45#18.30
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#19.15#18.30#17.30#22.00#20.15#18.00
10#Плавание на 50 м (мин, с)#1.25#1.15#1.00#1.25#1.15#1.00
11#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
12#Самозащита без оружия (очки)#15-20#21-25#26-30#15-20#21-25#26-30
13#Туристский поход с проверкой туриcтских навыков (протяженность не менее, км)#15
1#Бег на 30 м (с)#6,3#5,7#4,9#7,1#6,3#5,2
#или бег на 60 м (с)#12,1#11,1#8,9#12,5#11,5#9,2
2#Бег на 3 км (мин, с)#15.10#14.50#13.20#15.45#15.00#13.50
3#Подтягивание из виса на высокой перекладине (количество раз)#5#7#12#4#6#10
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#11#14#22#10#13#21
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#16#19#32#13#17#29
#или рывок гири 16 кг (количество раз)#19#22#39#18#21#37
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+3#+5#+11#+2#+4#+10
5#Прыжок в длину с места (см)#200#210#230#195#205#225
6#Метание спортивного снаряда весом 700 г (м)#27#29#34#27#29#34
7#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#26#31#41#24#29#39
8#Бег на лыжах на 5 км (мин, с)#29.00#27.00#23.30#31.50#29.50#25.50
#или кросс на 5 км (бег по пересеченной местности) (мин, с)#28.00#26.30#23.00#29.00#28.00#25.00
9#Плавание на 50 м (мин, с)#1.15#1.05#0.55#1.20#1.15#1.00
10#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
11#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#10
1#Бег на 30 м (с)#7,3#6,8#5,7#7,9#7,2#5,9
#или бег на 60 м (с)#12,9#12,3#10,7#13,2#12,6#10,9
2#Бег на 2 км (мин, с)#14.30#13.50#12.00#15.00#14.20#12.30
3#Подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#8#10#16#7#9#15
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#5#7#13#4#6#11
4#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+5#+7#+13#+4#+6#+12
5#Прыжок в длину с места (см)#140#150#170#130#140#165
6#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#19#22#33#17#20#29
7#Метание спортивного снаряда весом 500 г (м)#11#13#17#9#11#16
8#Бег на лыжах на 3 км (мин, с)#23.30#21.30#19.00#24.40#22.10#20.30
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#22.30#21.00#18.30#23.30#21.40#20.00
9#Плавание на 50 м (мин, с)#1.30#1.20#1.05#1.35#1.25#1.10
10#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#15#20#25#15#20#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#18#25#30#18#25#30
11#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#10
1#Бег на 2 км (мин, с)#13.00#12.00#10.00#13.20#12.15#10.30
2#Подтягивание из виса на высокой перекладине (количество раз)#4#6#9#3#5#8
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#9#11#20#7#10#18
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#13#17#28#11#15#27
#или рывок гири 16 кг (количество раз)#14#17#28#9#11#23
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+1#+3#+9#0#+2#+8
4#Бег на 30 м (с)#7,9#7,3#5,6#8,1#7,6#6,0
#или бег на 60 м (с)#12,8#12,0#9,6#14,4#13,5#11,1
5#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#22#27#35#19#24#31
6#Бег на лыжах на 5 км (мин, с)#37.00#34.40#28.10#40.00#37.00#31.00
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#22.00#20.30#16.30#23.00#21.00#17.00
7#Плавание на 50 м (мин, с)#1.20#1.10#1.00#1.25#1.15#1.05
8#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#13#16#25#10#13#25
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#16#21#30#13#18#30
9#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#5
1#Бег на 2 км (мин, с)#16.10#15.10#13.00#17.20#16.10#13.40
2#Подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#6#8#14#5#7#12
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#3#5#10#3#5#9
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+2#+4#+11#+2#+4#+10
4#Бег на 30 м (с)#8,5#7,9#6,2#8,7#8,2#6,5
#или бег на 60 м (с)#13,8#13,2#11,5#14,9#14,0#11,6
5#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#14#16#25#10#12#21
6#Бег на лыжах на 2 км (мин, с)#22.30#20.50#18.00#23.50#22.30#19.30
#или кросс на 2 км (бег по пересеченной местности) (мин, с)#17.00#16.00#13.30#18.00#17.00#14.30
7#Плавание на 50 м (мин, с)#1.38#1.28#1.15#1.40#1.30#1.20
8#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#13#16#22#10#13#20
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#16#21#27#13#18#25
9#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#5
1#Бег на 2 км (мин, с)#13.50#12.45#11.00#14.00#13.00#12.00
2#Подтягивание из виса на высокой перекладине (количество раз)#2#4#7#2#3#6
#или подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#4#7#15#3#5#12
#или рывок гири 16 кг (количество раз)#8#10#20#6#8#18
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#9#12#24#7#10#18
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#-1#+1#+7#-2#0#+5
4#Скандинавская ходьба на 3 км (мин, с)#27.00#26.00#24.00#28.00#27.00#25.00
5#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#14#19#27#11#15#24
6#Бег на лыжах на 5 км (мин, с)#44.00#40.40#34.00#50.00#45.30#37.00
#или кросс на 3 км (бег по пересеченной местности) (мин, с)#23.30#21.30#18.00#24.00#22.00#19.00
7#Плавание на 50 м (мин, с)#1.30#1.20#1.10#1.35#1.25#1.15
8#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#10#13#22#10#13#22
#Или стрельба из пневматической винтовки с диоптрическим прицелом или из «электронного оружия»#13#18#27#13#18#27
9#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#5
1#Бег на 2 км (мин, с)#18.00#17.00#14.30#20.00#19.00#15.50
2#Подтягивание из виса лежа на низкой перекладине 90 см (количество раз)#4#6#10#3#5#9
#или сгибание и разгибание рук в упоре лежа на полу (количество раз)#3#5#8#2#4#7
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#+1#+3#+9#+1#+3#+8
4#Скандинавская ходьба на 3 км (мин, с)#31.00#30.00#28.00#32.00#31.00#29.00
5#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#8#11#18#7#9#15
6#Бег на лыжах на 2 км (мин, с)#26.20#25.20#22.00#27.00#26.00#23.40
#или кросс на 2 км (бег по пересеченной местности) (мин, с)#19.00#18.00#15.30#21.00#20.00#16.30
7#Плавание на 50 м (мин, с)#1.45#1.35#1.25#1.50#1.40#1.30
8#Стрельба из пневматической винтовки из положения сидя или стоя с опорой локтей о стол или стойку, дистанция - 10 м (очки)#7#10#18#7#10#18
9#Туристский поход с проверкой туристских навыков (протяженность не менее, км)#5
1#Смешанное передвижение на 2 км (мин, с)#20.00#18.00#14.00#22.00#20.00#16.30
#или скандинавская ходьба на 3 км (мин, с)#29.00#28.00#26.00#31.00#30.00#28.00
2#Сгибание и разгибание рук в упоре о гимнастическую скамью (количество раз)#4#6#14#4#6#11
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#-6#-4#-1#-8#-6#-4
4#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#9#12#21#6#9#16
5#Передвижение на лыжах на 3 км (мин, с)#31.00#28.50#21.40#32.50#30.20#22.20
#или смешанное передвижение по пересеченной местности на 3 км (мин, с)#33.00#30.00#24.00#34.30#31.30#25.30
6#Плавание на 25 м (мин, с)#3.00#2.40#2.30#3.00#2.40#2.30
1#Смешанное передвижение на 2 км (мин, с)#23.00#21.00#18.00#25.00#23.00#20.00
#или скандинавская ходьба на 3 км (мин, с)#33.00#32.00#30.00#35.00#34.00#32.00
2#Сгибание и разгибание рук в упоре о гимнастическую скамью (количество раз)#3#5#7#3#5#7
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#0#+2#+6#-4#-1#+2
4#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#5#7#13#4#6#11
5#Передвижение на лыжах на 2 км (мин, с)#32.00#28.00#25.00#33.30#30.00#27.00
#или смешанное передвижение по пересеченной местности на 2 км (мин, с)#34.00#29.00#26.00#34.30#31.00#28.00
6#Плавание на 25 м (мин, с)#3.00#2.40#2.30#3.00#2.40#2.30
1#Смешанное передвижение на 2 км (мин, с)#24.00#22.00#19.00#28.00#26.00#22.00
#или скандинавская ходьба на 3 км (мин, с)#33.00#32.00#30.00#37.00#36.0#33.0
2#Сгибание и разгибание рук в упоре о сиденье стула (количество раз)#2#5#8#2#4#6
3#Наклон вперед из положения стоя с прямыми ногами на гимнастической скамье (см)#-10#-8#-6#-6#-4#0
4#Поднимание туловища из положения лежа на спине (количество раз за 1 мин)#4#6#14#2#4#8
5#Передвижение на лыжах на 2 км (мин, с)#-#-#-#35.00#31.00#28.00
#Передвижение на лыжах на 3 км (мин, с)#39.00#34.00#28.00#-#-#-
#или смешанное передвижение по пересеченной местности на 2 км (мин, с)#-#-#-#36.00#32.00#29.30
#или смешанное передвижение по пересеченной местности на 3 км (мин, с)#39.00#35.00#29.00#-#-#-
6#Плавание на 25 м (мин, с)#3.00#2.40#2.30#3.00#2.40#2.30`