const K = 0.0000175
const M = 60.05
const A = Math.pow(10, -2 * 4.6)

function ph(s, v, n, o = 0) {
	return -Math.log10(Math.sqrt(K * s * v * n / (100 * M * (1 + (o ? 0 : s * v / 1000)))))
}

function load() {
	q = ''
	for (i = 0; i < 2; i++) {
		v = i ? 5 : 15;
		n = i ? 70 : 9;
		q += 'для ' + v + 'мл ' + n + '% '
		s1 = 1000 / (v * (10 * K * n / (M * A) - 1))
		//s2 = 100 * M * A / (K * v * n)
		q += '&nbsp'.repeat(4) + 's &gt; ' + s1.toFixed(5)//+' '+s2.toFixed(5)
		//+' ph='+ph(s1,v,n)
		q += '<br>'
	}
	//console.log(10 * K / (M * A))
	const l = 6
	const horisontal = 1
	const V = [15, 5]
	const N = [9, 70]
	let a = []
	for (j = 0; j < 2 * l - 1; j++) {
		a.push(j < l - 1 ? '1/' + (l - j) : j - l + 2)
	}
	for (i = 0; i < 2; i++) {
		for (j = 0; j < 2 * l - 1; j++) {
			a.push(ph(eval(a[j]), V[i], N[i]).toFixed(2))
		}
	}
	l3 = a.length / 3
	f = i => V[i] + 'мл ' + N[i] + '%'

	if (horisontal) {
		q += '<table class="t1 single">'
			; a.forEach((e, i) => {
				j = i / l3;
				if (Number.isInteger(j)) {
					q += '<tr><th>' + (j ? f(j - 1) : '') + '<th>' + (i ? 'ph' : 'ложек')
				}
				q += '<td>' + e
			})
		q += '</table>'
	}
	else {
		q += '<table class="t1 single"><tr><th>'
		for (i = 0; i < 2; i++) {
			q += '<th>' + f(i)
		}
		q += '<tr><th>ложек' + '<th>ph'.repeat(2)
		for (j = 0; j < 2 * l - 1; j++) {
			q += '<tr><td>' + a[j]
			for (i = 0; i < 2; i++) {
				q += '<td>' + a[j + (i + 1) * l3]
			}
		}
		q += '</table>'
	}


	/* 	for(k=0;k<2;k++){
			s='s'+a.slice(0,l3).map(e=>' & '+e).join('')+'\\\\\n'
			for(j=0;j<2;j++){
				s+='ph'
				for(i=0;i<l3;i++){
					s+=' & '+ph(eval(a[i]),V[k], N[k],j!=0).toFixed(2)
				}
				s+='\\\\\n'
			}
			console.log(s)
		}
	 */

	d = []
	//https://chefs-academy.com/8-tablitsa-ph-produktov
	gd.split(/\n/).forEach(e => {
		if (e.length == 0) {
			return
		}
		a = e.split(';');
		b = a[1].split(' - ').map(e => Number(e))
		if (b.length == 2) {
			b = (b[0] + b[1]) / 2
		}
		else {
			b = b[0]
		}
		d.push([a[0], a[1], [formatNumber(b, 2), b]])
	});
	t = new Table(['название продукта', 'ph', 'ph среднее'], d, "sc2b");
	el('p').innerHTML = q + t.html();
}

gd = `Абрикосовый нектар;3.8
Абрикосы;3.3 - 4.8
Авокадо;6.3 - 6.6
Алое Вера;6.1
Апельсины;3.0 - 4.0
Арахисовое масло;6.3
Арбуз;5.2 - 5.6
Артишоки;5.5 - 6.0
Бананы;4.5 - 5.2
Батат (сладкий картофель);5.3 - 5.6
Батат (сладкий картофель), вареный;5.5 - 6.8
Белый хлеб;5.0 - 6.2
Бобы;5.6 - 6.5
Брокколи;5.3
Вино;2.8 - 3.8
Виноград;3.5 - 4.5
Вишня;3.2 - 4.5
Газированные напитки;2.0 - 4.0
Горох;5.8 - 6.4
Горчица;3.5 - 6.0
Грейпфрут;3.0 - 3.7
Груши;3.6 - 4.0
Дыня;6.0 - 6.7
Ежевика;3.9 - 4.5
Изюм;2.8 - 3.0
Кактус;4.7
Кальмары;5.8
Каперсы;6
Капуста;5.2 - 5.4
Каракатица;6.3
Карп;6
Картофель;5.6 - 6.0
Кетчуп;3.9
Кислая капуста;3.4 - 3.6
Кленовый сироп;4.6 - 5.5
Клубника, земляника;3.0 - 3.9
Клубничный (земляничный) джем;3.0 - 3.4
Клюквенный сок;2.3 - 2.5
Кокос;5.5 - 7.8
Кокосовое молоко;6.1 - 7.0
Крабовое мясо;6.5 - 7.0
Красный перец;4.6 - 5.2
Креветки;6.8 - 7.0
Крекеры;6.5 - 8.5
Крыжовник;2.8 - 3.1
Кукуруза;5.9 - 7.3
Курага (сушеные абрикосы);3.4 - 3.8
Лайм;1.8 - 2.0
Лаймовый сок;2.0 - 2.4
Лимоны;2.2 - 2.4
Лимонный сок;2.0 - 2.6
Лосось;6.1 - 6.3
Лук-порей;5.5 - 6.2
Малина;3.2 - 3.6
Мамалыга;6.8 - 8.0
Манго;5.8 - 6.0
Маслины;6.0 - 7.0
Масло;6.1 - 6.4
Меласса (черная патока);4.9 - 5.4
Молоко;6.4 - 6.8
Морковь;5.9 - 6.3
Морское ушко;6.1 - 6.5
Мука пшеничная;5.5 - 6.5
Мякоть томата;4.3 - 4.5
Нектарины;3.9 - 4.2
Овощной сок;3.9 - 4.3
Окунь, морской, жареный;6.6 - 6.8
Оливки;3.6 - 3.6
Пахта;4.4 - 4.8
Персики;3.4 - 4.1
Печень трески;6.2
Пиво;4.0 - 5.0
Питьевая вода;6.5 - 8.0
Помидоры;4.3 - 4.9
Ревень;3.1 - 3.2
Сардины;5.7 - 6.6
Свежие яйца;7.6 - 8.0
Свекла;4.9 - 6.6
Сельдерей;5.7 - 6.0
Сельдь;6.1
Сидр;2.9 - 3.3
Соевое молоко;7
Соевый соус;4.4 - 5.4
Соус Карри;6
Соус Чили;2.8 - 3.7
Спаржа;6.0 - 6.7
Сыр;4.8 - 6.4
Томатный сок;4.1 - 4.6
Тунец;5.9 - 6.1
Турнепс (репа);5.2 - 5.6
Тыква;4.8 - 5.2
Уксус;2.4 - 3.4
Уксус яблочный;3.1
Устрицы;5.7 - 6.2
Финики;6.5 - 8.5
Фруктовое желе;2.8 - 3.4
Фруктовый джем;3.5 - 4.0
Фруктовый коктейль;3.6 - 4.0
Херес;3.4
Хрен;5.4
Чай;7.2
Черника;3.1 - 3.4
Шпинат;5.5 - 6.8
Яблоки;3.3 - 3.9
`