gdata=String.raw`
/111111111
ты ста\рше меня\ в два ра\за
и наверно раз в триста умней
но смотрю на тебя в оба глаза
пряд туда между ног и кудрей

А\ в пятна\дцать бы\ло жи\ть, с предка\ми ла\жа
Потому\ и о\тдала\сь, хулига\ну Па\ше
Он ей даже говорил, что сидел в Бутырке
Но вот странно почему-то, собирал бутылки

Не\ воро\вка, не\ шала\ва,
сло\ва тако\го она\ раньше не зна\ла
Не воровка, не шалава,
жизнь началась с базара-вокзала

е\сли ты\ инце\л нормис и\ли ску\ф
для тебя есть альтушка с госуслуг
она лучше всех инстаграм шаболд
заходи на сайт если не куколд

Вот и\ прошли\ года\, но мы\ не ста\рые\,
Недолюбившие,сидим усталые.
Весна счастливая, а сколько красок в ней,
Под старой ивою течёт течёт ручей.

Течё\т руче\й, бежи\т руче\й,
И я ничья,и ты ничей,
Течёт ручей, бежит ручей,
И я ничья, и ты ничей.

У Све\тки Со\коло\вой де\нь рожде\нья,
Ей сегодня тридцать лет.
Я несу в подарок поздравленья
И красивый розовый букет.
Помнишь день рожденья
В пятом классе,
И тебе двенадцать лет.
Вот тогда, на зависть всем ребятам,
Я принёс свой розовый букет.

Ро\зовы\е ро\зы
Све\тке Со\коло\вой,
Светке Соколовой,
Однокласснице моей.
Розовые розы
Я несу ей снова,
В память наших школьных,
В память наших школьных дней.

/Демобилизация — Сектор Газа
Ско\рый по\езд к до\му мчи\тся,
Полечу домой, как птица,
Полечу, как птица, я.
Жизнь начнётся без авралов,
"Сундуков" и генералов,
Демобилизация. 

/акванавты
Поо\беща\йте мне\ любо\вь,
Пусть бе\зотве\тную\.
Узнаю в облике любом
По всем приметам я.
Пойду покорно наугад
Куда поманите.
И не сверну с пути назад
Когда обманите.

Ещё\ до встре\чи вы\шла на\м разлу\ка,
А всё же о тебе я вижу сны
Да разве мы прожили б друг без друга,
Мой милый, если б не было войны, 

За\ мои\ зеле\ные\ глаза\
Называешь ты меня - колдуньей.
Говоришь ты это мне не зря -
Сердце у тебя я забрала.

Все\ меня\ руга\ют, что\ жена\т,
Что уже детишек у вас двое.
Что же делать мне с тобой тогда?
Что же делать мне с тобою?

А\ я во\все не\ колду\нья, Я\ люби\ла и\ люблю\.
Это мне судьба послала Грешную любовь мою.
Не судите строго, люди, Пожалей меня, родня!
Видно, в жизни суждено мне Выпить грешного вина.

Ты\ говори\шь мне о\ любви\,
А разговор напрасно начат.
Слова я слушаю твои,
Но ничего они не значат.

Мо\жет, ты\ на све\те лу\чше все\х,
Только это сразу не поймёшь.
Одна снежинка — ещё не снег, ещё не снег,
Одна дождинка — ещё не дождь.

Око\нчен шко\льный рома\н, До ды\р зачи\танной кни\жкой.
На нём поставленный крест - Как перепутье у ног.
Подружка сводит с ума! И мой вчерашний мальчишка
С букетом наперевес Ее терзает звонок.

Нет го\речи\, нет гру\сти.
Звонок звенит - нет слада.
Она его не пустит.
Так надо.

/IN-GRID - Tu Es Foutu https://www.youtube.com/watch?v=r9MQ_JCWINM
жа\ркое со\лнце и ра\дугу ты\
мне зимой обещал
с пейзажем дивным открытку ты мне
лишь по почте прислал

ра\дость и сча\стье ты мне\ обеща\л
и до гроба любовь
вместо улыбки я вижу
гримасу лишь гадкую вновь

/финская полька https://www.youtube.com/shorts/5RMEYSKL6w4
му\зыка\ слышна\ отсю\да
ноги сами готовы в пляс
ева у матушки непоседа
за дочкой такой нужен глаз да глаз

но\ запре\ты так ма\ло зна\чат
если в такт музыке сердце скачет
если танец нас ведет
влево-вправо взад-вперед

На у\лице до\ждик, на у\лице сля\коть, А и\м все равно\.
Идут они вместе, один у них зонтик, Идут из кино.
Маленькая девочка маленькому мальчику
Задаёт вопрос: «Что такое небо? Что такое солнышко? Что такое любовь?»

У\ тебя\ в руке\ клубо\к-волше\бный шё\лк,
И какой бы я дорогою не шёл,
Он покатится, клубок, в золотых лучах зари.
Ариадна, ты мне ниточку надежды подари

А\риа\дна, А\риа\дна,
Заблудился я в чужой стране.
Ариадна, Ариадна,
Как из лабиринта выйти мне?

То бы\ло ра\ннею\ весно\й,
Трава едва всходила,
Ручьи текли, не парил зной,
И зелень рощ сквозила; 

Я\ не зна\ю что\, сказа\ть тебе\ при встре\че,
Не могу найти, хотя бы пары слов.
А недолгий вечер, а недолгий вечер
Скоро станет ночью тёмною без снов.

И сно\ва седа\я но\чь, И то\лько е\й доверя\ю я\.
Знаешь седая ночь, Ты все мои тайны.
Но даже и ты помочь Не можешь, и темнота твоя
Мне одному совсем, совсем ни к чему.

Звё\зды по\днима\ются вы\ше,
све\т уже\ не сво\дит с ума\.
Если ты меня не услышишь -
значит наступила зима.

В тот де\нь, когда\ ты мне\ присни\лся, я все\ приду\мала\ сама\.
На землю тихо опустилась зима, зима.
Я для тебя не погасила свет в одиноком окне.
Как жаль, что это все приснилось мне.

Не у\ходи\, побу\дь со мно\ю,
Здесь так отрадно, так светло,
Я поцелуями покрою
Уста, и очи, и чело.

Мо\жешь на любо\вь не отве\тить,
Не пускать даже в сны,
Но еще остались на свете
Колдуны, колдуны!

На\ша с не\й основна\я зада\ча
не\засту\канны\ми бы\ть на ме\сте
Явки, пароли, чужие дачи
и дома надо быть в десять

Мы могли\ бы служи\ть в разве\дке
Мы могли бы играть в кино
Мы, как птицы, садимся на разные ветки
И засыпаем в метро

Мне\ говоря\т: "Он ма\ленького ро\ста"
Мне говорят: "Одет он слишком просто"
Мне говорят: "Поверь, что этот парень"
"Тебе не пара, совсем не пара"

А он мне нра\вится, нра\вится, нра\вится
И для меня на свете друга лучше нет
А он мне нравится, нравится, нравится
И это все, что я могу сказать в ответ

Все\м, всем, все\м и ка\ждому\ скажу\
Я, я, я секретов не держу
Я, я, я — не шкаф и не музей
Хранить секреты от друзей

Ля-ля-ля\ Жу-жу-жу\
Ля-ля-ля Жу-жу-жу
По секре\ту всему све\ту
Что случилось, расскажу

В э\том ми\ре я го\сть непро\шенны\й
Отовсюду здесь веет холодом
Непотерянный, но заброшенный
Я один на один с городом

Сре\ди по\длости\ и преда\тельства\
И суда на расправу скорого
Есть приятное обстоятельство
Я люблю тебя - это здорово

Не\т, я не бу\ду говори\ть,
Что я все готов простить,
И обид не помню я.
Но, ты же знаешь все равно,
Что в душе моей темно
Если рядом нет тебя.

Но\чь, ожида\нья хо\лод
Боль, словно я расколот
Я ничего не вижу
Сам себя я ненавижу

Но\чь, что за стра\нная\ свобо\да
От заката до восхода
Ждать тебя надеясь вновь о-о-о
День, я прошу тебя не надо
От восхода до заката
Говорить мне про любовь о-о-о

Я\ заметила\ однажды\,
Как зимой кусты сирени
Расцвели, как будто в мае –
Ты мне веришь или нет?
Веришь мне или нет?

Хо\ть пове\рьте хо\ть прове\рьте но\ вчера\ присни\лось мне\
Будто принц, за мной примчался на серебряном коне
И встречали нас танцоры барабанщик и трубач
Сорок восемь дирижеров и один седой скрипач

Пу\сть говоря\т, мы редко\ видимся\ с тобой,
В сердце всегда ты со мной, ты со мной,
Пусть говорят, что не судьба нам быть вдвоем,
Люди твердят об одном, об одном.

Я\ - это ты\, ты\ - это я\,
И никого не надо нам,
Все, что сейчас есть у меня,
Я лишь тебе одной отдам.

Сего\дня пра\здник у\ девча\т:
Сегодня будут танцы!
И щёки девушек горят,
С утра горят румянцем.

Пришли\ девчо\нки, стоя\т в сторо\нке,
Платочки в руках теребят.
Потому что на десять девчонок
По статистике девять ребят.

Лу\ч со\лнца золо\того\
Тьмы скрыла пелена.
И между нами снова
Вдруг выросла стена.

Но\чь пройде\т, наста\нет у\тро я\сное\,
Верю, счастье нас с тобой ждёт.
Ночь пройдёт, пройдёт пора ненастная,
Солнце взойдет... Солнце взойдет.

Мы друзья\, перелё\тные пти\цы
Только быт наш одним не хорошь
На земле не успели жениться
А на небе жены не найдёшь

Потому\, потому\, что мы\ пило\ты
Небо наш, небо наш родимый дом
Первым делом, первым делом самолёты
Ну а девушки, а девушки потом

Сно\ва весь фро\нт раскалё\н от огня\,
Лупят зенитки три ночи, три дня,
А в гимнастёрке на снимке
Ты обнимаешь меня.

А\х, эти ту\чи в голубо\м
Напоминают море.
Напоминают старый дом,
Где кружат чайки за окном,

Е\сть на све\те цвето\к а\лый-а\лый,
Яркий, пламенный, будто заря,
Самый солнечный и небывалый,
Он мечтою зовётся не зря.

Мо\жет та\м, за седьмы\м перева\лом,
Вспыхнет свежий, как ветра глоток,
Самый сказочный и небывалый,
Самый волшебный цветок.

Я\ тверди\ла о\ моря\х и кора\ллах.
Я поесть мечтала суп черепаший.
Я шагнула на корабль, а кораблик
Оказался из газеты вчерашней.

По\ Берли\нской мо\стово\й ко\ни шли\ на во\допо\й,
Шли, потряхивая гривой, кони-Дончаки.
Распевает верховой: "Эх, ребята, не впервой
Нам поить коней казацких из чужой реки..."

Казаки\, казаки\,
Едут, едут по Берлину
Наши казаки.
Казаки, казаки,
Едут, едут по Берлину
Наши казаки.

Ми\мо бе\лого\ я\блока\ луны\,
Мимо красного яблока заката
Облака из неведомой страны
К нам спешат, и опять бегут куда-то.

Облака\ — бе\логри\вые\ лоша\дки!
Облака — что вы мчитесь без оглядки?
Не смотрите вы, пожалуйста, свысока,
А по небу прокатите нас, облака!

И\звини\те, по\жалу\йста ва\м,
Поможите, люди добрые!
Сами мы не местные,
Голодаем и скитаемся.

Не\ прогне\вайтесь, трудово\й наро\д.
Счастья вам. Извините за это обращение.
Здоровья вам и счастья.
Поможите просим.

/Modern Talking - Cheri Cheri Lady https://www.youtube.com/watch?v=IYmhjOHhvI4
одно чу\вство меня\
давно гложет и я
готов сердце
свое подарить

/Modern Talking - Cheri Cheri Lady https://www.youtube.com/watch?v=IYmhjOHhvI4
до\рога\я ле\ди
жизнь твоя беспечна
слушай свое сердце
чтоб найти любовь

/sara perche ti amo (Ricchi e Poveri) #https://www.youtube.com/shorts/hcOEYahF0Rg
в смяте\ньи бу\ду ведь та\к тебя\ люблю\ я
моё волненье медленно нарастает
прижми сильнее поближе подвигаясь
и всё прекрано ведь так люблю тебя я

/sara perche ti amo (Ricchi e Poveri) #https://www.youtube.com/shorts/hcOEYahF0Rg
вы\ше и вы\ше лети\ ты вве\рх всему\ вопреки\
со мной всё выше лети
сошёл с ума этот мир
если нет в сердце любви
то хватит одной лишь песни
чтоб перевернуть снаружи всё и внутри

И\звини\те, по\жалу\йста, Ва\м
Поможите, люди добрые.
Сами мы-ы не местные
Голодаем и скитаемся.

Я в весе\ннем лесу\ пил бере\зовый со\к,
С ненаглядной певуньей в стогу ночевал,
Что имел не сберег, что любил — потерял.
Был я смел и удачлив, но счастья не знал.

что\ же тако\е что\ же случи\лось
в сердце поют соловьи
что же такое все пробудилось
вместе с приходом весны

ле\д и сугро\бы вми\г раствори\лись
птицы со мною поют
все оживилось и зазеленилось
это весна милый друг

кап ка\п кап ка\п капе\ль капе\ль
прощай зима привет апрель
кап кап кап кап капель капель
я поделюсь с тобою радостью своей

ты\ меня\ око\лдова\ла ча\рами\ любви\
взглядом будто бы сказала лишь меня люби
не сдержусь от приворота не смогу любить кого-то
только лишь тебя только лишь тебя
за тобой одной хожу я от меня бежишь колдуя
фея ты моя фея ты моя

приво\рожи\ и о\колду\й
приобними и поцелуй
чарами чарами чарами чарами
я околдован случайно

по\мнишь ка\к мальчи\шкой бе\гал за\ тобо\й
дергал твои плюшевые косы
как на каруселях мчались мы с тобой
будто улетая в дивный космос

ка\русе\ль аттра\кцио\ны о\гоньки\ горя\т
сладкой ватой лимонадом напою тебя
нам с тобой на каруселях весело вдвоем
унесите карусели в прошлое мое

Ты\ неси\ меня\, река\, за круты\е бе\рега\,
Где поля мои, поля, где леса мои, леса,
Ты неси меня, река, да в родные мне места,
Где живет моя краса, голубы у нее глаза.

Как но\чка те\мная\,
Как речка быстрая,
Как одинокая луна,
На небе ждет меня она.

Позови\ меня ти\хо по и\мени,
Ключевой водой напои меня.
Отзовется ли сердце безбрежное,
Несказанное, глупое, нежное?

Снова су\мерки вхо\дят бессо\нные,
Снова застят мне стекла оконные,
Там кивает сирень и смородина,
Позови меня, тихая родина.

Позови\ меня\ на зака\те дня\,
Позови меня, грусть печаль моя, позови меня,
Позови меня на закате дня,
Позови меня, грусть печаль моя, позови меня.

А ты\ опя\ть сего\дня не\ пришла\,
А я так ждал, надеялся и верил,
Что зазвонят опять колокола, колокола,
И ты войдёшь в распахнутые двери.

Я\ хоте\л бы ве\тром бы\ть и на\д земле\й лете\ть
К солнцу в снегах
Я хотел бы в небе спать и сны о нем смотреть
Сны в облаках
Но ты сказала мне это мечты
И ничего в них нет
Вот и все что сказала мне ты

А я\ хочу\ как ве\тер пе\ть
И над землей лететь
Но так высока и так близка
Дорога в облака

А\ не спе\ть ли мне пе\сню о\ любви\,
А не выдумать ли новый жанр,
Попопсовей мотив и стихи,
И всю жизнь получать гонорар?

/башлачёв подвиг разведчика
В рабо\чий по\лдень я\ просну\лся сто\я.
Опять матрац попутал со стеной.
Я в одиночку вышел из запоя,
Но - вот те на! - сегодня выходной.

/abba gimme gimme gimme #https://www.youtube.com/watch?v=Rpv4Bb-sVuU
по\лночь у\ж
я смотрю телевизор
в одиночестве сижу
вечера свои все так я провожу

/abba gimme gimme gimme #https://www.youtube.com/watch?v=Rpv4Bb-sVuU
го\споди\ прошу\ я
пошли мне мужчину
чтоб он ночью страхи
мог мои отгонять

В мо\ре ве\тер, в мо\ре бу\ря
В море воют ураганы
В синем море тонут лодки
И большие корабли, ха-ха-ха

А мо\й тако\й... мог бы ста\ть поэ\том,
но и тут что-то не свезло,
Ну, да зато лучше всех на свете
он поёт да песни про любовь.

То\т, кто пога\с, будет я\рче свети\ть,
Чем кометы, пролетающие над планетой.
Из пустоты без твоей красоты
Не родится юности вольная птица.

Повстреча\лась я с бра\вым вое\нным
На скалистом морском берегу
Ой, девчонки, режим с гигиеной
Нарушали мы на каждом шагу

Страсть пове\ргла в пучи\ну
Об одном только помню
Ой, такой был мужчина
Ну, настоящий полковник

Ах, како\й был мужчи\на
Ах, какой был мужчина
Ах, какой был мужчина
Настоящий полковник

/Can't Help Falling In Love (Wise men say only fools rush in)
Ва\йз мэн сэ\й онли\ фулз ра\ш ин
Бат ай кэнт хэлп фолин ил лав виз ю
Шэл ай стэй вуд ит би э син
Иф я кэнт хэлп фолин ил лав виз ю

Живу\ сейча\с обло\мами\, обло\мками\ не то\й любви\
Попытками не то любить, что нужно
Теряю смысл, ну и пусть, невыносимой стала грусть
И в комнате, что с потолком мне чуждым

Я\ б уплы\ла в о\кеа\н, сши\ла б кра\сный са\рафа\н и
Я б забыла что ты есть, я б не лезла в эту сеть
Я бы, я бы, я бы, я бы не была бы здесь
Волосы пропахли дымом, вечер был довольно длинным

В твои\х глаза\х печа\ть греха\,
О, как она нас разделяет,
И скорби ты не разделяешь,
Любовь как старая труха.

Когда\ меня\ ты по\зове\шь,
Боюсь тебя я не услышу,
Так громко дождь стучит по крыше,
Все тот же запевала-дождь, запевала-дождь,

Она\ была\ актри\сою\, и да\же за\ кули\сами\
Играла роль, а зрителем был я.
В душе её таинственной мирились ложь и истина
Актрисы непростого ремесла
Ему единственно верна хотела быть она.

Кра\сота\ актри\сы та\к обма\нчива\
И влечёт напрасными надеждами.
Ничего слова её не значили,
И в судьбе моей всё по-прежнему.

Анто\шка, Анто\шка!
Пойдем копать картошку!
Антошка, Антошка!
Пойдем копать картошку!

Пра\здник, пра\здник, пра\зднуе\м семьё\й,
Праздник, праздник свадьбы золотой!
«Горько! Горько!» - весело кричат
Сорок правнуков и двадцать пять внучат!

Ба\бушка ря\дышком с де\душкой
Столько лет, столько лет вместе.
Бабушка рядышком с дедушкой
Дружно поют эту песню.

Вы\числить пу\ть звезды\
И развести сады,
И укротить тайфун -
Все может магия.

Да\ром препо\дава\тели\
Время со мною тратили.
Даром со мною мучался
Самый искусный маг. Да, да, да!

Ши\рока\ река\, глу\бока\ река\
Не доплыть тебе с того бережка
Тучи низкие прячут лунный свет
Полететь бы мне, да вот крыльев нет

Постуча\лась в до\м боль незва\ная\
Вот она любовь окаянная
Коротаем мы ночи длинные
Нелюбимые с нелюбимыми

Се\рыми ту\чами не\бо затя\нуто
Нервы гитарной струною натянуты
Дождь барабанит с утра и до вечера
Время застывшее кажется вечностью

Дава\й за жи\знь, дава\й, брат, до\ конца\
Давай за тех, кто с нами был тогда
Давай за жизнь, давай, брат, до конца
Давай за тех, кто с нами был тогда

Ты гляде\л на меня\ ты иска\л меня всю\ду
Я бывало бегу ото всех твои взгляды храня
А теперь тебя нет тебя нет почему-то
Я хочу чтоб ты был чтобы так же глядел на меня

А за\ окно\м то до\ждь то сне\г
И спать пора и никак не уснуть
Все тот же двор всё тот же смех
И лишь тебя не хватает чуть-чуть

Ра\спусти\лась черё\муха\, на\ряди\лась неве\стою\
На душе не спокойно так, не найду себе места я
Расскажу я черёмухе, что влюбилась я по уши
Ах вы ночи весенние, до чего же хорошие!

Ах черё\муха бе\лая\, сколько бе\д ты наде\лала\,
Ах любовь твоя смелая, сумасшедшей была
Ароматом дурманила, только сердце поранила
я ведь знала заранее, это только игра.

Как ты\ ворва\лся в мо\ю жи\знь сама\ не зна\ю,
Сама себя порой никак не понимаю.
Кружился ветром ты шальным и ненадежным,
Но разлюбить тебя теперь уж не возможно.

На се\рдце ра\на у\ меня\,
Твоя любовь: полынь трава,
Твои слова, твои слова…
Ах, как кружится голова!

Дре\млет прити\хший се\верный го\род
Большая граната, и я ещё молод
Плывём через реку, дозорный не спит
А слева уключина громко скрипит

Я убью\ тебя, ло\дочник,
я убью тебя, лодочник"
Я убью тебя, лодочник,
я убью тебя, лодочник"

Я\ ходи\л по бе\лу све\ту,
Знался с умными людьми
Счастье есть - и счастья нету,
Есть любовь - и нет любви.

У\ж я к не\й и та\к и э\так,
Со словами и без слов
Обломал немало веток
Наломал немало дров.

Тебя\ проси\л я бы\ть на свида\нье,
Мечтал о встрече, как всегда,
Ты улыбнулась, слегка смутившись,
Сказала: "Да, да, да, да!"

С утра\ побри\лся и га\лстук но\вый
С горошком синим я надел.
Купил три астры, в четыре ровно
Я прилетел. Я прилетел.

Я ходи\л! И я ходи\ла!
Я вас ждал! И я ждала!
Я был зол! И я сердилась!
Я ушел! И я ушла!

У\тро неслы\шно ступа\ет по кры\ше,
В доме своем безмятежная спишь ты,
Снам улыбаясь в рассветном блаженстве,
Самая лучшая в мире из женщин.

Пу\сть тебе\ присни\тся Па\льма-де\-Майо\рка,
В Каннах или в Ницце ласковый прибой
Или в Подмосковье роща вдоль пригорка,
Только чтобы вместе были мы с тобой.

Зва\ли де\вушку\ по о\тчеству\ Семё\новно\й,
И не зря молва народная гласит -
Хоть и трудно ей жилось, но всё равно она
Лучше всех плясать умела на Руси.

Под пе\ресту\к выхо\дит вдру\г,
Смотри-ка, не дыши, ух,
Семёновна, Семёновна,
А ну, давай, пляши, пляши.
 
Я закро\ю глаза\, я забу\ду оби\ды,
Я прощу даже то, что не стоит прощать,
Приходите в мой дом, мои двери открыты,
Буду песни вам петь, и вином угощать.

От люде\й на дере\вне не спря\таться,
Нет секретов в деревне у нас.
Не сойтись, разойтись, не сосвататься
В стороне от придирчивых глаз.

/возвращение будулая
Моя\ доро\га не\легка\,
То вниз бежит, то в облака,
Идут дожди, идут снега,
Лишь размывает берега

/возвращение будулая
Пу\сть, мне у\лыбну\тся не\беса\
Поля и реки и леса!
И убеждаюсь я воочью,
Как хорошо и днём и ночью
Кую подковы днём, а ночью,
Разглажу я морщины дня,
И погоню вперёд коня!

Бы\ло не\бо вы\ше бы\ли зве\зды я\рче
И прозрачный месяц плыл в туманной мгле
Там где прикоснулись девочка и мальчик
К самой светлой тайне на земле

Пу\сть сего\дня вно\вь нас па\мять у\несе\т
В тот туман голубой.
Как же это все, ну как же это все
Мы не сберегли с тобой.

Уше\л от на\с после\дний де\нь
Как изчезает в полдень тень
Любовь уходит с пожелтевшею листвой
И расстаемся мы с тобой

Бегу\т года\ и гру\сть, печа\ль в твои\х глаза\х
А я не знаю что тебе сказать
Найти слова или без слов ответить на твою любовь
Чтоб стала ты моей судьбой

/Мы - русские Бичевская Жанна
Для сла\вы со\ Христо\м мы бы\ли со\зданы\.
Никак нас враг чудовищный не съест,-
Кололи нас серпом, звездили звездами,
Но наше знамя есть и будет - крест.

/Мы - русские Бичевская Жанна
Веду\т нас ко\ Христу\ доро\ги у\зкие\,
Мы знаем смерть, гонения и плен.
Мы - русские, мы - русские, мы - русские,
Мы все равно поднимемся с колен.

Ру\сские\ иду\т сквозь тьму\ язы\чески\х веко\в,
Русские идут сквозь сонм поверженных врагов,
Русские идут, освобождая Третий Рим,
Русские идут в Небесный Иерусалим.

Ма\рш ма\рш ма\рш.
Русский марш, собираем на марш
Всех, неуничтоженных войной,
Марш марш марш,
Русский марш, он закончит шабаш,
Тех, кто издевался над страной.

/аквалангисты (Манго-Манго)
Меня\ укуси\ла аку\ла,
когда я стоял в океане;
Но я оставался спокоен,
Терпел, но закончил работу.
 
/аквалангисты (Манго-Манго)
Аква\ланги\сты - э\то хо\рошо\!
И взрослые знают, и дети:
Мы радость творим на планете.
Аквалангисты - это не игра!

Де\нь промча\лся не\заме\тно – вы\пит до дна\.
День промчался. До рассвета в небе луна.
В лунном свете чище краски, с виду просты
Стали нежней и прекрасней цветы.

Луна\, луна\, цветы\, цветы\.
Нам часто в жизни не хватает друзей и доброты.
Луна, луна, цветы, цветы.
Все, кто влюблен, им доверяют надежды и мечты.

/Диалог у новогодней елки
— Что\ происхо\дит на све\те? — А про\сто зима\.
— Просто зима, полагаете вы? — Полагаю.
Я ведь и сам, как умею, следы пролагаю
в ваши уснувшие ранней порою дома.

Ка\пли и\спаре\ний ка\тятся\, как сле\зы,
И туманят синий вычурный хрусталь.
Тени двух мгновений, две увядших розы,
А на них немая, мертвая печаль.

Одна\ из них, бе\лая, бе\лая,
Была как улыбка несмелая,
Другая же алая, алая,
Была как мечта небывалая.
И обе манили и звали,
И обе увяли…

Я по\мню чу\дное\ мгнове\нье:
Передо мной явилась ты,
Как мимолетное виденье,
Как гений чистой красоты.

Бе\лый сне\г, серый лё\д на растре\скавшейся\ земле\,
Бе\лый сне\г, серый лё\д на растре\скавшейся\ земле\,
Бе\лый сне\г, серый лё\д на растре\скавшейся\ земле\,
Бе\лый сне\г, серый лё\д на растре\скавшейся\ земле\,

Бе\лый сне\г, серый лё\д на растре\скавшейся\ земле\,
одеялом лоскутным на ней город в дорожной петле
А над городом плывут облака, закрывая небесный свет,
а над городом жёлтый дым, городу 2000 лет

И две ты\сячи ле\т война\ - война\ без осо\бых причи\н,
война - дело молодых, лекарство против морщин
Красная-красная кровь через час уже просто земля,
через два на ней цветы и трава, через три она снова жива

То\лько за\пого\дили\сь весе\нние\ деньки\
К матушке - природе потянулись мужики
Хрустнули огурчиком, занялся разговор
Где какие случаи, и кто кого утер

И меха\ник и такси\ст и заслу\женный арти\ст
Токарь, пекарь и аптекарь, и морской артиллерист
И девица и вдова, и замужняя едва
Любят это дело, ну чего скрывать

В пла\внях шо\рох, и\ лега\вая\ засты\ла чу\тко.
Ай да выстрел! Только повезло опять не мне.
Вечереет. И над озером летают утки.
Разжирели. Утка осенью в большой цене.

Группа кро\ви - на рукаве\, мой поря\дковый но\мер - на\ рукаве\,
Пожелай мне удачи в бою, пожелай мне:
Не остаться в этой траве, не остаться в этой траве.
Пожелай мне удачи, пожелай мне удачи!

Кава\лерга\рда, ве\к недо\лог,
и по\тому\ так сла\док о\н.
Поет труба, откинут полог,
и где-то слышен сабель звон.

Бе\лые\ снежи\нки кру\жатся\ с утра\,
Выросли сугробы посреди двора.
Стала от снежинок улица светлей,
Только одеваться нужно потеплей.

Пусть про\шлое\ раскро\шится\ Волно\ю о\ прича\л,
Мы вспомним все хорошее, Забудем про печаль.
Умчалась юность бедная За даль туманных звезд.
И за любовь последнюю Я поднимаю тост.

Вы\пьем за\ любо\вь! Как блестя\т Сейча\с твои\ глаза\!
Выпьем за любовь, Пусть дрожит Хрустальная слеза.
Выпьем за любовь, И уже не надо лишних слов,
Выпьем за любовь, родная, Выпьем за любовь!

Очаро\вана, околдо\вана
С ветром в поле когда-то повенчана
Вся ты словно в оковы закована
Драгоценная ты моя женщина

А я\ в пруду\ для Ли\лии Ли\лии Ли\лии
Сорвал три белых лилии, три лилии сорвал
А я в окошко Лилии Лилии Лилии
Бросал под вечер лилии, три лилии бросал

Я\ как Фе\дери\ко Фелли\ни!
Дайте Оскар этой Богине
Словно кукла Барби на витрине
Хочет главную роль в картине

Е\сть за гора\ми, за леса\ми ма\ленькая\ страна\,
Там звери с добрыми глазами, там жизнь любви полна.
Там чудо-озеро искрится, там зла и горя нет,
Там во дворце живет жар-птица и людям дарит свет.

На\ неде\льку, до\ второ\го Я\ уе\ду в Ко\маро\во
Поглядеть отвыкшим глазом На балтийскую волну
И на море буду разом Кораблем и водолазом
Сам себя найду в пучине Если часом затону

На\ неде\льку, до\ второ\го
Я уе\ду в Комаро\во
Сам себя найду в пучине
Если часом затону

Вы\йду но\чью в по\ле с конё\м,
Ночкой тёмной тихо пойдём.
Мы пойдём с конём по полю вдвоём,
Мы пойдём с конём по полю вдвоём.

Дружба\ крепкая\ не слома\ется,
Не расклеится от дождей и вьюг.
Друг в беде не бросит, лишнего не спросит,
Вот что значит настоящий верный друг.

Что\ тако\е о\сень — э\то не\бо
Плачущее небо под ногами
В лужах разлетаются птицы с облаками
Осень, я давно с тобою не был

О\сень, в не\бе жгут ко\рабли\
Осень, мне бы прочь от земли
Там, где в море тонет печаль
Осень — тёмная даль

/Земфира Бесконечность
Я хочу\, чтобы во рту\ оставался честный вку\с сигаре\т,
Мне очень дорог твой взгляд, мне крайне важен твой цвет,
Я умираю, когда вижу то, что вижу и некому спеть,
Я так боюсь не успеть хотя бы что-то успеть.

/Земфира Бесконечность
Заморо\женными па\льцами в отсу\тствии горячей воды\,
Заторможенными мыслями в отсутствии конечно тебя
И я застыну, выстрелю в спину, выберу мину и добрый вечер!
Я не нарочно, просто совпало, я разгадала знак бесконечность.

По\сле до\ждичка\ небеса\ просто\рны,
голубей вода, зеленее медь.
В городском саду флейты да валторны.
Капельмейстеру хочется взлететь.

Над не\бом го\лубы\м —
Есть город золотой,
С прозрачными воротами
И с яркою стеной.

Одно\ как ры\жий о\гнегри\вый ле\в,
Другое — вол, исполненный очей.
Третье — золотой орёл небесный,
Чей так светел взор незабываемый…

Ко\льщик, на\коли\ мне ку\пола\,
Рядом чудотворный крест с иконами,
Чтоб играли там колокола
С переливами и перезвонами. 

До\м казе\нный пре\до мно\й
Да тюрьма центральная
Ни копейки за душой
Да дорога дальняя

Золоты\е купола\ Ду\шу мою\ радую\т
А то не дождь А то не дождь Слезы с неба капают
Золотые купола На груди наколоты
Только синие они И ни крапа золота

Всё не то\, всё не та\к, ты мой дру\г, я твой вра\г
Как же так всё у нас с тобою?
Был апрель, и в любви мы клялись, но, увы
Пролетел жёлтый лист по бульварам Москвы

Тре\тье сентября\ - день проща\нья
День, когда горят костры рябин
Как костры, горят обещания
В день, когда я совсем один

Осты\ли ре\ки и\ земля\ осты\ла
И чуть нахохлились дома.
Это в городе тепло и сыро,
А за городом зима, зима, зима.

И уно\сят меня\, и уно\сят меня\
В звенящую снежную даль
Три белых коня, эх, три белых коня
Декабрь и январь и февраль!

Приве\т! Сего\дня до\ждь и скве\рно,
А мы не виделись, наверно, сто лет.
Тебе в метро? Скажи на милость,
А ты совсем не изменилась, нет-нет.

Э\то у\влека\тельный бы\л аттра\кцио\н
Так ещё никто не шутил, как я и он
Он меня шутя посадил в пустой вагон
Я шутя уехала в поезде ночью

Ма\нит, ма\нит, ма\нит ка\русе\ль
В путешествие по замкнутому кругу
Дарит, дарит, дарит карусель
То надежду, то досадную разлуку

Ле\дяно\й горо\ю а\йсберг и\з тума\на вы\раста\ет
И несёт его теченье по бескрайним по морям
Хорошо тому, кто знает как опасен в океане
Как опасен в океане айсберг встречным кораблям

А я\ про всё\ на све\те с тобо\ю за\быва\ю
И я в любовь, как в море, бросаюсь с головой
А ты такой холодный, как айсберг в океане
И все твои печали под чёрною водой

Христо\с воскре\с. Я зна\ю э\то.
Оба\му ко\шка ро\дила\.
Фашист вживляет в сигареты
Смертельных вирусов тела.

Нас не\нави\дят все\ и всю\ду.
Нас уважают все и вся.
Мы лучше всех, а все – паскуды.
Нефть, газ – у нас. Без нас нельзя.

Мы\сли до\лги, да ру\ки ко\ротки\.
Чё-то хочется, а вот хренушки.
Да повсюду усы и бороды
С крошками родимого хлебушка.

Э\то го\ре бе\з ума\,
Эти праздники до слёз...
Против нас - орда и тьма!..
С нами - Путин и Христос!..

Два\дцать второ\го ию\ня
Ровно в четыре часа
Киев бомбили, нам объявили,
Что началася война

За\вы ма\гази\нами\ ро\зы шлю\т корзи\нами\,
И звонит настойчиво белый телефон.
А джигиты страстные, над собой не властные,
По трубе, в отчаяньи, лезут на балкон.

Са\мая\ краси\вая\ де\вушка\ в Бала\шихе\,
И зачем такую дочь мама родила?
Что же ты, негодная, и тусовку модную,
И шпану залетную, всех с ума свела?

/https://www.youtube.com/watch?v=ZO67e2QjMJI
Ни\чего\, что не\мцы в По\льше, но\ сильна\ страна\,
Че\рез ме\сяц и\ не бо\льше ко\нчится\ война\.
«Рио-Рита», «Рио-Рита», вертится фокстрот,
На площадке танцевальной сорок первый год.

Но\чь весе\нняя\ дыша\ла
Светло-южною красой;
Тихо Брента протекала,
Серебримая луной;

О\траже\н волно\й огни\стой
Блеск прозрачных облаков,
И восходит пар душистый
От зеленых берегов.

Под нога\ми мои\ми грязи\ща
И не\ту зубо\в коренны\х,
А ты требуешь новые тыщи,
Чтоб куплять деколоны на их.

Ле\гкий за\пах де\коло\на "Ши\пр"
Выдава\л изме\ну твою\,
На шабашках я клал шифер,
А ты клала на жизнь мою!

И\ заче\м с тобо\ю Бы\ло на\м знако\миться\
Не забыть теперь вовек Мне взгляда синего
Я всю ночь не сплю А в окна мои ломится
Ветер северный Умеренный до сильного

О\тшуме\ли пе\сни на\шего\ полка\,
отзвенели звонкие копыта.
Пулями пробито днище котелка,
маркитантка юная убита.

На\с оста\лось ма\ло: мы\ да на\ша бо\ль.
Нас немного и врагов немного.
Живы мы покуда, фронтовая голь,
а погибнем - райская дорога.

В ста\ром па\рке па\хнет хво\йной ти\шино\й,
И качаются на ветках облака.
Сколько времени не виделись с тобой,
Может год, а может целые века?

Когда\-то мы\ с тобо\й сняли\сь на фо\точку\,
Потом разъехались, всему свой срок.
Но я запомнила твою чечеточку,
Ты лучше всех ее плясал, Витек.

Убега\ет науте\к, убега\ет науте\к,
Все, что было, как будто вчера.
Я приду к тебе Витек,
Ну, я приду к тебе Витек,

По\дари\ мне со\лнце, со\лнце, со\лнце - же\лтый мя\чик в не\бе
Самым ранним утром, утром, утром выглянет оно,
И согреет землю, землю, землю добрыми лучами,
И меня разбудит, заглянув в окно.

Тоска\, печа\ль, наде\жды ушли\,
Друга нет, неприветно вокруг;
В ночной тишине я слышу рыданья –
Стон души о разбитой любви…

Молчи\, грусть, молчи\!
Не тронь старых ран,
Сказки любви дорогой
Не вернуть никогда, никогда.

Слу\чай мне\ предста\вился\,
Такой, однажды, выдался:
С девочкой сопливою
На даче отдохнуть

Бе\лым сне\его\м, бе\лым сне\его\м
Ночь метельная ту стежку замела
По котоорой, по котоорой
Я с тобой любимый рядышком прошла.

Ти\ каза\ла в по\неди\лок
пи\дем ра\зом по\ барви\нок,
Я прийшо\в, тебе нема\,
пи\дманула, пи\двела.

Ти\ ж мене пи\дманула\,
ти ж мене пидвела,
Ти ж мене, молодого,
з ума з розума звела.

Лето бы\ло пе\пельно\-золоты\м,
Чувства были сильно помяты.
Нет, не боялась я темноты,
Я была сама виновата...

Если, пу\ть проруба\я отцо\вским мечо\м,
Ты соленые слезы на ус намотал,
Если в жарком бою испытал, что почем,-
Значит, нужные книги ты в детстве читал!

Если мя\са с ножа\ Ты не е\л ни куска\,
Если руки сложа Наблюдал свысока,
И в борьбу не вступил С подлецом, с палачом,
Значит, в жизни ты был Ни при чем, ни при чем!

Ты за па\рту со мно\й снова ря\дом сади\шься.
Из-за э\того я\, может, дво\йку схвачу\.
И не мне одному ты, красивая, снишься,
И к тебе я во сне, словно к звездам, лечу.

Не печа\ль в моих глаза\х, не тоска\,
А доса\да на внеза\пную гру\сть,
Ну и пусть ты далека-далека,
Ну и пусть я одинок, ну и пусть!

Что стои\шь, робкая\, несмелая\?
Я в пыли, сапогами мну цветы
Вижу я, как фатою белою
С глаз своих утираешь слёзы ты

Девочка\, что ты пла\чешь, милая\?
Добрая, зря ломаешь рученьки
Нежная, разве ты не видела
Никогда на руках наручники?

Бежи\т река\, в тума\не та\я,
Бежит она, меня дразня.
Ах, кавалеров мне вполне хватает.
Но нет любви хорошей у меня.

Вам не\ поня\ть мое\й печа\ли,
Когда, растерзаны тоской,
Надолго вдаль не провожали
Того, кто властвует душой!

е\здили\ кита\йцы по\ Луне\
а\ пото\м как бу\дто бы\ случа\йно
на ее обратной стороне
появилась надпись мэйд ин чайна

Сине\е мо\ре, то\лько мо\ре за\ кормо\й,
Синее море, и далёк он, путь домой.
Там за туманами вечными, пьяными,
Там за туманами берег наш родной.

Ти\хо лу\жи по\крыва\ет ле\д, по\мнишь мы\ с тобо\ю
Целовались ночи напролет под шум прибоя
Это лето не вернуть уже я знаю
Но когда печаль в моей душе я вспоминаю

Я\хта, па\рус, в э\том ми\ре то\лько мы\ одни\
Ялта, август и мы с тобою влюблены
Яхта, парус, в это мире только мы одни
Ялта, август и мы с тобою влюблены

Не о\трека\ются\ любя\.
Ведь жизнь кончается не завтра.
Я перестану ждать тебя,
а ты придешь совсем внезапно.

Ка\к-то гна\л на Шко\де-сто\ в направле\ньи О\равы\
За\ Мора\вским бло\кпосто\м рискова\л я здо\рово\,
Там чудовище живёт с безобразной рожей,
Жрет пражан среди болот, звать ту нечисть Йожин.

На мели\ мы лени\во нали\ма лови\ли,
И меняли налима вы мне на линя,
О любви не меня ли так мило молили
И в туманы лимана манили меня?

Я\ обма\ныва\ть себя\ не ста\ну,
Залегла забота в сердце мглистом.
Отчего прослыл я шарлатаном?
Отчего прослыл я скандалистом?

Му\зыка на\с связа\ла
Та\йною на\шей ста\ла
Всем уговорам твержу я в ответ
Нас не разлучат, нет

Не вы\ходи\ из ко\мнаты\, не со\верша\й оши\бку.
Зачем тебе Солнце, если ты куришь Шипку?
За дверью бессмысленно все, особенно -- возглас счастья.
Только в уборную -- и сразу же возвращайся.

За ти\хой реко\ю, в бере\зовой ро\ще
Распу\стится пе\рвый весе\нний цвето\к
И я загадаю желание попроще
И перекрестившись взгляну на Восток.

Окра\сится не\бо багря\ной заре\ю
И ве\чное со\лнце над ми\ром взойде\т
И белая птица взлетит над землею
И Божие прощение с небес принесет

Облете\ла листва\, у приро\ды свое\ обновле\нье,
И тума\ны ноча\ми стоя\т и стоя\т над реко\й.
Твои волосы, руки и плечи - твои преступленья,
Потому что нельзя быть на свете красивой такой.

Потому что нельзя\, потому что нельзя\,
Потому что нельзя быть на свете красивой такой.
Потому что нельзя, потому что нельзя,
Потому что нельзя быть на свете красивой такой.

У\ беды\ глаза\ зеле\ные\
Не\ простя\т не по\щадя\т
С головой иду склоненою
Виноватый прячу взгляд

На\ зака\те хо\дит па\рень во\зле до\ма мо\его\
Поморгает мне глазами и не скажет ничего
И кто его знает чего он моргает
Чего он моргает и кто его знает

На\ зака\те хо\дит па\рень
во\зле до\ма мо\его\
Поморгает мне глазами
и не скажет ничего

Суро\вые\ годы\ ухо\дят
Борьбы\ за сво\боду\ страны\
За ними другие приходят
Они будут тоже трудны

Отцвела\ липа белая\ вот и встре\тились вно\вь.
Здравствуй пе\рвая, нежная\, неземна\я любо\вь.
Ты и та, и не та уже, всё гляжу - не пойму.
Почему же ты замужем? Ну скажи, почему,

А\ я ми\лого\ узна\ю по\ похо\дке
Он носит, носит брюки галифе
А шляпу он носит на: панаму
Ботиночки он носит нариман

Заче\м я ва\с, мой ро\дненьки\й, узна\ла
Зачем, зачем я полюбила вас
А раньше я ведь этого не знала
Теперь же я страдаю каждый час

Эта но\чь будет жи\ть в нашей па\мяти ве\чно
Эта ночь покоренных и жгучих сердец
До утра ты шептал мне так страстно и нежно
Что со мною пойдешь под венец!

Лу\чше не\ту то\го цве\ту,
Когда яблоня цветет,
Лучше нету той минуты,
Когда милый мой придет.

Ка\к уви\жу, ка\к услы\шу -
Все во мне заговорит,
Вся душа моя пылает,
Вся душа моя горит.

Гори\т свечи\ ога\роче\к,
Гремит недальний бой...
Налей, дружок, по чарочке,
По нашей фронтовой!

У на\с но\нче субботея\,
А на завтра воскресенье.
Барыня ты моя, сударыня ты моя.
А-а, воскресенье.

Ты реши\ла идти\ по краю\,
Непослушная ты совсем.
И как будто со мной играя,
Улыбаешься нагло всем,

Твое те\ло не приручи\ли.
Ядови\тая, ве\ская\,
Где манерам тебя учили.
Слышь, ты чё такая дерзкая, а???

Там вдали\, за реко\й Зажига\лись огни\,
В небе я\рком заря\ догора\ла.
Сотня юных бойцов Из будённовских войск
На разведку в поля поскакала

Я повстреча\ла его\ весно\ю,
Он был худо\жник почти изве\стный,
Мы целовались с ним под сосною -
И он женился, поскольку честный.

За\пах то\поли\ный и\ сире\невы\й
На\д Москвою ма\йскою поплы\л.
Встеритились весною дети с Лениным,
Ленин с ними долго говорил.

Облака\ в небо спрятали\сь
Зве\зды пья\ные смо\трят вни\з
И в де\бри ска\зочно\й тайги\
Падаю\т они\

Ты\ стои\шь одна\ у па\рапе\та,
Гордо вскинув голову свою,
Я ведь и не думал, что вот эту,
Глупую девчонку полюблю.

Ты\ у меня\ одна\,
Словно в ночи луна,
Словно в степи сосна,
Словно в году весна.

Не\ту друго\й тако\й
Ни за какой рекой,
Ни за туманами,
Дальними странами.

За\теря\лося\ село\
Да\ на Во\лге где-то.
О\чень де\вкам не везло\
Во селенье этом.

Шла\ молва\ по все\й Земле\
По\ кана\лам ра\зным,
Что у девок на селе
Не было оргазма.

Шла\ лесно\ю сто\роно\й,
У\вяза\лся че\рт за мно\й,
Думала мужчина,
Что за чертовщина.

/полонез огинского
Пе\сня лети\т, как пти\ца вда\ль,
Ведь где-то та\м, в тиши\ лесно\й,
Стои\т у ре\чки си\ней до\м родно\й,
Где жде\т меня люби\мая и верная.

Коммуни\сты мальчи\шку пойма\ли
Потащи\ли его\ в КэГэБэ\
Ты откройся, кто дал тебе книгу
Руководства в подпольной борьбе

Ещё\ он не сши\т, твой наря\д подвене\чный,
И хо\р в нашу че\сть не споё\т,
А время торопит, возница беспечный,
И просятся кони в полёт.

дава\й покра\сим хо\лоди\льник в че\рный цве\т
он бы\л зеле\ным кра\сным бе\лым че\рным не\т
а для чего а просто так
давай покрасим холодильник в черный цвет

у лу\комо\рья ду\б зеле\ный
златая цепь на дубе том
и днем и ночью кот ученый
все ходит по цепи кругом

со\коло\вский хо\р у я\ра
бы\л когда\-то зна\мени\т
соколовского гитара
до сих пор ушах звенит

Де\тство, де\тство, ты\ куда\ бежи\шь,
Де\тство, де\тство, ты\ куда\ спеши\шь.
Не на\игра\лся я\ ещё\ с тобо\й,
Де\тство, де\тство, ты\ куда\? Посто\й.

Конфе\тки-бара\ночки\, словно ле\беди са\ночки\,
Эй, вы, ко\ни зале\тные\, слышен кри\к с облучка\.
Гимназистки румяные, от мороза чуть пьяные
Грациозно сбивают рыхлый снег с каблучка.

В до\ме во\семь на\ Тверско\м бульва\ре
Я\сно бы\ло да\же де\творе\,
Что из сто седьмой квартиры парень
Самый симпатичный во дворе.

Что тебе\ подари\ть,
Кроме ве\рной любви\?
Может, эту весну?
Может, песни свои?

Что тебе\ подари\ть,
Челове\к мой дорого\й?
Как судьбу\ благодари\ть,
Что свела\ меня с тобо\й?

Постаре\ли мои\ старики\-
Незаме\тно как э\то быва\ет -
И уже\ с чьей-то ле\гкой руки\
Маму ба\бушкой все\ называ\ют.

Дороги\е мои\ старики\!
Дайте, я\ вас сейча\с расцелу\ю.
Молоды\е мои\ старики\,
Мы еще\, мы еще\ повою\ем!

Вы\йду на у\лицу – со\лнца нема\,
Па\рни молоды\е свели\ меня с ума\.
Вы\йду на у\лицу, гля\ну на село\, -
Де\вки гуля\ют, и мне\ весело\.

Фантазё\р, ты меня\ называ\ла
Фантазё\р, а мы с тобо\ю не па\ра
Ты умна, ты прекрасна, как фея
Ну, а я, я люблю всё сильнее...

/Louis Armstrong - Let My People Go Lyrics
Вэ\н Изра\л воз И\пжит лэ\нд
Лэт май пипл гоу
Пре\с со ха\рд зей ку\д нот стэ\нд
Лэт май пипл гоу

/Ковыляй потихонечку
Ра\нним со\лнечны\м у\тречко\м
Провожа\ла она\
Своего ненаглядного
Своего паренька

В ночь пе\ред бу\рею\ на ма\чтах
горя\т свято\го Э\льма све\чки,
Отогревая наши души
за все минувшие года.

Когда\ воро\тимся\ мы в По\ртленд,
мы бу\дем кро\тки ка\к ове\чки.
Да только в Портленд воротиться
нам не придется никогда.

Одино\кая бе\лая мы\шь
потеря\ла неви\нность в сара\е
Здесь, спустя несколько дней,
потеря\ет неви\нность друга\я.

Что же де\лать нам лю\ди тогда\
С этим чу\дным явле\ньем приро\ды?
Но так бы\ло и бу\дет всегда\!
С Новым го\дом, друзья\! С Новым го\дом!

Мо\жет, по\мнишь тот ска\зочный со\н,
Позабыт он тобой или нет,
Плыл над полем малиновый звон,
Занимался малиновый свет.

Я\года\ мали\на на\с к себе\ мани\ла,
Ягода малина летом в гости звала.
Как сверкали эти искры на рассвете,
Ах, какою сладкой малина была.

А на\после\док я\ скажу\:
прощай, любить не обязуйся.
С ума схожу. Иль восхожу
к высокой степени безумства.

Под ла\ской плю\шево\го пле\да
Вчерашний вызываю сон.
Что это было, чья победа,
Кто побежден, кто побежден?

Сы\плют и\ностра\нцы
Русские мильоны,
Чтобы русской воле
Положить препоны.

Како\й прогно\з у на\с с тобо\ю, ми\лый
Ты с чем опять проснулся не в ладу
Скажи мне просто, господи помилуй,
Какую блажь имеешь ты в виду

Главне\й всего\ - пого\да в до\ме
А все другое суета
Есть я и ты, а все, что кроме
Легко уладить с помощью зонта

В го\род прихо\дит ве\чер
За окном уже третий день ноябрь
Я зажигаю свечи
Предо мной фотография твоя

Проща\й наве\ки после\дняя\ любо\вь
Прощай навеки - и нет печальней слов
Июльский вечер, любимые глаза
И нашу встречу вернуть уже нельзя

В на\шем до\ме сто\лько сме\ха сто\лько све\та и\ тепла\
Ты приехал ты приехал значит я не зря ждала
Голос твой счастливым эхом раздается там и тут
Ты приехал ты приехал и тебя всегда здесь ждут

Разлу\чница-разлу\ка у до\ма не крути\сь
Мы больше друг без друга не можем обойтись
Мы больше друг без друга не можем обойтись
Разлучница-разлука у дома не крутись

Дурма\ном сла\дким ве\яло\, когда\ цвели\ сады\
Когда однажды вечером в любви признался ты
Дурманом сладким веяло от слова твоего
Поверила, поверила, и больше ничего

О\гляну\ться кто\ не в пра\ве
Вспомнить словно сквозь сон
Что нашел и что оставил
Что запомнил он

Вре\мя мчи\тся бу\дто вса\дник на\ горя\чем коне\
Но сегодня мой избранник
Отшумевший звонкий праздник
Вспоминается мне

Э\той я\рмарки кра\ски ра\зноцве\тные пля\ски
Деревянные качели расписные карусели
Звуки шарманки гаданье цыганки
Медовый пряник да воздушный шарик

Когда\ мне невмо\чь переси\лить беду\,
когда подступает отчаянье,
я в синий троллейбус сажусь на ходу,
в последний, в случайный.

Когда\ уйде\м со шко\льного\ двора\
Под звуки нестареющего вальса,
Учитель нас проводит до угла,
И вновь - назад, и вновь ему с утра -

На\до мно\ю - ти\шина\,
Небо, полное дождя,
Дождь проходит сквозь меня,
Но боли больше нет.

Я\ свобо\ден, сло\вно пти\ца в не\беса\х,
Я свободен, я забыл, что значит страх.
Я свободен - с диким ветром наравне,
Я свободен наяву, а не во сне!

Е\хали\ цыга\-а-а\не,
Да с ярмарки да до-омой, до-омой,
И остано-овилися
Под ябло-о-онькой густой.

Э\х, загуля\л, загуля\л, загуля\л
Парнишка молодой, молодой,
В красной руба-ашоночке,
Хоро-оше-енький такой.

Быва\ет всё\ на све\те хо\рошо\,
В чём дело, сразу не поймёшь, –
А просто летний дождь прошёл,
Нормальный летний дождь.

А я\ иду\, шага\ю по\ Москве\,
Но я пройти ещё смогу
Солёный Тихий океан,
И тундру, и тайгу.

Я бу\ду до\лго гна\ть вело\сипе\д
В глухих Лугах Его остановлю
Нарву цветов и подарю букет
Той девушке Которую люблю

Плесни\те ко\лдовства\ в хруста\льный мра\к бока\ла
В расплавленных свечах мерцают зеркала
Напрасные слова я выдохну устало
Уже погас очаг Ты новый не зажгла

Э\тим ле\том бу\дет
кру\че, че\м тем ле\том,
Э\та пе\сня вста\вит
с пе\рвого\ купле\та.

Ношу\ боти\нки де\сять ле\т,
Боти\нкам сно\су не\т.
Всегда\ как но\вые\ они\ –
Зави\дуе\т сосе\д.

Сосняко\м по отко\сам кудря\вится
Пограни\чный скупо\й кругозо\р.
Принимай нас, Суоми - красавица,
В ожерелье прозрачных озёр!

Лодка ди\ким давле\нием сжа\та
Дан прика\з диффере\нт на корму\
Это значит что скоро ребята
В перископы увидят волну

На пи\рсе ти\хо в ча\с ночно\й
Тебе известно лишь одной
Когда усталая подлодка
из глубины идет домой

Ра\згроми\ли а\тама\нов,
Ра\зогна\ли во\ево\д
И на Ти\хом океа\не
Свой зако\нчили похо\д.

Де\вочка\ волну\ясь се\ла на\ карни\з.
И\ с ужа\сным кри\ком со\рвала\ся вни\з.
Так соединились детские сердца.
Так узнала мама, моего отца.

Пусть ма\ма услы\шит пусть ма\ма приде\т
Пусть мама меня непременно найдет
Ведь так не бывает на свете
Чтоб были потеряны дети

Но\вый го\д - мандари\н мне в ро\т
Де\д моро\з - оливье\ мне в но\с
Мы по телику посмотрим обращение
И пойдем искать приключения!

В синем мо\ре пира\тская шху\на
После бо\я неспе\шно плыла\,
И прико\ванной к ма\чте цепя\ми,
Карегла\зая ле\ди была\.

Ру\сский па\рень от пу\ль не бежи\т,
Ру\сский па\рень от бо\ли не сто\нет,
Ру\сский па\рень в огне\ не гори\т,
Ру\сский па\рень в воде\ не то\нет.

Враги\ сожгли\ родну\ю ха\ту,
Сгуби\ли всю\ его\ семью\.
Куда ж теперь идти солдату,
Кому нести печаль свою?..

Мы\ с тобо\ю встре\тили\сь посреди\не лета\,
Бы\ли голубы\ми не\бо и цветы\.
Я\ скажу\ спаси\бо случа\ю за э\то,
Что передо мною\ появилась ты\.

Не\забу\дка, не\забу\дка, и\ногда\ одна\ мину\тка,
И\ногда\ одна мину\тка значит бо\льше чем года\.
Незабудка, незабудка, в сказке я живу как будто,
И тебя я, незабудка, не забуду никогда.

Как у\пои\тельны\ в Росси\и ве\чера\,
Любовь, шампанское, закаты, переулки,
Ах, лето красное, забавы и прогулки,
Как упоительны в России вечера.

Бо\же, Царя\ храни\!
Сильный, Державный,
Царствуй на славу,
на славу нам!

Снегопа\д, снегопа\д, не мети\ мне на ко\сы,
Не стучи\сь в мою две\рь, у воро\т не кружи\.
Снегопа\д, снегопа\д, если же\нщина про\сит,
Бабье лето ее\ торопи\ть не спеши\.

Изги\б гита\ры же\лтый ты\ обни\мешь не\жно,
Струна осколком эха пронзит тугую высь.
Качнется купол неба, большой и звездно-снежный...
Как здорово, что все мы здесь сегодня собрались!

В небеса\х высоко\ ярко со\лнце све\тит.
До чего\ ж хорошо\ жить на бе\лом све\те!
Если вдру\г грянет гро\м в середи\не ле\та,
Неприятность эту мы переживем,

Скажи\-ка, дя\дя, ве\дь не да\ром
Москва\, спале\нная\ пожа\ром,
Францу\зу о\тдана\?
Ведь бы\ли ж схва\тки бо\евы\е,

Во Вселе\нной ша\рик наш ве\ртит.
Он с орби\ты свое\й не сла\зит.
Неуже\ли в тридца\том ве\ке
То\же бу\дут дрова\ ля\мзить?!

В како\й день неде\ли, в кото\ром часу\
Ты вы\йдешь ко мне\ осторо\жно?
Когда я тебя на руках унесу
Туда, где найти невозможно?

Украду\, если кра\жа тебе\ по душе\,
Зря ли я\ столько си\л разбаза\рил.
Соглашайся хотя бы на рай в шалаше,
Если терем с дворцом кто-то занял.

Пусть опя\ть дожди\ и холо\дный ве\тер,
Он уходит прочь от тепла и света,
Не спеши, постой, погоди немного,
Но зовёт его дальняя дорога.

Что\ же ты и\щешь, ма\льчик-бродя\га,
В этой забытой Богом стране,
Что же тебя снова манит куда-то,
Что ты так ясно видел во сне.

Далеко\ от больши\х городо\в,
Там где не\т дороги\х бутико\в,
Там дру\гие лю\ди живу\т,
О кото\рых совсе\м не пою\т.

Не снима\ют про ни\х сериа\лов,
Ведь они\ не в форма\те кана\лов,
И не пи\шет про ни\х интерне\т,
Их совсе\м вроде ка\к бы и не\т.

И пошё\л зябь паха\ть, молоти\ть ячме\нь,
Будет до\лгим, до\лгим, до\лгим твой рабочий де\нь,
Но зато ты зна\ешь каждый ви\нтик в тракторе внутри\,
Получа\ешь за рабо\ту в месяц ты\щи три.

Вы\пил Цэ\-два-а\ш-пять-оа\ш
Се\л на «Ни\ву» Ро\стсельма\ш,
На ДэТэ\, Дон пятьсо\т, Тэ сто пятьдеся\т,
Покорми\л перед э\тим порося\т.

Ой, тума\ны мои\, растума\ны,
Ой, родны\е леса\ и луга\!
Уходи\ли в похо\д партиза\ны,
Уходи\ли в похо\д на врага\.

Ты\ никогда\ не быва\л в нашем го\роде све\тлом
Над вечерней рекой не мечтал до зари
С друзьями ты не бродил по широким проспектам,
Значит ты не видал лучший город земли.

Жи\знь моя\ кати\лась по\ доро\гам
мелька\ли го\ды лю\ди города\.
Где ж я свое счастье проворонил,
Быть может там, где мчатся поезда.

А\х ты до\ля, мо\я до\ля - да\льняя\ доро\га.
Ах ты доля, моя доля - черные глаза.
Ах ты доля, моя доля - рядом у порога.
Мне ее уже не встретить, не вернуть назад.

Гляжу\сь в тебя\ как в зе\ркало\ до го\лово\круже\ния\,
И вижу в нем любовь мою, и думаю о ней.
Давай не видеть мелкого в зеркальном отражении,
Любовь бывает долгою, а жизнь еще длинней.

Печа\льно я гляжу\ на наше\ поколенье\!
Его грядущее - иль пусто, иль темно,
Меж тем, под бременем познанья и сомненья,
В бездействии состарится оно.

К долгожда\нной гита\ре
Я ти\хо прильну\,
Осторо\жно и бе\режно
Тро\ну струну\,

И она\ отзове\тся,
Зазы\вно звеня\,
Доброто\ю напо\лнив
Тебя\ и меня\.

От зари\ до зари\,
От темна\, до темна\
О любви\ говори\,
Пой, гита\рная струна\!

В лу\нном сия\нье
сне\г серебри\тся,
Вдо\ль по доро\женьке
тро\ечка мчи\тся.

Динь-динь-ди\нь динь-динь-ди\нь -
Колоко\льчик звени\т.
Этот зво\н, этот зво\н
о любви\ говори\т.

По си\нему мо\рю, к зелё\ной земле\
Плыву я на белом своём корабле.
На белом своём корабле,
На белом своём корабле.

Меня\ не пуга\ют ни во\лны, ни ве\тер, -
Плыву я к единственной маме на свете.
Плыву я сквозь волны и ветер
К единственной маме на свете.

Ка\к родна\я ме\ня ма\ть Прово\жала\,
Ту\т и вся\ моя\ родня\ Набежа\ла.
Ах, куда ж ты, парене\к, Ах, куда ты\?
Не ходил бы ты, Ване\к, Во солдаты\!

Ко\рабли\ ухо\дят на\ зака\т,
Дай руки твоей коснуться,
Я здесь останусь ждать тебя,
Корабли уходят, чтоб вернуться.

Гла\вное\, ребя\та, се\рдцем не\ старе\ть,
Пе\сню, что\ приду\мали, до конца\ допе\ть.
В дальний путь собрались мы, а в этот край таежный
Только самолетом можно долететь.

А ты\, улета\ющий вда\ль самоле\т
В се\рдце свое\м сбереги\...
Под крыло\м самоле\та о че\м-то пое\т
Зеле\ное мо\ре тайги\.

Иногда\ о любви\ забыва\ю,
Но про все\ забыва\ю любя\.
Без тебя\ не живу\, не быва\ю,
Даже е\сли живу\ без те\бя.

Гляжу\сь в тебя\, как в зе\ркало\,
До го\лово\круже\ния\,
И ви\жу в не\м любо\вь мою\,
И думаю о ней.

Три\ счастли\вых дня\ Бы\ло у меня\,
Бы\ло у меня\ с тобо\й,
Я\ их не ждала\, Я\ их не звала\,
Были мне они даны судьбой.

Ка\к же э\ту бо\ль мне преодоле\ть,
Ра\сставанье - ма\ленькая сме\рть!
Расставанье - долгий путь к причалу.
Может быть, Когда-нибудь мы встретимся опять.

Широка\ же наша Ро\дина-ма\ть,
Высоко\ же Президе\нт - наш оте\ц,
Можно бы\ло б тыщу ле\т ворова\ть,
Но когда\-то наступа\ет...

Я\ для тебя\ не бу\ду
Звё\зды хвата\ть в оха\пки,
Не\ потому\, что тру\дно,
Не\ потому\, что жа\лко.

Я бу\ду ру\ки твои\ целова\ть
Я ста\ну гру\стью в улы\бке твое\й
И нам никто не посмеет мешать
И не отнимет у нас этих дней

Разлу\ка, ты\, разлу\ка,
Чужа\я сторона\.
Никто\ нас не разлу\чит,
Лишь ма\ть сыра\ земля\.

Возмо\жно мы\ обря\ды зна\ем сла\бо
Возмо\жно мы их ста\ли забыва\ть
Но ру\сская серебря\ная сва\дьба
Краси\вей не приду\мать не сыгра\ть

Сере\бряны\е сва\дьбы
нега\снущи\й косте\р
Серебряные свадьбы
душевный разговор

Куда уе\хал ци\рк он бы\л еще\ вчера\
И ветер не успел со стен сорвать афиши
Но больше не горят его прожектора
Под куполом оркестр его не слышен

Это бы\ло весно\ю зелене\ющим ма\ем,
Когда тундра надела свой зеленый наряд.
Мы бежали с тобою, опасаясь погони,
Чтобы нас не настигнул пистолета заряд.

По ту\ндре, по желе\зной доро\ге,
Где мчится поезд Воркута-Ленинград
Мы бежали с тобою, опасаясь погони,
Чтобы нас не настигнул пистолета заряд.

Встава\й, страна\ огро\мная\,
Вставай на смертный бой
С фашистской силой темною,
С проклятою ордой.

Пусть я\рость бла\горо\дная\
Вскипа\ет, ка\к волна\,-
Идет война народная,
Священная война.

Мне ка\жется\ поро\ю, что\ солда\ты,
С крова\вых не прише\дшие поле\й,
Не в зе\млю нашу полегли\ когда\-то,
А превратились в белых журавлей.

Они\ до се\й поры\ с време\н тех да\льних
Летят и подают нам голоса.
Не потому ль так часто и печально
Мы замолкаем, глядя в небеса?

Те\мная но\чь, то\лько пу\ли свистя\т по степи\,
Только ветер гудит в проводах, тускло звезды мерцают.
В темную ночь ты, любимая, знаю, не спишь,
И у детской кроватки тайком ты слезу утираешь.

Ка\к я люблю\ глубину\ твоих ла\сковых гла\з,
Как я хочу к ним прижаться сейчас губами!
Темная ночь разделяет, любимая, нас,
И тревожная, черная степь пролегла между нами.

По\люби\ла па\рня, да\ не у\гада\ла
Вовсе не тако\го я во сне\ вида\ла
Я его слепила из того, что было
А\ пото\м что бы\ло, то и полюбила

У\зело\к завя\жется\,
узелок развяжется
А любовь она и есть -
только то, что кажется

Мы то\лько пу\тники\ с тобо\й,
На\ш уде\л идти\.
Было нам назначено судьбой
Встретиться в пути, встретиться в пути.

Стать хоте\лось когда\-то похо\жим на э\хо,
Мчаться скво\зь листопа\да беззву\чную ме\дь.
От печа\ли до ра\дости е\хать и е\хать,
От печа\ли до ра\дости ле\теть и ле\теть.

В ле\тнем па\рке му\зыка\ игра\ет
Все\ танцу\ют пра\здничны\е дни\
Пусть проходит лето и приходит осень
Не забыть нам никогда московские огни

Бу\дь со мно\й бу\дь со мно\й
Бу\дь со мно\й всегда\ ты ря\дом
Будь со мной будь со мной
Будь со мной всегда ты рядом

Тру\дно бы\ло че\лове\ку де\сять ты\сяч ле\т наза\д
О\н пешко\м ходи\л в апте\ку, на\ рабо\ту, в зо\оса\д.
Он не знал велосипеда, слепо верил в чудеса.
Потому что не изведал всех достоинств колеса.

Со\лнце на спи\цах, синева\ над голово\й.
Ве\тер нам в ли\ца, обгоня\ем шар земно\й.
Ветры и вёрсты, убегающие вдаль.
Сядешь и просто нажимаешь на педаль.

когда\ прихо\дит го\д молодо\й
а ста\рый ухо\дит в да\ль
снежи\нку хру\пкую спря\чь в ладо\нь
и жела\ние загада\й

Си\ний си\ний и\ней ле\г на провода\
В небе те\мно-си\нем си\няя звезда\ у-у
Только в не\бе в не\бе темно-си\нем
Си\ний поезд мчи\тся но\чью голубо\й

Е\сли вы не о\чень бои\тесь Коще\я
И\ли Бармале\я и Ба\бу Ягу\,
Приходите в гости к нам поскорее,
Там, где зеленый дуб на берегу.

Не ко\чега\ры мы\, не пло\тники\,
Но сожале\ний го\рьких не\т,
А мы монта\жники - высо\тники,
И с высоты вам шлем привет.

Ночь светла\, над реко\й тихо све\тит луна\,
И блести\т серебро\м голуба\я волна\.
Тёмный лес там в тиши изумрудных ветвей,
Звонких песен своих не поет соловей.

Милый дру\г, нежный дру\г, я как пре\жде любя\
В эту но\чь при луне\ вспомина\ю тебя\.
В эту ночь при луне, на чужой стороне,
Милый друг, нежный друг, помни ты обо мне.

Бро\ви-вразле\т, ве\тренная че\лка,
Пла\мень и ле\д - ты\ , моя девчо\нка!
То не звонишь, то бросаешь трубку,
То - мне назло - носишь мини-юбку.

Де\вочка\ моя\ синегла\зая
Бе\з тебя\ мне не\ прожи\ть и дня\,
Девочка моя синеглазая,
Ну скажи что любишь ты меня!

/Такое короткое лето
Еще\ немно\го - и\ слова\ закру\жит ве\тер,
И си\ним не\бом за\владе\ют о\блака\...
И все, что было между нами в этот вечер,
Слегка нелепым станет вдруг издалека.

Тако\е коро\ткое ле\то,
Таки\е лету\чие дни\!
Конча\ется на\ша кассе\та,
Но ты\ ее все\ же храни\!

Все\м нашим встре\чам разлу\ки, увы\, суждены\.
Ти\х и печа\лен руче\й у янта\рной сосны\.
Пеплом несмелым подернулись угли костра.
Вот и окончено все, расставаться пора.

Ми\лая\ моя\,
со\лнышко\ лесно\е,
Где, в каких краях
встретишься со мною?

Лы\жи у печки стоя\т, га\снет зака\т за горо\й.
Месяц кончается март, скоро нам ехать домой.
Здраствуйте, хмурые дни, горное солнце, прощай.
Мы навсегда сохраним в сердце своем этот край.

Сире\невы\й тума\н над на\ми про\плыва\ет
Над та\мбуро\м гори\т полно\чная\ звезда\
Кондуктор не спешит, кондуктор понимает
Что с девушкою я прощаюсь навсегда

Мне\ бы жи\знь свою\ как ки\нопле\нку
Прокрути\ть на десять ле\т наза\д
Чтобы стала ты\ простой девчо\нкой
Чи\стой-чи\стой как весе\нний са\д

Ви\жу те\нь наи\скосо\к
Рыжий бе\рег с поло\ской и\ла
Я готов целовать песок
По которому ты ходила

Ночь безлу\нною была\, ти\хой как пого\ст
Ты навстречу мне плыла в окружении звезд
Ах какой ты юной была
И с ума мне сердце свела

И сни\тся на\м не ро\кот ко\смодро\ма,
не э\та ледяна\я синева\,
А снится нам трава, трава у дома,
Зеленая, зеленая трава.

И я\ хоте\л идти\ куда\ попа\ло,
Закрыть свой дом и не найти ключа.
Но верил я - не все еще пропало,
Пока не меркнет свет, пока горит свеча.

Быва\ют дни\, когда\ опу\стишь ру\ки,
И не\т ни сло\в, ни му\зыки\, ни си\л.
В такие дни я был с собой в разлуке
И никого помочь мне не просил.

Си\ненький, скро\мный плато\чек
Па\дал с опу\щенных пле\ч.
Ты провожала И обещала
Синий платочек сберечь.

Ничто\ на земле\ не прохо\дит бессле\дно
И ю\ность уше\дшая все\ же бессме\ртна
Как мо\лоды мы бы\ли Как мо\лоды мы бы\ли
Как искренне любили Как верили в себя

Мохна\тый шме\ль - на души\стый хме\ль,
Цапля се\рая - в камыши\,
А цыганская дочь - за любимым в ночь
По родству бродяжьей души.

Так впере\д за цыга\нской звездо\й кочево\й,
На зака\т, где дрожа\т паруса\,
И глаза глядят с бесприютной тоской
В багровеющие небеса!

Во францу\зской стороне\ на чужо\й плане\те
Предстоит учи\ться мне в университе\те
До чего тоску\ю я\ - не сказа\ть слова\ми
Плачьте ж, милые друзья, горькими слезами

Ти\хо пле\щется\ вода\- голуба\я ле\нта
Вспомина\йте иногда\ вашего\ студе\нта
Много зим и много лет прожили мы вместе
Сохранив святой обет верности и чести

У са\мова\ра я\ и мо\я Ма\ша,
А на\ дворе\ совсе\м уже\ темно\.
Как в самоваре, так кипит кровь наша,
И месяц смотрит ласково в окно.

Ви\жу го\ры и\ доли\ны,
Вижу реки и моря, -
Это русские картины,
Это Родина моя!

У ле\са на\ опу\шке жи\ла Зима\ в избу\шке.
Она\ снежки\ соли\ла в бере\зовой каду\шке,
Она сучила пряжу, она ткала холсты
Ковала ледяные да над реками мосты.

Потоло\к ледяно\й, две\рь скрипу\чая,
За шершавой стеной тьма колючая.
Как шагнешь за порог - всюду иней,
А из окон парок синий-синий.

По пе\реу\лкам бро\дит ле\то,
Солнце льё\тся прямо с кры\ш,
В потоке солнечного света
У киоска ты стоишь.

На\ тебе\ соше\лся кли\ном бе\лый све\т
На тебе сошелся клином белый свет
На тебе сошелся клином белый свет
Но пропал за поворотом санный след

Мы все\ спеши\м за чу\деса\ми,
Но не\т чуде\сней ни\чего\,
Чем та земля под небесами,
Где крыша дома твоего,

При\была\ в Оде\ссу ба\нда и\з Аму\ра
В ба\нде были у\рки шулера\
Банда занималась тёмными делами
И за ней следила ГУБЧЕКА

Мурка\ ты мо\й Мурё\ноче\к
Мурка\ ты мо\й котё\ноче\к
Мурка\ Мару\ся Кли\мова\
Прости\ люби\мого\

/Марш коммунистических бригад
Сего\дня мы\ не на\ пара\де
К коммунизму на пути
В коммунистической бригаде
С нами Ленин впереди

Пове\сил свой сюрту\к на спинку сту\ла музыка\нт,
Распра\вил не\рвною   руко\й на ше\е черный ба\нт,
Подойди скорей поближе,    чтобы лучше слышать,
Если ты еще не слишком пьян…

О\ несча\стных и\ счастли\вых, о\ добре\ и зле\,
о лю\той не\нави\сти, и\ свято\й любви\
Что творится, что творилось  на твоей земле –
все в этой музыке -  ты только улови

Есть у\лицы\ центра\льные\, высо\кие\ и ва\жные\,
С витринами зеркальными, с гирляндами огней.
А мне милей бесшумные, милей - одноэтажные;
От их названий ласковых становится светлей.

Пройду\ по А\брико\сово\й, сверну\ на Ви\ногра\дную\,
И на Тенистой улице я постою в тени.
Вишневые, Грушевые, Зеленые, Прохладные,
Как будто в детство давнее ведут меня они.

Ри\мский па\па гря\зной ла\пой.
Ле\зет не\ в свои\ дела\.
И зачем такого папу.
Только мама родила!

Яблоки на\ снегу\ - розовые\ на бе\лом
Что же нам с ними делать, с яблоками на снегу
Яблоки на снегу в розовой нежной коже
Ты им еще поможешь, я себе не могу

Краси\вая\ любо\вь. Мы о\тдали\ ей да\нь безу\мства!
О, бо\же, как была\ к лицу\ тебе твоя\ весна\!
Но осень на дворе, деревья в серебре,
Увы, привычка охладила нас!

Снежи\нки на\ ресницах та\яли
И, зачаро\ванно, чита\ли мы\
Красивый незаконченный роман
Про любовь без измен!

Сча\стье вдру\г в тишине\ постуча\лось в две\ри
Неуже\ль ты ко мне\ верю и не ве\рю
Падал снег плыл рассвет осень моросила
Столько лет столько лет где тебя носило

Вдру\г как в ска\зке скри\пнула две\рь
Все\ мне я\сно ста\ло тепе\рь
Сто\лько ле\т я спо\рил с судьбо\й
Ра\ди э\той встре\чи с тобо\й

Жил да бы\л чёрный ко\т за угло\м.
И кота\ ненави\дел весь до\м.
Только песня совсем не о том,
Как не ладили люди с котом.

Про тебя\ мне шепта\ли кусты\
В белосне\жных поля\х под Москво\й,
Я хочу, чтоб услышала ты,
Как тоскует мой голос живой.

Го\воря\т, не по\везё\т,
Е\сли чё\рный ко\т доро\гу пе\рейдё\т.
А пока наоборот
Только чёрному коту и не везёт.

Проща\й, немы\тая\ Росси\я,
Страна\ рабо\в, страна\ госпо\д,
И вы, мундиры голубые,
И ты, им преданный народ.

Э\х, доро\ги,
пы\ль да ту\ман,
Хо\лода\, трево\ги,
да\ степно\й бурьян.

Зна\ть не мо\жешь
до\ли свое\й,
Может, крылья сложишь
посреди степей.

Ка\к мы люби\ли - Теперь оста\лось вспомина\ть,
Е\сть ещё кры\лья, Но не лета\ть нам, не лета\ть...
Кто бы влюблялся, Когда б заранее всё знал?
Вот и остался Без нас вдали пустой вокзал.

Кача\ется\ ваго\н, Стуча\т колё\са глу\хо,
Так хо\чется\ сойти\, Но о\стано\вок не\т.
От станции "Любовь" До станции "Разлука"
У нас с тобой билет, У нас с тобой билет.

Золоти\тся роза ча\йная\, как бока\л вина\
Между нами дверь стеклянная, между нами тишина
Мы губами прикасаемся к льдинке тонкого стекла
Мы согреть ее стараемся, но не чувствуем тепла

В то\м саду\ где мы\ с ва\ми встре\тили\сь
Ваш любимый куст хризантем расцвел
И в моей груди расцвело тогда
Чувство яркое нежной любви

Отцвели\ уж давно\
хризанте\мы в саду\
Но любо\вь все живе\т
в моем се\рдце больно\м

Мы ро\ждены\, чтоб ска\зку сде\лать бы\лью,
Прео\доле\ть простра\нство и\ просто\р,
Нам разум дал стальные руки-крылья,
А вместо сердца — пламенный мотор.

Все вы\ше, и вы\ше, и вы\ше
Стремим мы полет наших птиц,
И в каждом пропеллере дышит
Спокойствие наших границ.

влеку\т ли мечты\ небыва\лые,
Цвету\т ли цветы\ запозда\лые,
Все та\к же рыда\ет шарма\нка,
В Пари\же она\ чужестра\нка.

Верну\лась шарма\нка, о че\м-то вздыха\я
Верну\лась шарма\нка, ноча\ми рыда\я
Страда\ет шарма\нка, стира\я улы\бки,
Рыдает шарманка с душой первой скрипки!

Я\ не бу\ду, я\ не бу\ду це\лова\ть холо\дных ру\к,
В э\той о\сени\ никто\ не ви\нова\т, не ви\нова\т.
Я\ уе\хал, я\ уе\хал в Пе\тербу\рг,
А приехал в Ленинград.

/я не буду целовать холодных рук
Отгреме\ли давно\ наши ме\дные тру\бы,
Осень жё\лтая шлё\т письма с то\й стороны\,
Где друг друга ещё мы немножечко любим,
Но вчерашние сны никому не нужны.

Ты\ моря\чка я\ моря\к
Ты\ рыба\чка я\ рыба\к
Ты\ на су\ше я\ на мо\ре
Мы\ не встре\тимся\ ника\к

О\й ряби\на кудря\вая\
бе\лые\ цветы\
Ой рябина рябинушка
что взгрустнула ты

Есть го\род, кото\рый я ви\жу во сне\,
О, е\сли б вы зна\ли, как до\рог
У Чёрного моря явившийся мне,
В цветущих акациях город,

Ва\ше бла\горо\дие\, госпожа\ Уда\ча
Для кого ты добрая Для кого иначе
Девять граммов в сердце Постой, не зови
Не везет мне в смерти Повезет в любви.

Я по све\ту нема\ло ха\живал,
Жил в земля\нке, в око\пах, в тайге\,
Похоронен был дважды заживо,
Знал разлуку, любил в тоске.

Но Москво\ю привы\к я горди\ться
И везде повторял я слова:
Дорогая моя столица,
Золотая моя Москва!

Броня\ крепка\, и та\нки на\ши бы\стры,
И наши люди мужества полны:
В строю стоят советские танкисты -
Своей великой Родины сыны.

Гремя\ огне\м, сверка\я бле\ском ста\ли
Пойду\т маши\ны в я\ростны\й похо\д,
Когда нас в бой пошлёт товарищ Сталин
И Первый маршал в бой нас поведёт!

Де\нь и но\чь роня\ет се\рдце ла\ску,
День и ночь кружится голова,
День и ночь взволнованною сказкой
Мне звучат твои слова:

То\лько ра\з быва\ют в жи\зни встре\чи,
Только раз судьбою рвётся нить,
Только раз в холодный зимний вечер
Мне так хочется любить!

Че\рный бу\мер че\рный бу\мер
Сто\п-сигна\льные\ огни\
Черный бумер черный бумер
Если сможешь, догони

Я вы\рос на\ окра\ине\ рабо\чей го\родско\й
Парнишка в модной кепке зуб потёртый золотой
Парнишка вид простой и вовсе не красавиц я
А мне навстречу все девчёнки улыбаются

Ви\хри вражде\бные ве\ют над на\ми,
Те\мные си\лы нас зло\бно гнету\т.
В бо\й роково\й мы вступи\ли с врага\ми,
На\с еще су\дьбы безве\стные жду\т.

Не для\ меня\ придё\т весна\,
Не для меня Дон разольётся,
И сердце девичье забьётся
С восторгом чувств - не для меня.

Мне оста\лась одна\ заба\ва:
Пальцы в рот - и веселый свист.
Прокатилась дурная слава,
Что похабник я и скандалист.

О\й, полна\, полна\ коро\бушка\,
Есть и ситцы и парча.
Пожалей, моя зазнобушка,
Молодецкого плеча!

Шала\нды по\лные\ кефа\ли
В Оде\ссу Ко\стя при\води\л
И все биндюжники вставали
Когда в пивную он входил

"Я\ вам не\ скажу\ за всю\ Оде\ссу -
Вся\ Оде\сса о\чень ве\лика\...
Но и Молдаванка, и Пересыпь
Обожают Костю моряка

Та\м для меня\ гори\т оча\г,
Как вечный знак забытых истин.
Мне до него последний шаг,
И этот шаг длиннее жизни...

Но\чь и тишина\, да\нная на ве\к,
Дождь, а может быть, падает снег,
Все равно, бесконечной надеждой согрет,
Я вдали вижу город, которого нет...

Оле\ся, Оле\ся, Оле\ся,
Так пти\цы крича\т
Так птицы кричат
Так птицы кричат в поднебесье:

Живе\т в белору\сском Поле\сье
Кудесница леса Олеся.
Считает года по кукушке,
Встречает меня на опушке.

Знава\л я же\нщин мно\гих, таи\нственных и стро\гих,
Не в меру одиноких, не в меру разбитных.
Дарил я им букеты, читал я им сонеты,
Не зная, что судьбой мне выбрана лишь ты.

Ми\лая, ми\лая, ми\лая,
Нежный мой ангел земной.
Только однажды был счастлив я,
В день нашей встречи с тобой.

Все пе\река\ты да пе\река\ты -
Послать бы и\х по адресу\!
На это ме\сто уж нету ка\рты, -
Плыву впере\д по абрису\.

Мы\ бродя\чие\ Арти\сты
Мы в дороге день за днем.
И фургончик в поле чистом,
Это наш привычный дом.

Мы\ по все\й земле\ кочу\ем,
На погоду не глядим.
Где придется заночуем,
Что придется поедим.

Мали\новки\ заслы\ша го\лосо\к
Припомню я забытые свиданья
Три жердочки березовый мосток
Над тихою речушкой без названья

Прошу\ тебя\ в час ро\зовы\й
Напо\й тихо\нько мне\
Как дорог край березовый
В малиновой заре

А\лекса\ндра, А\лекса\ндра, э\то го\род на\ш с тобо\ю
Стали мы его судьбою, ты вглядись в его лицо
Что бы ни было вначале утолит он все печали
Вот и стало обручальным нам Садовое кольцо

Не сра\зу всё\ устро\ило\сь, Москва\ не сра\зу стро\ила\сь
Москва слезам не верила, а верила любви
Снегами запорошена, листвою заворожена
Найдёт тепло прохожему, а деревцу земли

Где\ же моя\ темногла\зая, где\?
В Вологде-где-где-где
В Вологде-где
В доме, где резной палисад.

Изги\б гита\ры желтой ты обнима\ешь не\жно,
Струна осколком эха пронзит тугую высь,
Качнется купол неба большой и звездно-снежный,
Как здорово, что все мы здесь сегодня собрались.

Давны\м-давно\, в день мо\его\ рожде\ния\,
Когда была\ такой, как ты тепе\рь,
За что - секрет, за просто так, наверное,
Мне подарил Господь свирель.

Возьми\ свире\ль мою\ волше\бную\,
Играй на ра\дость всем, игра\й на гру\сть.
Что наша жизнь - всего одно мгновение -
Ну хоть на капельку продлится пусть.

На\с в маши\не бы\ло дво\е
За рулем сидела ты
Сияло небо голубое
И глаза твои

Вме\сте ве\село\ шага\ть по\ просто\рам,
По просторам, по просторам!
И, конечно, припевать лучше хором,
Лучше хором, лучше хором!

У\тро кра\сит не\жным све\том
Сте\ны дре\внего\ Кремля\.
Просыпается с рассветом
Вся советская земля.

Мо\й костё\р в тума\не све\тит,
И\скры га\снут на\ лету\…
Но\чью на\с никто\ не встре\тит,
Мы\ прости\мся на\ мосту\.

И дрожи\т под росо\ю души\стых поле\й
Бледный ландыш склоненным бокалом,-
Это май-баловник, это май-чародей
Веет свежим своим опахалом.

Окра\сился ме\сяц багря\нцем,
Где во\лны шуме\ли у ска\л.
- Пое\дем, красо\тка, ката\ться,
Давно\ я тебя\ поджида\л.

Издалека до\лго течёт река\ Волга
Течёт река Волга конца и кра\я не\т
Среди хлебо\в спелых среди снего\в бе\лых
Течёт моя Волга а мне семнадцать лет

О\пусте\ла бе\з тебя\ Земля\…
Ка\к мне не\сколько\ часо\в прожи\ть?
Так же па\дает в сада\х листва\,
И куда\-то всё спеша\т такси\…

Любо\вь, похо\жая\ на со\н,
Серде\ц хруста\льный пе\резво\н.
Твоё\ волше\бное\ – люблю\ -
Я ти\хим э\хом по\вторю\.

У\ приро\ды не\т плохо\й пого\ды
Каждая погода благодать
Дождь ли снег любое время года
Надо благодарно принимать

Та\к уж случа\ется Е\сли влюбля\ются
Слу\шают все\ соловья\
Юноши, девушки, Бабушки, дедушки,
Папы и мамы, и я

Уро\нит ли ве\тер в ладо\ни сере\жку ольхо\вую\,
Начнет ли кукушка сквозь крик поездов куковать,
Задумаюсь вновь и, как нанятый, жизнь истолковываю,
и вновь прихожу к невозможности истолковать.

Коло\дец, коло\дец, Да\й воды напи\ться!
Коло\дец, коло\дец, Дай неба глото\к!
Быть может, быть может, Ещё возвратится
Счастливое время И в наш уголок.

А я\ наше\л другу\ю,
Хо\ть не люблю\, но целу\ю.
А когда я ее обнимаю,
Все равно о тебе вспоминаю.

Ды\м сигаре\т с менто\лом
Пья\ный уга\р кача\ет.
В глаза ты смотришь другому,
Который тебя ласкает.

Я люблю\ тебя, жи\знь,
Что само\ по себе\ и не но\во,
Я люблю тебя, жизнь,
Я люблю тебя снова и снова.

Штыки\ охра\ны — мы\ в Октя\брьском за\ле
Суде\йский сто\л, сталь про\куро\рских фра\з
"Так значит, ско\лько вы у не\мцев взя\ли,
Чтоб Ро\дину прода\ть в который ра\з?"

Е\сли вы\ нахму\рясь вы\йдете\ из до\ма
Если вам не в радость солнечный денек
Пусть вам улыбнется, как своей знакомой
С вами вовсе незнакомый встречный паренек

И\ улы\бка, бе\з сомне\нья,
Вдруг коснется ваших глаз,
И хорошее настроение
Не покинет больше вас

Ла\ндыши, ла\ндыши,
Све\тлого ма\я приве\т.
Ландыши, ландыши,
Белый букет.

А\х как хо\чется\ верну\ться
Ах как хочется ворваться в городок
На нашу улицу в три дома
Где все просто и знакомо на денек

Мне нра\вится\, что вы\ больны\ не мно\й,
Мне нравится, что я больна не вами,
Что никогда тяжелый шар земной
Не уплывет под нашими ногами.

Ва\ленки\ да ва\ленки\
ой да неподшиты стареньки
Нельзя валенки носить
Не в чем к миленькой сходить

Земля\ в иллю\мина\торе\, земля\ в иллю\мина\торе\,
Земля в иллюминаторе видна...
Как сын грустит о матери, как сын грустит о матери,
Грустим мы о земле - она одна.

Я ве\рю, друзья\, Карава\ны раке\т
Помчат нас вперёд От звезды до звезды.
На пыльных тропинках Далёких планет
Останутся Наши следы.

В шко\льное\ окно\ смо\трят о\блака\,
Бе\сконе\чным ка\жется\ уро\к.
Слы\шно, ка\к скрипи\т пё\рышко\ слегка\ -
И\ ложа\тся стро\чки на\ листо\к.

Я по\днима\ю сво\й бока\л
Чтоб вы\пить за\ твое\ здоро\вье
Но не\ вино\м хочу\ быть пья\н
Хочу\ быть пья\н твое\й любо\вью

Глаза\ми у\мными\ В глаза\ мне по\смотри\,
Словами нежными меня заговори,
Чтоб снова дрогнуло, Как в юности, в груди,
Чтоб я остался пьян тобою до зари.

Тру\дно бы\ло че\лове\ку
Десять ты\сяч лет наза\д,
Он пешко\м ходил в апте\ку,
На рабо\ту, в зооса\д.

Огне\й так мно\го зо\лоты\х
На у\лица\х Сара\това\
Парней так много холостых
А я люблю женатого

Ти\хо вокру\г,
Ветер тума\н унё\с,
На сопках манчжурских во\ины спя\т
И русских не слы\шат слё\з.

Глеб Жегло\в и Воло\дя Шара\пов
За столо\м засиде\лись не зря\..
Глеб Жеглов и Володя Шарапов
Ловят банду и главаря!

Дыми\лась ро\ща по\д горо\ю,
И вместе с ней горел закат...
Нас оставалось только трое
Из восемнадцати ребят.

Я\блони\ в цвету\ - весны\ творе\нье,
Яблони в цвету - весны круженье.
Радости свои мы им дарили,
С ними о любви мы говорили.

Утро\ тума\нное\, у\тро седо\е,
Нивы печальные, снегом покрытые...
Нехотя вспомнишь и время былое,
Вспомнишь и лица, давно позабытые.

Е\хали\ на тро\йке с бу\бенца\ми,
А вдали мелька\ли огоньки\...
Эх, когда бы мне теперь за вами,
Душу бы развеять от тоски!

Доро\гой дли\нною\,
Погодой лунною,
Да с песней той,
Что вдаль летит звеня,

Иде\т солда\т по го\роду\ по не\знако\мой у\лице\
И от улы\бок де\вичьих вся у\лица светла\
Не обижайтесь девушки но для солдата главное
Чтобы его далекая любимая ждала

Бьется в те\сной печу\рке ого\нь,
На поле\ньях смола\, как слеза\,
И поет мне в землянке гармонь
Про улыбку твою и глаза.

Я\ игра\ю на\ гармо\шке
У прохо\жих на виду\...
К сожале\нью, день рожде\нья
Только раз в году.

Пусть бегу\т неуклю\же
Пешехо\ды по лу\жам,
А вода - по асфальту рекой.
И неясно прохожим

По прию\там я с де\тства скита\лся,
Не име\я родно\го угла\,
Ах, зачем я на свет появился,
Ах, зачем меня мать родила?

Све\тит не\знако\мая\ звезда\,
Сно\ва мы\ ото\рваны\ от до\ма,
Снова между нами города,
Взлетные огни аэродрома.

Наде\жда - мой ко\мпас земно\й,
А удача - награда за смелость,
А песни довольно одной,
Чтоб только о доме в ней пелось.

Пока\ свобо\дою\ гори\м,
Пока\ сердца\ для че\сти жи\вы,
Мой дру\г, отчи\зне по\святи\м
Души\ прекра\сные\ поры\вы!

Вот и ле\то прошло\,
Сло\вно и не быва\ло.
На пригреве тепло,
Только этого мало.

Я прошу\, Поговори\те со мно\й, друзья\.
Я прошу\, Поговорите со мной, друзья.
Старая В альбоме есть фотография,
Мы на ней словно мафия Или просто семья.

Слышу го\лос из Прекра\сного Дале\ка
Голос утренний в серебряной росе
Слышу голос и манящая дорога
Кружит голову как в детстве карусель

Прекра\сное\ Дале\ко
Не бу\дь ко мне\ жесто\ко
Не будь ко мне жестоко
Жестоко не будь

На то\т больша\к, на пе\рекрё\сток
Уже\ не на\до бо\льше мне\ спеши\ть.
Жить без любви, быть может, просто,
Но как на свете без любви прожить.

А мо\жет она\ начина\ется
С той пе\сни, что пе\ла нам ма\ть,
С того, что в любых испытаниях
У нас никому не отнять.

Не\ валя\й дурака\, Аме\рика\,
Вот те валенки, мёрзнешь небось.
Что Сибирь, что Аляска – два берега.
Баня, водка, гармонь и лосось

При\зрачно все\     в этом ми\ре бушу\ющем.
Е\сть только ми\г  -  за него\ и держи\сь.
Есть только миг   между прошлым и будущим.
Именно он   называется жизнь.

Вы\несет всё\ - и широ\кую, я\сную
Гру\дью доро\гу проло\жит себе\.
Жаль только - жить в эту пору прекрасную
Уж не придется - ни мне, ни тебе.

Я куплю\ тебе до\м у пруда\ в подмоско\вье
И тебя приведу в этот собственный дом
Заведу голубей и с тобой и с любовью
Мы посадим сирень  под окном

Рома\шки спря\тали\сь пони\кли лю\тики\
Когда засты\ла я от го\рьких сло\в
Зачем вы девочки красивых любите
Непостоянная у них любовь

Шуме\л камы\ш, дере\вья гну\лись,
А ночка темная была…
Одна возлюбленная пара
Всю ночь гуляла до утра.

Наш па\рово\з, впере\д лети\.
В Комму\не о\стано\вка.
Другого нет у нас пути—
В руках у нас винтовка.

У ка\ждого из на\с на све\те есть места\,
Куда приходим мы на миг уединиться,
Где память, как строка почтового листа,
Нам сердце исцелит, когда оно томится.

Чи\стые\ пруды\, засте\нчивы\е и\вы,
Как девчонки, смолкли у воды.
Чистые пруды - веков зеленый сон -
Мой дальний берег детства, где звучит аккордеон...

Когда\ был Ле\нин ма\леньки\й,
С кудря\вой го\лово\й,
Он тоже бегал в валенках
По горке ледяной.

Наве\рх, о това\рищи, все\ по места\м!
После\дний пара\д наступа\ет!
Врагу\ не сдаё\тся наш го\рдый «Варя\г»,
Поща\ды никто\ не жела\ет!

Комсо\мольцы\-добро\вольцы\,
Мы сильны нашей верною дружбой.
Сквозь огонь мы пойдём, если нужно
Открывать молодые пути!

/http://www.karaoke.ru/catalog/song/25721
Проща\й, со все\х вокза\лов по\езда\
Уходят в дальние края.
Прощай, мы расстаёмся навсегда
Под белым небом января.

Вот кто\-то с го\рочки\ спусти\лся
Наверно милый мой идет
На нем защитна гимнастерка
Она с ума меня сведет

/Не плачь девчонка пройдут дожди
Не пла\чь девчо\онка\ пройду\т дожди\
Солда\т верне\ется ты то\лько жди\
Пускай далеоко твой верный друг
Любовь на свете сильней разлук

Как бу\дто ве\тры с го\р трубя\т солда\ты сбо\р
Доро\га от поро\га далека\
И уронив платок чтоб не видал никто
Слезу смахнула девичья рука

Каки\м ты бы\л, таки\м оста\лся,
Орёл степной, казак лихой!...
Зачем, зачем ты снова повстречался,
Зачем нарушил мой покой?

Ба\бушки, ба\бушки, ба\бушки-стару\шки,
Ба\бушки, ба\бушки, у\шки на маку\шке.
Ба\бушки, ба\бушки, мы вас уважа\ем.
Только ка\к вас поня\ть, мы, увы, не зна\ем.

Не сы\пь мне со\ль на ра\ну,
Не говори\ навзры\д.
Не сыпь мне соль на рану,
Она еще болит.

Та\м, где ме\сяц ска\зку сто\рожи\т,
Где\ в зеле\ных де\брях ве\тер ро\пщет,
Роща соловьиная стоит,
Белая березовая роща.

Та\м на то\нких ро\зовы\х ветвя\х,
В зарослях черемухи душистой
Соловей российский, славный птах,
Открывает песнь свою со свистом.

Нам не\ дано\ преду\гада\ть,
Как сло\во на\ше о\тзове\тся,-
И на\м сочу\вствие\ дае\тся,
Как на\м дае\тся бла\года\ть...

Ро\зпряга\йте, хло\пци, ко\ни,
Та\ ляга\йте спо\чива\ть.
А\ я пи\ду в са\д зеле\ний,
В са\д крини\ченьку\ копа\ть.

/http://www.karaoke.ru/catalog/song/671
По До\ну гуля\ет, по До\ну гуля\ет,
По До\ну гуля\ет казак молодой.
В саду дева плачет, в саду дева плачет,
В саду дева плачет над быстой рекой.

Я на\чал жи\знь в трущо\бах го\родски\х,
И добрых сло\в я не слыха\л.
Когда ласкали вы детей своих,
Я есть хотел, я замерзал.

Ах, война\, что ж ты сде\лала, по\длая:
стали ти\хими на\ши дворы\,
наши мальчики головы подняли,
повзрослели они до поры,

Беле\ет ли в по\ле поро\ша,
Поро\ша, поро\ша,
Белеет ли в поле пороша
Иль гулкие ливни шумят,

Жди\ меня\, и я\ верну\сь.
Только очень жди,
Жди, когда наводят грусть
Желтые дожди,

Мы\ в таки\е шага\ли да\ли,
Что\ не о\чень-то\ и дойде\шь.
Мы в засаде годами ждали,
Невзирая на снег и дождь.

Мы\ себе\ дава\ли сло\во - не\ сходи\ть с пути\ прямо\го,
Но так уж суждено.
И уж если откровенно - всех пугают перемены,
Но - тут уж все равно.

Письма\ письма ли\чно на по\чту ношу\
Словно\ я рома\н с продолже\ньем пишу\
Знаю знаю точно где мой адресат
В доме где резной палисад

В лесу\, говоря\т, в бору\, говоря\т,
Расте\т, говоря\т, сосе\нка,
Понравилась мне, молодцу,
Веселая девчонка.

Мы\ на ло\дочке\ ката\лись,
Зо\лоти\стой, зо\лото\й, -
Не гребли, а целовались,
Не качай, брат, головой.

Куба — любо\вь моя\!
Остров зари\ багро\вой…
Песня летит, над планетой звеня:
«Куба — любовь моя!»

Тебе\ судьбу\ мою\ верши\ть.
Тебе\ одно\й меня\ суди\ть,
Команда молодости нашей,
Команда, без которой мне не жить.

С тобо\ю мы\ объе\хали\ полсве\та,
Но ка\ждый раз тяну\ло нас домо\й!
Поста\вь мою люби\мую кассе\ту,
Дава\й передохнё\м перед игро\й

Не\ба у\тренне\го стя\г…
В жизни ва\жен первый ша\г.
Слышишь: ре\ют над страно\ю
Ветры я\ростных ата\к!

И вно\вь продолжа\ется бо\й.
И се\рдцу трево\жно в груди\…
И Ле\нин — тако\й молодо\й,
И ю\ный Октя\брь впереди\!

Огляни\сь, незнако\мый прохо\жий,
Мне твой взгля\д неподку\пный знако\м…
Может, я\ это, — то\лько моло\же,
Не всегда\ мы себя\ узнаё\м…

Запове\дный напе\в, запове\дная да\ль.
Свет хруста\льной зари\, свет, над ми\ром встаю\щий.
Мне понятна твоя вековая печаль,
Беловежская пуща, Беловежская пуща.

Я\ гляжу\ ей всле\д -
Ни\чего\ в ней не\т.
А я всё гляжу\,
Глаз не отвожу\...

Де\нь Побе\ды, ка\к он бы\л от на\с дале\к,
Как в костре потухшем таял уголе\к.
Были ве\рсты, обгоре\лые, в пыли\, -
Этот день мы приближали как могли.

На ма\ленько\м плоту\
сквозь бу\ри, до\ждь и гро\зы.
Взяв то\лько сны\ и гре\зы
и де\тскую\ мечту\

Исче\зли со\лнечны\е дни\,
И пти\цы у\лете\ли...
И вот проводим мы одни
Неделю за неделей...

Родна\я, родна\я, родна\я земля\,
Холмы и равнины, леса и поля,
Ты доброй судьбою на счастье дана,
Одна ты на свете и в сердце одна.

По\ зеле\ной гла\ди мо\ря, по\ равни\не о\кеа\на
Корабли и капитаны, покорив простор широт,
Мира даль деля на мили, жизни даль деля на вахты,
Держат курс согласно фрахта в порт, в порт.

Для меня\ нет тебя\, прекра\сней,
Но ловлю\ я твой взо\р напра\сно,
Как виде\нье, неу\лови\мо,
Каждый де\нь ты прохо\дишь ми\мо...

Что\ стои\шь кача\ясь,
то\нкая\ ряби\на,
Го\лово\й склоня\ясь
до\ само\го ты\на,

Есть в ка\ждой нра\вственно\й систе\ме
иде\я, о\бщая\ для все\х:
нельзя и с теми быть, и с теми,
не предавая тех и тех.

Никто\ как Бо\г!
Не ест, не пьет
Меньшой сынок,
Гляди - умрет!

У\везу\ тебя\ я в ту\ндру, у\везу\ к седы\м снега\м
Белой шкурою медвежьей брошу их к твоим ногам
По хрустящему морозу, увезу на край земли
И среди сугробов белых затеряемся в дали.

Мы\ пое\дем мы\ помчи\мся на\ оле\нях у\тром ра\нним
И отча\янно ворве\мся прямо в снежную зарю.
Ты узнаешь, что напрасно называют север крайним,
Ты увидишь он бескрайний, я тебе его дарю

Я ха\ту поки\нул,
Поше\л воева\ть,
Чтоб зе\млю в Грена\де
Крестья\нам отда\ть.

Посто\й, парово\з, не стучи\те коле\са,
конду\ктор, нажми\ на тормоза\.
Я к ма\меньке ро\дной с после\дним приве\том
спешу\ показа\ться на глаза\

Ту\чки небе\сные, ве\чные стра\нники!
Сте\пью лазу\рною, це\пью жемчу\жною
Мчи\тесь вы, бу\дто как я\ же, изгна\нники
С ми\лого се\вера в сто\рону ю\жную.

В не\бе та\ют о\блака\,
И, лучистая на зное,
В искрах катится река,
Словно зеркало стальное.

/Александр Пушкин, «Зимний вечер» (четырёхстопный/двусложный хорей)
Бу\ря мгло\ю не\бо кро\ет,
Ви\хри сне\жные\ крутя\;
То\, как зве\рь, она\ заво\ет,
То\ запла\чет, ка\к дитя\…

Но\чева\ла ту\чка зо\лота\я
На\ груди\ уте\са-велика\на;
У\тром в пу\ть она\ умча\лась ра\но,
По\ лазу\ри ве\село игра\я…

/Михаил Лермонтов, «Выхожу один я на дорогу...» (пятистопный/двусложный хорей)
Вы\хожу\ оди\н я на\ доро\гу;
Скво\зь тума\н кремни\стый пу\ть блести\т;
Но\чь тиха\. Пусты\ня вне\млет Бо\гу,
И\ звезда\ с звездо\ю го\вори\т.

/четырехстопный/двусложный ямб
Мой дя\дя са\мых че\стных пра\вил
Когда не в шутку занемог
он уважать себя заставил
и лучше выдумать не мог

Не дожда\ться мне, ви\дно, свобо\ды.
А тюре\мные дни\ будто го\ды;
И окно\ высоко\ над землё\й,
А у две\ри стои\т часово\й.

На\ побы\вку е\дет
Мо\лодо\й моря\к,
Гру\дь его\ в меда\лях,
Ле\нты в я\коря\х.

В на\шей жи\зни все\ быва\ет
И\ под со\лнцем ле\д не та\ет
И\ тепло\м зима\ встреча\ет
До\ждь иде\т в де\кабре\

Лава\нда, горная лава\нда,
На\ших встреч с тобо\й синие цветы\.
Лава\нда, горная лава\нда,
Ско\лько лет прошло\, но помним я и ты\.

Ра\скудря\вый кле\н зеле\ный, ли\ст резно\й,
Я влюбле\нный и смуще\нный пред тобо\й,
Клен зеле\ный, да клен кудря\вый,
Да раскудря\вый, резно\й!

На\ моем сто\лике в ма\ленькой спа\ленке
Сре\ди игру\шек, духо\в и пома\д
Е\сть фотогра\фия ю\ного стра\нника
Смо\трит мне в ду\шу улы\бчивый взгля\д

Фотогра\фия де\вять на двена\дцать
С наи\вной по\дписью\ на па\мять
Фотогра\фия, где мо\г ты улыба\ться
Хотя\ улы\бкой вря\д ли что\ испра\вить

Твоя\ вишнё\вая\ девя\тка
Меня\ совсе\м с ума\ свела\
Твоя\ вишнё\вая\ девя\тка
Поко\й мой на\прочь о\тняла\

Кру\тится, ве\ртится ша\рф голубо\й,
Кру\тится, вертится над голово\й,
Крутится, вертится, хочет упа\сть,
Кавалер барышню хочет укра\сть.

/анапест
О, весна\ без конца\ и без кра\ю —
Без конца\ и без кра\ю мечта\!
Узнаю\ тебя, жи\знь! Принима\ю!
И приве\тствую зво\ном щита\!

Ка\бы не бы\ло зимы\
В города\х и сё\лах,
Ни\когда б не зна\ли мы\
Э\тих дне\й весё\лых.

/Улыбка
О\т улы\бки хму\рый де\нь светле\й
От улыбки в небе радуга проснется
Поделись улыбкою своей
И она к тебе не раз еще вернется

/Пропала собака
Виси\т на забо\ре колы\шется ве\тром
Колы\шется ве\тром бума\жный листо\к
Пропа\ла соба\ка пропа\ла соба\ка
Пропа\ла соба\ка по кли\чке Дружо\к

/частушка
У\скоре\нье - ва\жный фа\ктор,
Но\ не вы\держа\л реа\ктор.
И\ тепе\рь наш ми\рный а\том
Вся\ Евро\па кро\ет ма\том.

Мы живё\м, под собо\ю не чу\я страны\,
Наши ре\чи за де\сять шаго\в не слышны\,
А где хва\тит на по\лразгово\рца,
Там припо\мнят кремлё\вского го\рца.

На Ти\хоре\цкую\ соста\в отпра\вится\,
Вагончик тро\нется, перрон оста\нется.
Стена кирпи\чная, часы вокза\льные,
Платочки бе\лые, платочки бе\лые,

/Уральская рябинушка
Ве\чер ти\хой пе\снею\ над реко\й плыве\т,
Да\льними зарни\цами све\тится заво\д,
Где\-то по\езд ка\тится то\чками огня\,
Где-то под ряби\нушкой па\рни жду\т меня\.

Бе\лая а\рмия, че\рный Баро\н
Сно\ва гото\вят нам ца\рский трон,
Но\ от тайги\ до брита\нских море\й
Кра\сная А\рмия все\х сильней.

сижу\ за решё\ткой в темни\це сыро\й
вскормлё\ннный в нево\ле оре\л молодо\й
мой гру\стный това\рищ маха\я крыло\м
крова\вую пи\щу клюё\т под окно\м

/амфибрахий
Не ве\тер бушу\ет над бо\ром,
Не с го\р побежа\ли ручьи\ -
Моро\з-воево\да дозо\ром
Обхо\дит владе\нья свои\.

/амфибрахий
Есть же\нщины в ру\сских селе\ньях
С споко\йною ва\жностью ли\ц,
С краси\вою си\лой в движе\ньях,
С похо\дкой, со взгля\дом цари\ц,—

в лесу\ роди\лась ё\лочка\
в лесу\ она\ росла\
зимо\й и ле\том стро\йная\
зеле\ная\ была\

бе\лые ро\зы бе\лые ро\зы
бе\ззащи\тны шипы\
что\ с ними сде\лал сне\г и моро\зы
ле\д витри\н голубы\х

коле\чко на па\мять коле\чко
Тепе\рь не свобо\дно серде\чко,
Скажи\ ты мне, ре\чка,
Скажи\ мне ряби\на,
За что\ я его\ полюби\ла

На трибу\нах стано\вится ти\ше…
Тает бы\строе вре\мя чуде\с.
До свида\нья, наш ла\сковый Ми\ша,
Возвраща\йся в свой ска\зочный ле\с.

Четве\ртые су\тки пыла\ют стани\цы
Гори\т под нога\ми родна\я земля\
Не па\дайте ду\хом пору\чик Голи\цын
Корне\т Оболе\нский нале\йте вина\

Дре\млет прити\хший се\верный го\род
Ни\зкое не\бо над голово\й *
Что\ тебе сни\тся кре\йсер Авро\ра
В ча\с когда у\тро встае\т над Нево\й

Це\лую но\чь солове\й нам насви\стывал
Го\род молча\л и молча\ли дома\
Бе\лой ака\ции гро\здья души\стые
Но\чь напроле\т нас своди\ли с ума\

Одна\жды, в студе\ную зи\мнюю по\ру,
Я и\з лесу вы\шел; был си\льный моро\з.
Гляжу\, поднима\ется ме\дленно в го\ру
Лоша\дка, везу\щая хво\росту во\з.

сою\з неруши\мый респу\блик свобо\дных
сплоти\ла на ве\ки вели\кая ру\сь
Да здра\вствует со\зданный во\лей наро\дов
Еди\ный, могу\чий Сове\тский Сою\з!

Сла\вься, оте\чество, на\ше свобо\дное -
Дру\жбы наро\дов наде\жный опло\т!
Па\ртия Ле\нина си\ла наро\дная
На\с к торжеству\ коммуни\зма веде\т.

/прощание славянки
Этот ма\рш не смолка\л на перро\нах,
Когда вра\г заслоня\л горизо\нт.
С ним отцо\в наших в ды\мных ваго\нах
Поезда\ увози\ли на фро\нт.

/прощание славянки (припев)
И е\сли в похо\д
Страна\ позовё\т
За край наш родной
Мы все пойдём в священный бой!

/Вот и весь разговор
Просто встре\тились два\ одино\чества,
Развели\ у доро\ги косте\р,
А костру\ разгора\ться не хо\чется,
Вот и ве\сь, вот и ве\сь разгово\р.

/Вот и весь разговор http://www.karaoke.ru/song/3384.htm
Не сложи\лось у пе\сни нача\ло,
Я не зна\ю кто пра\в, кто не пра\в,
Нас людска\я молва\ повенча\ла.
Не поня\в, ничего\ не поня\в.

/Остров Невезения
Ве\сь покры\тый зе\ленью\ абсолю\тно ве\сь
О\стров невезе\ния в океане е\сть
О\стров невезе\ния в океане е\сть
Ве\сь покрытый зе\ленью абсолютно ве\сь

В темно-си\нем лесу\, где трепе\щут оси\ны,
Где с дубо\в-колдуно\в облета\ет листва\,
На поля\не траву\ зайцы в по\лночь коси\ли
И при э\том напева\ли стра\нные слова\:

А на\м все равно\, а на\м все равно\,
Пусть бои\мся мы\ во\лка и сову\.
Дело\ есть у на\с  в самый жуткий ча\с
Мы волше\бную косим трын-траву\.

Ме\дленно мину\ты уплыва\ют вда\ль
Встречи с ними ты уже не жди\
И хотя нам про\шлого немно\го жа\ль
Лу\чшее коне\чно впереди\

Ска\тертью ска\тертью да\льний путь сте\лится
И\ упира\ется пря\мо в небоскло\н
Ка\ждому ка\ждому в лу\чшее ве\рится
Ка\тится ка\тится го\лубой ваго\н

Раски\нулось мо\ре широ\ко,
И во\лны бушу\ют вдали\.
Това\рищ, мы е\дем дале\ко,
Пода\льше от на\шей земли\.

Когда\ весна\ придё\т, не зна\ю,
Приду\т дожди\... Сойду\т снега\...
Но ты\ мне, у\лица\ родна\я,
И в не\пого\ду до\рога\.

Не\ жале\ю, не\ зову\, не пла\чу,
Все\ пройде\т, как с бе\лых я\блонь ды\м.
Увяданья золотом охваченный,
Я не буду больше молодым.

Я\ прошу\ хоть не на\долго
Грусть моя\, ты поки\нь меня,
Облако\м, сизым облаком,
Ты полети\ к родному до\му,
Отсю\да к родному до\му.

Кахо\вка, Кахо\вка - родна\я винто\вка,
Горя\чая пу\ля, лети\!
Ирку\тск и Варша\ва, Оре\л и Кахо\вка -
Эта\пы большо\го пути\.

Орлё\нок орлё\нок взлети\ выше со\лнца
и сте\пи с высо\т огляди\
Наве\ки умо\лкли весё\лые хло\пцы,
В живы\х я оста\лся оди\н.

С чего\ начина\ется Ро\дина
С карти\нки в твоё\м букваре\,
С хоро\ших и ве\рных това\рищей,
Живу\щих в сосе\днем дво\ре.

Где\-то багу\льник на со\пках цвете\т,
Ке\дры вонза\ются в не\бо...
Ка\жется, бу\дто давно\ меня жде\т
Кра\й, где ни ра\зу я не\ был.

/Снова замерло все до рассвета (одинокая гармонь)
Снова за\мерло все\ до рассве\та,
Дверь не скри\пнет, не вспы\хнет ого\нь,
Только слы\шно - на у\лице где\-то
Одино\кая бро\дит гармо\нь.

/анапест
Что ты жа\дно гляди\шь на доро\гу
В стороне\ от весё\лых подру\г?
Знать, заби\ло серде\чко трево\гу -
Всё лицо\ твоё вспы\хнуло вдру\г.

Дава\йте негро\мко, дава\йте вполго\лоса,
Дава\йте прости\мся светло\.
Неделя другая, и мы успокоимся,
Что было то было, прошло.

Здесь пти\цы не\ пою\т,
Дере\вья не\ расту\т.
И только мы к плечу плечо
Врастаем в землю тут.

Гори\т и кру\жится плане\та,
Над на\шей Ро\диною ды\м,
И значит, нам нужна одна победа,
Одна на всех - мы за ценой не постоим.

Нас жде\т ого\нь смерте\льный,
И все ж бессилен он.
Сомненья прочь, уходит в ночь отдельный,
Десятый наш десантный батальон.

Встава\й, прокля\тьем за\клейме\нный,
Весь ми\р голо\дных и\ рабо\в!
Кипи\т наш ра\зум во\змуще\нный
И в сме\ртный, бо\й вести\ гото\в.

Это е\сть наш после\дний
И реши\тельный бо\й;
С Инте\рнационалом
Воспря\нет ро\д людско\й!

И тогда\ наверняка\ вдруг запля\шут облака\
И кузнечик запиликает на скрипке
С голубого ручейка начинается река
Ну а дружба начинается с улыбки

В ю\ном ме\сяце\ апре\ле
В ста\ром па\рке та\ет сне\г
И\ весе\лые\ каче\ли
На\чина\ют сво\й разбе\г

Взмыва\я вы\ше е\ли
Не ведая преград
Крылатые качели
Летят летят летят

Чу\нга-Ча\нга си\ний не\босво\д
Чу\нга-Ча\нга ле\то кру\глый го\д
Чу\нга-Ча\нга ве\село живе\м
Чу\нга-Ча\нга пе\сенку пое\м

Чу\до-о\стров чу\до-о\стров
Жить на нем легко и просто
Жить на нем легко и просто
чунга-чанга

На\ше сча\стье по\стоя\нно
Жуй кокосы ешь бананы
Жуй кокосы ешь бананы
Чунга-Чанга

Я па\мятник себе\ воздви\г нерукотво\рный,
К нему не зарастет народная тропа,
Вознесся выше он главою непокорной
Александрийского столпа.

Я сего\дня до зари\ вста\ну.
По широ\кому пройду\ по\лю...
Что-то с па\мятью мое\й ста\ло,
Все, что бы\ло не со мно\й - по\мню.

А степна\я трава\ па\хнет го\речью,
Молоды\е ветра\ зеле\ны.
Просыпаемся мы - и грохочет над полночью
То ли гроза, то ли эхо прошедшей войны.

Взве\йтесь костра\ми, Си\ние но\чи!
Мы\, пионе\ры, - Де\ти рабо\чих.
Близится эра Светлых годов.
Клич пионера: "Всегда будь готов!"

Со\лнечный кру\г, Не\бо вокру\г -
Э\то рису\нок мальчи\шки.
На\рисова\л о\н на листке\
И\ написа\л в уголке\:

Пу\сть всегда\ бу\дет со\лнце!
Пусть всегда будет небо!
Пусть всегда будет мама!
Пусть всегда буду я!

Люди ми\ра, на мину\ту вста\ньте!
Слу\шайте, слу\шайте: гуди\т со всех сторо\н –
Это раздается в Бухенвальде
Колокольный звон, колокольный звон.

Что\ ты, Ва\ся, при\уны\л,
Го\лову пове\сил,
Ясны очи замутил,
Хмуришься, невесел?

Война\ нас гну\ла и\ коси\ла.
Прише\л коне\ц и е\й само\й.
Четы\ре го\да ма\ть без сы\на...
Бери\ шине\ль - пошли\ домо\й.

На по\ле та\нки гро\хота\ли,
Солда\ты шли\ в после\дний бо\й,
А мо\лодо\го ко\манди\ра
Несли\ с проби\той го\лово\й.

Мы та\к давно\, мы та\к давно\ не о\тдыха\ли.
Нам было про\сто не до о\тдыха с тобо\й.
Мы пол-Евро\пы по-пласту\нски пропаха\ли,
И завтра, за\втра, наконе\ц, последний бо\й.

Еще\ немно\го, еще\ чуть-чу\ть,
Последний бо\й - он трудный са\мый.
А я в Росси\ю, домо\й, хочу\,
Я так давно\ не видел маму\.

Ка\к тепе\рь не ве\сели\ться
Не\ грусти\ть от ра\зных бе\д
В на\шем до\ме по\сели\лся
За\меча\тельны\й сосе\д

Жил был худо\жник оди\н, домик име\л и холсты\,
Но он актрису люби\л, ту, что люби\ла цветы\.
Он тогда продал свой дом, продал, картины и кров,
И на все деньги купил целое море цветов.

Миллио\н, миллио\н, миллио\н алых ро\з.
Из окна\, из окна\, из окна\ видишь ты\,
Кто влюбле\н, кто влюбле\н, кто влюбле\н, И всерье\з,
Свою жи\знь для тебя\ преврати\т в цветы\.

/пугачева паромщик припев
Разлу\к так мно\го на\ Земле\, и ра\зных су\деб,
Надежду да\рит на заре\ паромщик лю\дям.
То берег ле\вый нужен и\м, то берег пра\вый.
Влюбленных мно\го - он оди\н у перепра\вы.

/пугачева паромщик
Упала ра\нняя звезда\ в полях прохла\да
Плывет паро\м поет вода\ о чем-то ря\дом
И там где све\тится река\ у тихой ро\щи
Соединя\ет берега\ седой паро\мщик

Берега\, берега\, Берег э\тот и то\т,
Между ни\ми река\ Моей жи\зни.
Между ни\ми река\ Моей жи\зни течё\т,
От рожде\нья течё\т И до три\зны.

В со\н мне - же\лтые\ огни\,
И\ хриплю\ во сне\ я:
Повремени, повремени,-
Утро мудренее!

Но\ и у\тром всё\ не та\к,
Нет того весе\лья:
Или ку\ришь натоща\к,
Или пье\шь с похме\лья.

Ра\сцвета\ли я\блони\ и гру\ши,
По\плыли\ тума\ны на\д реко\й,
Вы\ходи\ла на\ бере\г Катю\ша,
На\ высо\кий бе\рег на\ круто\й,

Эх я\блочко\ да с го\луби\кою\
Подходи\ буржу\й глазик вы\колю
Глазик выколю один останется
Чтоб ты знал говно кому кланяться

Умо\м Росси\ю не\ поня\ть,
Арши\ном о\бщим не\ изме\рить:
У не\й осо\бенна\я ста\ть —
В Росси\ю мо\жно то\лько ве\рить.

Ма\йскими коро\ткими ноча\ми,
Отгремев, закончились бои.
Где же вы теперь, друзья-однополчане,
Боевые спутники мои?

Капита\н, капита\н, улыбни\тесь,
Ведь улы\бка - это фла\г корабля\.
Капитан, капитан, подтянитесь,
Только смелым покоряются моря!

Виногра\дную ко\сточку в те\плую зе\млю заро\ю,
И лозу поцелую, и спелые гроздья сорву,
И друзей созову, на любовь свое сердце настрою,
А иначе, зачем на земле этой вечной живу.

Не\ слышны\ в саду\ даже шо\рохи\,
Все\ здесь замерло\ до утра\.
Е\сли б зна\ли вы\, как мне до\роги
Подмоско\вные вечера\.

Ах, Та\ня, Та\ня, та\нечка\
С ней слу\чай бы\л тако\й:
Служила наша Танечка
В столовой заводской.

Рабо\тница\ пита\ния\
Приста\влена\ к борща\м,
На Та\нечку\ внима\ния\
Никто\ не о\браща\л.

Покро\ется не\бо пыли\нками зве\зд
И вы\гнутся ве\тви упру\го
Тебя я услышу за тысячу верст
Мы эхо мы эхо
Мы долгое эхо друг друга.

Тако\го снегопа\да, Тако\го снегопа\да
Давно\ не зна\ли здешние\ места\ !
А сне\г не знал и па\дал, А сне\г не знал и па\дал !
Земля была прекра\сна, Прекра\сна и чиста\ !

Снег кружи\тся, Лета\ет, лета\ет,
И, позе\мкою клубя\,
Замета\ет зима\, замета\ет
Все, что бы\ло до тебя\.

На\ грани\це ту\чи хо\дят хму\ро,
Кра\й суро\вый пе\лено\й объя\т.
У\ высо\ких бе\рего\в Аму\ра
Ча\совы\е Ро\дины\ стоя\т.

Ши\рока\ страна\ моя\ родна\я,
Мно\го в не\й лесо\в, поле\й и ре\к!
Я\ друго\й тако\й страны\ не зна\ю,
Где\ так во\льно ды\шит че\лове\к.`