gl = [['name', 'years', 'birth', 'death'
	, 'accession to politburo', 'years at the accession', 'days at the accession'
	, '', 'number', 'deathday', 'number', 'life days'
	, 'age', 'quantity', 'Total', 'first', 'last', 'live', 'woman', 'politburo list', 'candidate list'
	, 'table', 'statistics', 'data', 'personal grave', 'politburo member', 'candidate member', 'statall', 'candidate and politburo member']
	, ['имя отчество фамилия', 'лет', 'рождение', 'смерть'
	, 'вступление<br>в политбюро', 'лет при<br>вступлении', 'дней при<br>вступлении'
	, 'день<br>рождения', 'кол-<br>во', 'день<br>смерти', 'кол-<br>во', 'дней<br>жизни'
	, 'возраст', 'количество', 'Всего', 'первая', 'последняя', 'жив', 'женщина', 'Список членов политбюро.', 'Список кандидатов в члены политбюро.'
	, 'Таблица.', 'Статистика.', 'Данные.', 'Список людей похороненных в отдельных могилах.', 'член<br>политбюро', 'кандидат в члены<br>политбюро', 'Количество человек по категориям.', 'кандидат и член политбюро']
]

const REF = 'https://ru.wikipedia.org/wiki/Состав_Президиума/Политбюро_ЦК_КПСС'
const SUBREF = ['#Члены_Политбюро_ЦК_РКП(б)-ВКП(б)-КПСС', '#Кандидаты_в_члены_Политбюро_ЦК_РКП(б)-ВКП(б)-КПСС']
const monthMultilier = 32;

function load() {
	// startTime = new Date();

	const dbIndex = 2
	const ddIndex = 3
	const bsIndex = 7
	const bsQuantityIndex = bsIndex + 1
	const dsIndex = bsQuantityIndex + 1
	const dsQuantityIndex = dsIndex + 1
	const dayLiveIndex = dsQuantityIndex + 1
	const liveIndex = dayLiveIndex + 1
	const womanIndex = liveIndex + 1
	const st = "st";
	const pm = ['-', '+'];
	s = '';

	const findShortestDBDifference = 0
	const findShortestLifeLengthDifference = 0
	const findSameSurname = 0
	const findShortestLongestSurname = 0
	const findNamePatronymic = 0
	if (findShortestDBDifference) {
		sdb = []
	}
	if (findShortestLifeLengthDifference) {
		sl = []
	}
	if (findSameSurname) {
		sur = []
	}
	if (findShortestLongestSurname) {
		surm = [['1234567890'], ['']]
	}
	if(findNamePatronymic){
		mno=[new Map(),new Map()]
	}

	SUBREF.forEach((e, i) => {
		s += `<h3>${ls('politburo list', null, i)}</h3>`
		for (j = 0; j < 3; j++) {
			k = j == 2 ? REF + e : ('#' + (j == 0 ? 't' : 's') + i)
			a = j == 2 ? ' target="_blank"' : ''
			s += `<a href="${k}" class="ml"${a}>` + (j == 2 ? `<img src="img/wikipedia16.png">` : '') + `${ls('table', null, j)}</a>`
		}
	});
	['gr', 'sa'].forEach((e, i) => s += `<h4><a href="#${e}">${ls(i ? 'statall' : 'personal grave')}</a></h4>`)

	ag = []
	statAll = Array.from({ length: 4 }, (_, i) => [0, pm[+(i >= 2)], pm[+(i % 2)]])
	for (cc = 0; cc < 2; cc++) {
		n = Array.from({ length: 14 }, () => new Map())
		a = []
		tc = tl = 0
		gn.forEach(e => {
			grave = +(e[0] == '+')
			if (grave) {
				e = e.substring(1)
			}
			w = e.split(" ")
			m = w.length - 2
			k = w[m + cc]//accession to politburo or candidate politburo
			dj = date(k)
			i = w[m - 1].match(/\d+\.\d+.\d+/g)
			live = i.length == 1
			m -= live + 1;//m use later a.push[... w[m - 1]]
			nm = w.slice(0, m).join(' ')
			woman = w[m - 2].endsWith("а")
			db = date(i[0])
			dd = live ? new Date() : date(i[1])
			bi = monthDayToInt(db)
			di = monthDayToInt(dd)
			pCandidate = +(w[w.length - 1] != '-')
			pPolitburo = +(w[w.length - 2] != '-')
			r = w.slice(0, m - 1).reduce((a, e) => a + '_' + e, w[m - 1] + ',')
			r = `<a href="https://ru.wikipedia.org/wiki/${r}" target="_blank"><img src="img/wikipedia16.png" style="margin-bottom:-1px;"></a> ` + wrap(nm, woman)
			if (pPolitburo && pCandidate) {
				r += ' &cross;'
			}
			an = [r, w[m - 1]]

			if (cc) {//only one time
				if (grave) {
					ag.push([an, [dateToString(db), db], [dateToString(dd), dd], pm[pPolitburo], pm[pCandidate]]);
				}
				statAll[pPolitburo * 2 + pCandidate][0]++
				if (findShortestDBDifference) {
					sdb.push([w[2], dateToString(db), db, dateToString(dd), dd, pPolitburo * 2 + pCandidate])
				}
				if (findShortestLifeLengthDifference) {
					sl.push([w[2], +(dateDifferenceArray(db, dd, 1, false)[0].replace(' ', '')), pPolitburo * 2 + pCandidate, +live])
				}
				if (findSameSurname) {
					sur.push(w[m - 1])
				}
				if (findShortestLongestSurname) {
					i = w[2]
					j = i.length
					for (l = 0; l < 2; l++) {
						b = surm[l]
						if (b[0].length == j) {
							b.push(i)
						}
						else if (l && b[0].length < j || !l && b[0].length > j) {
							surm[l] = [i]
						}
					}
				}

				if(findNamePatronymic){
					for (j = 0; j < 2; j++) {
						i = mno[j].get(w[j]) || 0
						mno[j].set(w[j], i + 1)
					}
				}
			}
			if (k == '-') {
				return;
			}

			a.push([
				an
				, dateDifferenceArray(db, dd, 0, live)
				, [dateToString(db), db]//2
				, [live ? '?' : dateToString(dd), dd]//3
				, [dateToString(dj), dj]//accession to politburo 4
				, dateDifferenceArray(db, dj, 0, false)//5
				, dateDifferenceArray(db, dj, 1, false)//6
				, [dateToString(db, false), bi]//7
				, 0//set later bs
				, [live ? '?' : dateToString(dd, false), di]
				, 0//set later ds
				, dateDifferenceArray(db, dd, 1, live)
				, live
				, woman
			])

			tc++;
			if (live) {
				tl++;
			}

			for (j = 0; j < n.length; j++) {
				if (j < 2) {
					b = Math.floor((getAge(db, dd) - (j ? 5 : 0)) / 10)
				}
				else if (j < 4) {
					b = w[2][j == 2 ? 0 : w[2].length - 1].toLowerCase()
				}
				else {//>=4
					if ((j % 2) && live) {
						continue;
					}
					k = !(j % 2) ? db : dd
					b = [k.getMonth(), k.getDate(), k.getDay(), k.getFullYear() % 10, monthDayToInt(k)][Math.floor((j - 4) / 2)]
				}
				i = n[j].get(b) || 0
				n[j].set(b, i + 1)
			}
		})

		const addsort = 2;//two additional columns live and woman
		rl = a[0].length - addsort

		a.forEach(e => {
			e[bsQuantityIndex] = n[n.length - 2].get(monthDayToInt(e[dbIndex][1]))
			e[dsQuantityIndex] = e[liveIndex] ? '?' : n[n.length - 1].get(monthDayToInt(e[ddIndex][1]))
		})

		l = gl[+(gLanguage == 'russian')]
		co = []
		co[0] = [undefined, undefined, `${liveIndex}d 1`, `${liveIndex}d 1d`, `${womanIndex}d 0`, `${womanIndex}d 0d`]
		co[bsQuantityIndex] = [`${bsQuantityIndex} ${bsIndex}`, `${bsQuantityIndex}d ${bsIndex}`]
		co[dsIndex] = [`${liveIndex} ${dsIndex}`, `${liveIndex} ${dsIndex}d`]
		co[dsQuantityIndex] = [`${liveIndex} ${dsQuantityIndex} ${dsIndex}`, `${liveIndex} ${dsQuantityIndex}d ${dsIndex}`]
		i = lsi('live')
		b = l.slice(i, i + 2);
		b[1] = '<i>' + b[1] + '</i>'

		bt = l.slice(0, rl)
		if (cc) {
			bt[4] = 'вступление<br>в кандидаты' //'вступление<br>в политбюро'
		}

		s += `<h3>${ls(cc ? 'candidate list' : 'politburo list')}</h3>`
			+ `<table><tr><td><h4 id="t${cc}">${ls('table')}</h4><td>&nbsp;  &cross; - ${ls('candidate and politburo member')}.</table>`
			+ new Table(bt, a, { o: "cns11", class: 'm', additionalSortTitle: [b] }, co).html()
			+ `<h4 id="s${cc}">${ls('statistics')}</h4>` + ls('Total').replace('<br>', ' ') + ' - ' + a.length + ', ' + ls('live') + ' - ' + tl + '.'
			+ '<table class="t"><tr><td>'

		for (i = 0; i < 2; i++) {
			a = [];
			j = i ? 5 : 0;
			[...n[i].entries()].sort((a, b) => a[0] - b[0]).forEach(v =>
				a.push(vp([[(v[0] * 10 + j) + '-' + (v[0] * 10 + 9 + j), v[0]]], v[1], tc))
			)
			s += new Table(crt(ls('age'), a, tc), a, { o: "bsc", class: st }).html()
		}

		co = [undefined, ["1 0", "1d 0"]]
		for (i = 2; i < 4; i++) {
			c = []
			for (k = 'а'.charCodeAt(0); k <= 'я'.charCodeAt(0); k++) {
				j = String.fromCharCode(k)
				if (!n[i].get(j)) {
					c.push(j.toLowerCase())
				}
			}
			a = [];
			[...n[i]].forEach(e => a.push(vp([e[0]], e[1], tc)))
			s += '<td>' + new Table(crt(ls(i == 2 ? 'first' : 'last') + ' буква фамилии', a, tc), a, { o: "bsc11", class: st }, co).html()
				+ `<p style="max-width:${i == 2 ? 165 : 165}px">Отсутствующие буквы: ` + c.join(', ') + `. ${ls('Total')} - ${c.length}.</p>`;
		}

		for (i = 4; i < n.length - 2; i++) {
			a = []
			sum = tc - (i % 2 ? tl : 0)
			n[i].forEach((v, k) => {
				a.push(vp([
					[[monthToString(k), k, weekdayToString(k), k][Math.floor((i - 4) / 2)], k]]
					, v, sum))
			})

			s += ([5, 9, 11].includes(i) ? '' : '<td>') + new Table(
				crt((i > 9 ? 'последняя цифра года' : (i > 5 ? 'день' : 'месяц') + (i > 7 ? ' недели' : ''))
					+ ' ' + (i % 2 ? 'смерти' : 'рождения'), a, sum), a, { o: "bsc0", class: st }).html()
		}

		s += '</table>'
	}

	if (findShortestDBDifference) {
		//sdb.push([w[2],dateToString(db), db,dateToString(dd), dd,cc])
		const nop = ['all', 'only candidates', 'only politburo', 'only candidates&politburo']
		for (birth = 0; birth < 2; birth++) {
			for (op = 0; op < 4; op++) {
				k = birth ? 2 : 4
				if (op) {
					//console.log(sdb.length,sdb[130])
					b = sdb.filter(e => e[5] == op)
				}
				else {
					b = sdb
				}
				m = Infinity;
				b.sort((a, b) => a[k] - b[k])
				for (i = 1; i < b.length; i++) {
					j = i - 1
					l = Math.abs(b[i][k] - b[j][k])
					if (l < m) {
						m = l
						o1 = b[i]
						o2 = b[j]
					}
				}
				console.log(birth ? 'birth' : 'death', nop[op], o1[0], o1[k - 1], o2[0], o2[k - 1], (m / (1000 * 3600 * 24)).toFixed(1))
			}
		}
	}

	if (findShortestLifeLengthDifference) {
		min = 11
		sl.sort((a, b) => a[1] - b[1])
		m = []
		for (i = 0; i < sl.length - 1; i++) {
			a = sl[i]
			b = sl[i + 1]
			l = b[1] - a[1]
			if (l < min) {
				m.push([a[0] + (a[3] ? 'Live' : '') + ' ' + b[0] + (b[3] ? 'Live' : ''), l])
				//min = l
				//console.log(a[0] + (a[3] ? 'Live' : ''), b[0] + (b[3] ? 'Live' : ''), l)
			}
		}
		console.log(m.sort((a, b) => a[1] - b[1]).reduce((a,e)=>a+e.join(' ')+'\n',''))
		// for (i = 0; i < 2; i++) {
		// 	console.log(sl.filter(e => i ? e[2] % 2 : e[2] > 1).map(e => e[1]).join('\n'))
		// }
	}

	if (findSameSurname) {
		sur.sort().forEach((e, i) => {
			if (i && e == sur[i - 1]) {
				console.log(e)
			}
		})
	}

	if (findShortestLongestSurname) {
		surm.forEach(e => console.log(e[0].length + ' ' + e.join(' ')))
	}

	if(findNamePatronymic){
		for (i = 0; i < 2; i++) {
			console.log([...mno[i]].filter(e => e[1] > 1).sort((a, b) => b[1] - a[1]).reduce((a, e) => a + e[0] + ' ' + e[1] + '\n', ''))
		}
	}


	s += `<table><tr><td><h3 id="gr">${ls('personal grave')}</h3>`
		+ new Table([ls('name'), ls('birth'), ls('death'), ls('politburo member'), ls('candidate member')], ag, { o: "bscns2", class: 'gm' }).html()
		+ `<td style="vertical-align:top;padding-left:25px"><h3 id="sa">${ls('statall')}</h3>`
		+ new Table({ up: [ls('number'), ls('politburo member'), ls('candidate member'), '%'], down: [ls('Total').toLowerCase(), gn.length] }
			, statAll.map(e => vp(e, e[0], gn.length, false)), { o: "bscn", class: 'sa' }).html()
		+ '</table>'
	el('p').innerHTML = s;
	// console.log('time ' + ((new Date() - startTime) / 1000))
}

function lsi(s) {
	let j = gl[0].indexOf(s)
	if (j == -1) {
		throw new Error("not found " + s)
	}
	return j;
}

function ls(i, l, add = 0) {
	let j = i;
	if (typeof i == "string") {
		j = lsi(i)
	}
	else if (i < 0) {
		j = gl[0].length + i
	}
	return gl[typeof l == "number" ? l : +(gLanguage == 'russian')][j + add]
}

function monthToString(m) {
	let l = gLanguage == 'russian' ? 'ru-RU' : 'en-EN'
	return new Date(2022, m, 1).toLocaleDateString(l, { month: 'long' }).toLowerCase()
}

function weekdayToString(d) {
	let l = gLanguage == 'russian' ? 'ru-RU' : 'en-EN'
	return new Date(2022, 7, d).toLocaleDateString(l, { weekday: 'long' }).toLowerCase()
}

function dateToString(d, year = true) {
	let sep = " ";
	let s = d.getDate() + sep + monthToString(d.getMonth()).substring(0, 3);
	if (year) {
		s += sep + d.getFullYear()
	}
	return s;
}

function date(s) {
	return new Date(s.split(".").reverse().join('-'))
}

function monthDayToInt(e) {
	return e.getDate() + e.getMonth() * monthMultilier
}

function dateDifferenceArray(db, dd, days, live) {
	let v = formatNumber(days ? (dd - db) / (1000 * 3600 * 24) : getAge(db, dd), 0)
	return [wrap(v, live * 2), dd - db]
}

function wrap(s, b) {
	if (!b) {
		return s;
	}
	return (b == 1 ? '<i>' : '<span class="live">') + s + (b == 1 ? '</i>' : '</span>')
}

function getAge(db, dd) {
	return dd.getFullYear() - db.getFullYear() - (monthDayToInt(dd) <= monthDayToInt(db))
}

function vp(a, v, sum, b = true) {
	if (b) {
		a.push(v)
	}
	a.push([formatNumber((100 * v / sum), 1), v])
	// a.push([(100 * v / sum).toFixed(1), v])
	return a
}

function crt(s, a, sum) {
	return {
		up: [s.replaceAll(' ', '<br>'), ls('number'), '%'], down: [ls('Total').toLowerCase() + ' ' + a.length, sum]
	}
}

// function CD(s) {
// 	return s.slice(0, 1).toUpperCase() + s.slice(1) + '.'
// }
/*
https://ru.wikipedia.org/wiki/Состав_Президиума/Политбюро_ЦК_КПСС
https://ru.wikipedia.org/wiki/Политбюро_ЦК_КПСС
*/
gn = [
	"Андрей Сергеевич Бубнов 3.4.1884-1.8.1938 10.10.1917 -",
	"Григорий Евсеевич Зиновьев 23.9.1883-25.8.1936 10.10.1917 25.3.1919",
	"Лев Борисович Каменев 18.7.1883-25.8.1936 10.10.1917 1.1.1926",
	"Владимир Ильич Ленин 22.4.1870-21.1.1924 10.10.1917 -",
	"Григорий Яковлевич Сокольников 15.8.1888-21.5.1939 10.10.1917 2.6.1924",
	"Лев Давидович Троцкий 7.11.1879-21.8.1940 10.10.1917 -",
	"+Яков Михайлович Свердлов 4.6.1885-16.3.1919 29.11.1917 -",
	"Елена Дмитриевна Стасова 15.10.1873-31.12.1966 11.3.1919 13.4.1919",
	"Николай Николаевич Крестинский 25.10.1883-15.3.1938 25.3.1919 -",
	"+Иосиф Виссарионович Сталин 21.12.1879-5.3.1953 10.10.1917 -",
	"Алексей Иванович Рыков 25.2.1881-15.3.1938 3.4.1922 -",
	"Михаил Павлович Томский 31.10.1880-22.8.1936 3.4.1922 -",
	"Николай Иванович Бухарин 9.10.1888-15.3.1938 2.6.1924 25.3.1919",
	"+Климент Ефремович Ворошилов 4.2.1881-2.12.1969 1.1.1926 -",
	"+Михаил Иванович Калинин 19.11.1875-3.6.1946 1.1.1926 25.3.1919",
	"Вячеслав Михайлович Молотов 9.3.1890-8.11.1986 1.1.1926 16.3.1921",
	"Ян Эрнестович Рудзутак 15.8.1887-29.7.1938 23.7.1926 26.4.1923",
	"Валериан Владимирович Куйбышев 6.6.1888-25.1.1935 19.12.1927 -",
	"Лазарь Моисеевич Каганович 22.11.1893-25.7.1991 13.7.1930 23.7.1926",
	"Сергей Миронович Киров 27.3.1886-1.12.1934 13.7.1930 23.7.1926",
	"Станислав Викентьевич Косиор 18.11.1889-26.2.1939 13.7.1930 19.12.1927",
	"Григорий Константинович Орджоникидзе 24.10.1886-18.2.1937 21.12.1930 23.7.1926",
	"Андрей Андреевич Андреев 30.10.1895-5.12.1971 4.2.1932 23.7.1926",
	"Анастас Иванович Микоян 25.11.1895-21.10.1978 1.2.1935 23.7.1926",
	"Влас Яковлевич Чубарь 22.2.1891-26.2.1939 1.2.1935 3.11.1926",
	"+Андрей Александрович Жданов 26.2.1896-31.8.1948 22.3.1939 1.2.1935",
	"Никита Сергеевич Хрущёв 15.4.1894-11.9.1971 22.3.1939 18.1.1938",
	"Лаврентий Павлович Берия 29.3.1899-23.12.1953 18.3.1946 22.3.1939",
	"Георгий Максимилианович Маленков 8.1.1902-14.1.1988 18.3.1946 21.2.1941",
	"Николай Алексеевич Вознесенский 1.12.1903-1.10.1950 26.2.1947 21.2.1941",
	"Николай Александрович Булганин 11.6.1895-24.2.1975 18.2.1948 18.3.1946",
	"Алексей Николаевич Косыгин 21.2.1904-18.12.1980 4.9.1948 18.3.1946",
	"Василий Михайлович Андрианов 21.3.1902-3.10.1978 16.10.1952 -",
	"Аверкий Борисович Аристов 4.11.1903-11.7.1973 16.10.1952 -",
	"Семён Денисович Игнатьев 14.9.1904-27.11.1983 16.10.1952 -",
	"Демьян Сергеевич Коротченко 29.11.1894-7.4.1969 16.10.1952 29.6.1957",
	"Василий Васильевич Кузнецов 13.2.1901-5.6.1990 16.10.1952 3.10.1977",
	"Отто Вильгельмович Куусинен 4.10.1881-17.5.1964 16.10.1952 -",
	"Вячеслав Александрович Малышев 16.12.1902-20.2.1957 16.10.1952 -",
	"Леонид Георгиевич Мельников 31.5.1906-16.4.1981 16.10.1952 5.3.1953",
	"Николай Александрович Михайлов 10.10.1906-25.5.1982 16.10.1952 -",
	"Михаил Георгиевич Первухин 14.10.1904-22.7.1978 16.10.1952 29.6.1957",
	"Пантелеймон Кондратьевич Пономаренко 9.8.1902-18.1.1984 16.10.1952 5.3.1953",
	"Максим Захарович Сабуров 19.2.1900-24.3.1977 16.10.1952 -",
	"+Михаил Андреевич Суслов 21.11.1902-25.1.1982 16.10.1952 -",
	"Дмитрий Иванович Чесноков 7.11.1910-15.9.1973 16.10.1952 -",
	"Николай Михайлович Шверник 19.5.1888-24.12.1970 16.10.1952 22.3.1939",
	"Матвей Фёдорович Шкирятов 15.8.1883-18.1.1954 16.10.1952 -",
	"Алексей Илларионович Кириченко 25.2.1908-28.12.1975 12.7.1955 6.6.1953",
	"Николай Ильич Беляев 13.2.1903-28.10.1966 29.6.1957 -",
	"+Леонид Ильич Брежнев 19.12.1906-10.11.1982 29.6.1957 16.10.1952",
	"Георгий Константинович Жуков 1.12.1896-18.6.1974 29.6.1957 27.2.1956",
	"Николай Григорьевич Игнатов 16.5.1901-14.11.1966 29.6.1957 16.10.1952",
	"Фрол Романович Козлов 18.8.1908-30.1.1965 29.6.1957 14.2.1957",
	"Екатерина Алексеевна Фурцева 7.12.1910-24.10.1974 29.6.1957 27.2.1956",
	"Нуритдин Акрамович Мухитдинов 19.11.1917-27.8.2008 17.12.1957 27.2.1956",
	"Николай Викторович Подгорный 18.2.1906-11.1.1983 4.5.1960 18.6.1958",
	"Дмитрий Степанович Полянский 7.11.1917-8.10.2001 4.5.1960 18.6.1958",
	"Геннадий Иванович Воронов 31.8.1910-1.4.1994 31.10.1961 18.1.1961",
	"Андрей Павлович Кириленко 8.9.1906-12.5.1990 23.4.1962 29.6.1957",
	"Александр Николаевич Шелепин 18.8.1918-24.10.1994 16.11.1964 -",
	"Пётр Ефимович Шелест 14.2.1908-22.1.1996 16.11.1964 13.12.1963",
	"Кирилл Трофимович Мазуров 5.4.1914-19.12.1989 26.3.1965 29.6.1957",
	"Арвид Янович Пельше 7.2.1899-29.5.1983 8.4.1966 -",
	"Виктор Васильевич Гришин 18.9.1914-25.5.1992 9.4.1971 18.1.1961",
	"Фёдор Давыдович Кулаков 4.2.1918-17.7.1978 9.4.1971 -",
	"Динмухамед Ахмедович Кунаев 12.1.1912-22.8.1993 9.4.1971 8.4.1966",
	"Владимир Васильевич Щербицкий 17.2.1918-16.2.1990 9.4.1971 31.10.1961",
	"+Юрий Владимирович Андропов 15.6.1914-9.2.1984 27.4.1973 21.6.1967",
	"Андрей Антонович Гречко 17.10.1903-26.4.1976 27.4.1973 -",
	"Андрей Андреевич Громыко 18.7.1909-2.7.1989 27.4.1973 -",
	"Григорий Васильевич Романов 7.2.1923-3.6.2008 5.3.1976 27.4.1973",
	"Дмитрий Фёдорович Устинов 30.10.1908-20.12.1984 5.3.1976 26.3.1965",
	"+Константин Устинович Черненко 24.9.1911-10.3.1985 27.11.1978 3.10.1977",
	"Николай Александрович Тихонов 14.5.1905-1.6.1997 27.11.1979 27.11.1978",
	"Михаил Сергеевич Горбачёв 2.3.1931-30.8.2022 21.10.1980 27.11.1979",
	"Гейдар Алиевич Алиев 10.5.1923-12.12.2003 22.11.1982 5.3.1976",
	"Виталий Иванович Воротников 20.1.1926-19.2.2012 26.12.1983 15.6.1983",
	"Михаил Сергеевич Соломенцев 7.11.1913-15.2.2008 26.12.1983 23.11.1971",
	"Егор Кузьмич Лигачёв 29.11.1920-7.5.2021 23.4.1985 -",
	"Николай Иванович Рыжков 28.9.1929-28.2.2024 23.4.1985 -",
	"Виктор Михайлович Чебриков 27.4.1923-1.7.1999 23.4.1985 26.12.1983",
	"Эдуард Амвросиевич Шеварднадзе 25.1.1928-7.7.2014 1.7.1985 27.11.1978",
	"Лев Николаевич Зайков 3.4.1923-7.1.2002 6.3.1986 -",
	"Виктор Петрович Никонов 28.2.1929-17.9.1993 26.6.1987 -",
	"Николай Никитович Слюньков 26.4.1929-9.8.2022 26.6.1987 6.3.1986",
	"Александр Николаевич Яковлев 2.12.1923-18.10.2005 26.6.1987 28.1.1987",
	"Вадим Андреевич Медведев 29.3.1929-11.7.2025 30.9.1988 -",
	"Владимир Александрович Крючков 29.2.1924-23.11.2007 20.9.1989 -",
	"Юрий Дмитриевич Маслюков 30.9.1937-1.4.2010 20.9.1989 18.2.1988",
	"Владимир Антонович Ивашко 28.10.1932-13.11.1994 9.12.1989 -",
	"Миколас Мартинович Бурокявичюс 7.10.1927-20.1.2016 14.7.1990 -",
	"Гиви Григорьевич Гумбаридзе род. 22.3.1945 14.7.1990 -",
	"Станислав Иванович Гуренко 30.5.1936-14.4.2013 14.7.1990 -",
	"Александр Сергеевич Дзасохов род. 3.4.1934 14.7.1990 -",
	"Ислам Абдуганиевич Каримов 30.1.1938-2.9.2016 14.7.1990 -",
	"Пётр Кириллович Лучинский род. 27.1.1940 14.7.1990 -",
	"Абсамат Масалиевич Масалиев 10.4.1933-31.7.2004 14.7.1990 -",
	"Кахар Махкамович Махкамов 16.4.1932-8.6.2016 14.7.1990 -",
	"Владимир Мигранович Мовсесян 12.11.1933-5.11.2014 14.7.1990 -",
	"Аяз Ниязович Муталибов 12.5.1938-27.3.2022 14.7.1990 -",
	"Нурсултан Абишевич Назарбаев род. 6.7.1940 14.7.1990 -",
	"Сапармурат Атаевич Ниязов 19.2.1940-21.12.2006 14.7.1990 -",
	"Иван Кузьмич Полозков род. 16.2.1935 14.7.1990 -",
	"Юрий Анатольевич Прокофьев род. 20.2.1939 14.7.1990 -",
	"Альфред Петрович Рубикс род. 24.9.1935 14.7.1990 -",
	"Галина Владимировна Семёнова 24.8.1937-19.11.2017 14.7.1990 -",
	"Энн-Арно Аугустович Силлари род. 4.3.1944 14.7.1990 -",
	"Ефрем Евсеевич Соколов 25.4.1926-3.4.2022 14.7.1990 -",
	"Егор Семёнович Строев род. 25.2.1937 14.7.1990 -",
	"Иван Тимофеевич Фролов 1.9.1929-18.11.1999 14.7.1990 -",
	"Олег Семёнович Шенин 22.7.1937-28.5.2009 14.7.1990 -",
	"Геннадий Иванович Янаев 26.8.1937-24.9.2010 14.7.1990 -",
	"Анатолий Александрович Малофеев 14.5.1933-19.1.2022 11.12.1990 -",
	"Степан Карапетович Погосян 1.1.1932-17.5.2012 11.12.1990 -",
	"Лембит Эльмарович Аннус 17.9.1941-4.7.2018 31.1.1991 -",
	"Джумгалбек Бексултанович Аманбаев 2.2.1946-11.2.2005 25.4.1991 -",
	"Григорий Исидорович Еремей 22.4.1935-3.1.2025 25.4.1991 -",//нет даты умер только похоронен
	"Михаил Семёнович Сурков род. 2.12.1945 25.4.1991 -",

	"+Феликс Эдмундович Дзержинский 11.9.1877-20.7.1926 - 2.6.1924",
	"+Михаил Васильевич Фрунзе 2.2.1885-31.10.1925 - 2.6.1924",
	"Григорий Иванович Петровский 4.2.1878-9.1.1958 - 1.1.1926",
	"Николай Александрович Угланов 17.12.1886-31.5.1937 - 1.1.1926",
	"Карл Янович Бауман 29.8.1892-14.10.1937 - 29.4.1929",
	"Сергей Иванович Сырцов 17.7.1893-10.9.1937 - 29.4.1929",
	"Павел Петрович Постышев 18.9.1887-26.2.1939 - 10.2.1934",
	"Роберт Индрикович Эйхе 12.8.1890-4.2.1940 - 1.2.1935",
	"Николай Иванович Ежов 1.5.1895-4.2.1940 - 12.10.1937",
	"Александр Сергеевич Щербаков 10.10.1901-10.5.1945 - 21.2.1941",
	"Андрей Януарьевич Вышинский 10.12.1883-22.11.1954 - 16.10.1952",
	"Арсений Григорьевич Зверев 2.3.1900-27.7.1969 - 16.10.1952",
	"Иван Григорьевич Кабанов 3.2.1898-2.7.1972 - 16.10.1952",
	"Николай Семёнович Патоличев 23.9.1908-1.12.1989 - 16.10.1952",
	"Николай Михайлович Пегов 3.4.1905-19.4.1991 - 16.10.1952",
	"Александр Михайлович Пузанов 25.10.1906-1.3.1998 - 16.10.1952",
	"Иван Фёдорович Тевосян 4.1.1902-30.3.1958 - 16.10.1952",
	"Павел Фёдорович Юдин 7.9.1899-10.4.1968 - 16.10.1952",
	"Мир Джафар Аббасович Багиров 17.9.1895-26.5.1956 - 5.3.1953",
	"Дмитрий Трофимович Шепилов 5.11.1905-18.8.1995 - 27.2.1956",
	"Ян Эдуардович Калнберзинь 17.9.1893-4.2.1986 - 29.6.1957",
	"Василий Павлович Мжаванадзе 20.9.1902-31.8.1988 - 29.6.1957",
	"Пётр Николаевич Поспелов 20.6.1898-22.4.1979 - 29.6.1957",
	"Шараф Рашидович Рашидов 6.11.1917-31.10.1983 - 31.10.1961",
	"Леонид Николаевич Ефремов 7.6.1912-24.6.2007 - 23.11.1962",
	"Пётр Нилович Демичев 3.1.1908-10.8.1996 - 16.11.1964",
	"Пётр Миронович Машеров 13.2.1918-4.10.1980 - 8.4.1966",
	"Борис Николаевич Пономарёв 17.1.1905-21.12.1995 - 19.5.1972",
	"Тихон Яковлевич Киселёв 12.8.1917-11.1.1983 - 21.10.1980",
	"Владимир Иванович Долгих 5.12.1924-8.10.2020 - 24.5.1982",
	"Сергей Леонидович Соколов 1.7.1911-31.8.2012 - 23.4.1985",
	"Николай Владимирович Талызин 28.1.1929-23.1.1991 - 15.10.1985",
	"Борис Николаевич Ельцин 1.2.1931-23.4.2007 - 18.2.1986",
	"Юрий Филиппович Соловьёв 20.8.1925-2.10.2011 - 6.3.1986",
	"Дмитрий Тимофеевич Язов 8.11.1924-25.2.2020 - 26.6.1987",
	"Георгий Петрович Разумовский род. 19.1.1936 - 18.2.1988",
	"Александра Павловна Бирюкова 25.2.1929-20.2.2008 - 30.9.1988",
	"Александр Владимирович Власов 20.1.1932-9.6.2002 - 30.9.1988",
	"Анатолий Иванович Лукьянов 7.5.1930-9.1.2019 - 30.9.1988",
	"Евгений Максимович Примаков 29.10.1929-26.6.2015 - 20.9.1988",
	"Борис Карлович Пуго 19.2.1937-22.8.1991 - 20.9.1988",

	"+Семён Михайлович Будённый 25.4.1883-26.10.1973 - -"
]