calorieByDay = [1155.59, 1911.08, 1225.33, 1185.9, 2250.42, 1737.78, 1543.95, 1035.11, 937.99, 2199.77, 1725.54, 3945.62, 1163.01, 1559.94, 2524.18, 1644.05, 1443.01, 1467.65, 638.22, 1687.42, 1513.6, 2330.32, 4996.23, 2499.57, 3017.58, 2682.47, 3181.05, 2542.88, 3374.16, 2963.28, 3428.71, 5088.09, 2701.63, 2047.72, 1595.05, 1079.58, 1334.33, 2825.13, 2254.22, 1120.89, 1124.86, 1266.1, 1071, 930.1, 2150.2, 1209.37, 1304.79, 1603.02, 1603.07, 1074.05, 1097.18, 1490.17, 979.09, 1338.57, 863.77, 1013.12, 1282.86, 1163.84, 1465.92, 1480.38, 1500.46, 1394.94, 737.59, 1041.71, 716.88, 3497.7, 1386.11, 2880.95, 3422.81, 755.3, 1039.52, 648.71, 1053.22, 1367.36, 1091.35, 1032.62, 1250.42, 1246.53, 1117.09, 1457.2, 1237.03, 1306.18, 1358.17, 1078.96, 1128.06, 1457.55, 1475.85, 1210.39, 1454.06, 1109.63, 1168.11, 1601.62, 1500.06, 1348.22, 1342.3, 1376.87, 1515.04, 1412.81, 1546.51, 1661.9, 1620.76, 1210.08, 1570.3, 3937.82, 1036.1, 1191.45, 1200.29, 1266.33, 1243.97, 2975.51, 4259.94, 1467.97, 2410.1, 2027.24, 1325.95, 1427.37, 4160.88, 1661.53, 2105.88, 1241.01, 1584.73, 1791.83, 1484.88, 1584.74, 2420.56, 4024.11, 1535.41, 2093.29, 1862.06, 1427.47, 1909.45, 1925.19, 1798.61, 1701.2, 1360.59, 1194.27, 1377.44, 1490.71, 3075.89, 1318.59, 1796.93, 2839.93, 1560.24, 3516.73, 2785.1, 1524.99, 2548.85, 1804.54, 1004.27, 1291.27, 1418.1, 1295.32, 2578.05]
eatenByDay = [2119, 2171, 2473, 2452, 2748, 3004.6, 2403.9, 2139.17, 2221.83, 2746, 2539.5, 3079, 2269, 3384, 3036, 2589.49, 3014.07, 2856, 1129.67, 3624.5, 3798.67, 2932.35, 4022, 4674, 4991, 2958, 2634, 3289, 2960, 1791, 4525, 7386, 4635, 2821, 1514, 1468, 1371, 5032, 3589, 2094, 2149, 2424, 1275, 1767, 3009, 2300, 2469, 1904, 1716, 1544, 1585, 3995, 2745, 3183, 1436, 1984, 1931, 1905, 2195, 2885, 3424, 3118, 1242, 1686, 1226, 3379.78, 1767, 3343, 3466, 2075.75, 2312.54, 1285.71, 1582, 1641, 1285, 1353, 1450, 1647, 1342, 2592, 3698, 2707, 2149, 1293.81, 1374, 1978, 2658.46, 2123.08, 2118.09, 2289, 1574.46, 2518.96, 1668.91, 2036, 1691, 1772, 1986, 2059, 1323, 4737, 4706, 3572, 1565.57, 3087.79, 1684.79, 1603.57, 1717.57, 1969.57, 1987.76, 2152.61, 3234.22, 2382, 3125, 2644.4, 1978.4, 2407, 3668, 1978, 2252, 3671, 3548.2, 3980, 3202.8, 2425, 3392, 3572, 2312.6, 2769, 2593, 2007, 2776, 2502.33, 2627.33, 2162.33, 2182.6, 2248, 2563.1, 2567.4, 3948, 1759.1, 2389.2, 4231.24, 2627.74, 3493.64, 2257.85, 2984.87, 3968.51, 2785.07, 1734.28, 2127.69, 1941.68, 1682.48, 2049.1]
carbohydrateByDay = [247.65, 293.45, 195.24, 189.57, 352.73, 350.81, 101.47, 132.93, 149.12, 333.43, 266.53, 459.02, 199.75, 274.22, 444.02, 236.04, 257.29, 233.92, 98.27, 278.52, 282.43, 377, 222.54, 400.4, 331.28, 263.21, 405, 316.43, 415.71, 401.84, 521.29, 984.95, 375.75, 390.33, 283.44, 224.51, 276.35, 502.87, 309.71, 236.76, 237.36, 261.72, 230.78, 191.96, 423.45, 260.26, 278.42, 345.98, 330.84, 229.99, 234.9, 334.22, 200.08, 275.95, 182.05, 211.85, 258.16, 242.22, 295.13, 292.05, 247.89, 277.33, 159.24, 220.82, 139.82, 309.06, 220.09, 395.57, 573.49, 151.54, 213.8, 129.38, 199.82, 255.17, 222.01, 199.9, 250.44, 244.14, 225.39, 222.69, 203.89, 212.25, 272.61, 208.41, 215.87, 208.47, 298.22, 239.34, 267.93, 223.19, 159.21, 320.96, 138.62, 303.7, 199.81, 242.79, 286.81, 251.31, 146.52, 362.88, 345.49, 262.21, 162.06, 379.69, 206.47, 225.46, 225.02, 238.51, 217.37, 190.38, 214.01, 172.76, 315.36, 334.69, 168.72, 269.35, 321.35, 156.66, 185.18, 207.7, 230.36, 238.14, 237.27, 292.43, 337.97, 363.35, 240.08, 237.35, 316.19, 237.09, 345.03, 268.26, 234.51, 194.89, 167.02, 130.2, 159.35, 206.22, 320.04, 121.6, 197.07, 405.4, 228.24, 242.81, 161.4, 197.71, 400.67, 194.64, 133.97, 150.92, 135.04, 122.45, 175.83]
bdsMassCalorie = [[[621, 241.14], [1038, 686.82], [460, 227.63]], [[881.33, 759.16], [599.83, 496.76], [689.83, 655.16]], [[748, 428.08], [803, 360.01], [922, 437.23]], [[779, 383.43], [689, 307.75], [984, 494.72]], [[796, 535.85], [504, 390.72], [1448, 1323.85]], [[1070, 383.94], [877.8, 648.07], [1056.8, 705.77]], [[690.3, 552.48], [812.3, 508.97], [901.3, 482.5]], [[587.5, 219.16], [718.33, 382.1], [833.33, 433.84]], [[1094.33, 464.02], [758.25, 197.26], [369.25, 276.7]], [[965, 877.45], [1029, 717.49], [752, 604.83]], [[977.25, 373.56], [473.25, 173.81], [1089, 1178.18]], [[1111, 1127.74], [1174, 2040.78], [794, 777.1]], [[828, 664.48], [747, 268.93], [694, 229.59]], [[1310.5, 469.69], [996.5, 433.35], [1077, 656.9]], [[810, 343.88], [1272, 712.61], [954, 1467.69]], [[716.56, 539.7], [949.42, 705.65], [923.51, 398.7]], [[1026.56, 452.01], [823.94, 417.65], [1163.57, 573.35]], [[578, 369.53], [870, 467.84], [1408, 630.29]], [[444, 221.07], [342.83, 208.57], [342.83, 208.57]], [[462.83, 236.77], [2206.83, 702.53], [954.83, 748.11]], [[592.83, 353.82], [1898.34, 503.06], [1307.5, 656.72]], [[777.5, 357.15], [1078.85, 553.05], [1076, 1420.11]], [[1590.5, 1517.3], [1614.5, 1244.78], [817, 2234.14]], [[1467, 388.75], [1467, 388.75], [1740, 1722.06]], [[2202.5, 867.76], [1637.5, 433.94], [1151, 1715.88]], [[829, 232.38], [1039, 491.84], [1090, 1958.25]], [[1018, 389.69], [1098, 2177.59], [518, 613.76]], [[1432.67, 1324.71], [751.67, 282.74], [1104.67, 935.43]], [[1028.67, 867.06], [1130.67, 1510.82], [800.67, 996.29]], [[659.67, 844.58], [707.67, 1547.04], [423.67, 571.66]], [[1641, 1756.18], [1435, 679.03], [1449, 993.49]], [[2482, 2141.73], [2575, 968.95], [2329, 1977.42]], [[1754, 774.54], [1323, 961.82], [1558, 965.27]], [[1032, 711.45], [1254, 782.03], [535, 554.25]], [[495, 504.34], [515, 511.45], [504, 579.26]], [[455, 246.43], [507, 418.23], [506, 414.92]], [[396.67, 245.45], [456.67, 443.68], [517.67, 645.21]], [[1665.33, 949.5], [1239.33, 770.8], [2127.33, 1104.83]], [[1144.67, 582.53], [1203.67, 874.27], [1240.67, 797.42]], [[698, 373.63], [698, 373.63], [698, 373.63]], [[723.67, 378.41], [712.67, 373.22], [712.67, 373.22]], [[808, 422.03], [808, 422.03], [808, 422.03]], [[425, 357], [425, 357], [425, 357]], [[589, 310.03], [589, 310.03], [589, 310.03]], [[1113, 769.77], [907, 621.8], [989, 758.63]], [[648, 291.39], [835, 450.22], [817, 467.76]], [[646, 216.9], [460, 240.12], [1363, 847.77]], [[310, 251.33], [1003.5, 835.69], [590.5, 516.01]], [[287, 271.22], [1001, 956.37], [428, 375.48]], [[603.33, 395.35], [603.33, 395.35], [337.33, 283.36]], [[469, 197.45], [603, 468.81], [513, 430.92]], [[1308, 400.2], [1683, 445.99], [1004, 643.98]], [[818, 251.54], [851, 283.76], [1076, 443.79]], [[1068, 402.32], [1371, 682.17], [744, 254.08]], [[686.67, 348.49], [0, 0], [749.33, 515.28]], [[343.33, 174.24], [571.33, 365.76], [1069.33, 473.11]], [[505.33, 375.83], [701.33, 453.35], [724.33, 453.67]], [[710.33, 457.56], [703.33, 451.68], [491.33, 254.6]], [[670, 644.46], [1153, 713.97], [372, 107.48]], [[661, 328.52], [794, 618.46], [1430, 533.41]], [[526, 397.17], [902, 493.92], [1996, 609.37]], [[567, 361.49], [1840, 790.91], [711, 242.53]], [[311, 163.75], [300, 167.42], [631, 406.42]], [[490.67, 287.32], [490.67, 287.32], [704.67, 467.08]], [[411, 178.76], [815, 538.12], [0, 0]], [[1748.78, 1724.87], [1129, 1301.73], [502, 471.1]], [[311, 280.62], [468, 316.7], [988, 788.79]], [[1286, 1208.16], [1201, 904.64], [856, 768.15]], [[1639, 1065.24], [509, 456.77], [1318, 1900.8]], [[664, 358.1], [1008.5, 288.9], [403.25, 108.29]], [[763.25, 237.17], [658.14, 303.31], [891.14, 499.03]], [[0, 0], [345.24, 165.24], [940.48, 483.47]], [[432, 384.27], [689, 392.32], [461, 276.63]], [[474, 224.08], [615, 385.31], [552, 757.97]], [[226, 189.84], [584, 339.5], [475, 562.01]], [[0, 0], [959, 611.29], [394, 421.34]], [[357, 257.35], [1025, 768.41], [68, 224.66]], [[476, 291.73], [761, 642.08], [410, 312.72]], [[300, 226.91], [745, 671.14], [297, 219.05]], [[773, 448.55], [703, 462.38], [1116, 546.26]], [[884, 493.26], [1533, 404.31], [1281, 339.46]], [[685, 387.85], [1540, 494.85], [482, 423.47]], [[951, 549.92], [607, 316.75], [591, 491.51]], [[401, 263.13], [477, 350.47], [415.81, 465.36]], [[370, 245.97], [600, 412.18], [404, 469.92]], [[754, 774.98], [1224, 682.58], [0, 0]], [[1313, 720.6], [870, 410.32], [475.46, 344.92]], [[305, 73.48], [841.08, 439.33], [977, 697.58]], [[1219.46, 694.95], [512, 264.48], [386.63, 494.62]], [[325, 90.44], [1311, 742.06], [653, 277.13]], [[20, 114.5], [1055.46, 766.39], [499, 287.22]], [[477, 284.12], [1122.96, 832.96], [919, 484.54]], [[1102.31, 1127.46], [566.6, 372.6], [0, 0]], [[593, 458.98], [772, 388.43], [671, 500.81]], [[686, 615.52], [806, 688.54], [199, 38.25]], [[474, 490.95], [1072, 809.76], [226, 76.16]], [[1078, 803.69], [674, 490.22], [234, 221.13]], [[541, 266.83], [1287, 927.68], [231, 218.3]], [[301, 946.23], [756, 348.91], [266, 251.37]], [[1326, 606.87], [2793, 740.14], [618, 314.89]], [[1366, 397.07], [2617, 848.06], [723, 375.62]], [[1662, 440.43], [1490, 554.94], [420, 214.71]], [[1261.57, 1029.59], [304, 540.71], [0, 0]], [[1443.79, 2909.49], [1644, 1028.33], [0, 0]], [[777, 418.31], [907.79, 617.79], [0, 0]], [[647.79, 501.36], [753.79, 545.86], [202, 144.23]], [[634.79, 446.15], [745.79, 551.6], [337, 202.54]], [[913.79, 630.59], [1055.79, 635.74], [0, 0]], [[1222.38, 768.84], [765.38, 475.14], [0, 0]], [[1273.38, 1590.42], [879.23, 1385.1], [0, 0]], [[1790.22, 3029.26], [850, 1022.78], [594, 207.9]], [[1371.5, 1147.55], [1010.5, 320.42], [0, 0]], [[1683, 1650.76], [475, 212.35], [967, 546.99]], [[1425.4, 1168.58], [1219, 858.66], [0, 0]], [[964, 468.36], [1014.4, 857.59], [0, 0]], [[2407, 1427.37], [0, 0], [0, 0]], [[2105, 2628.26], [1563, 1532.62], [0, 0]], [[1392, 1340.86], [586, 320.67], [0, 0]], [[1641, 1891.05], [267, 55.13], [344, 159.71]], [[3671, 1241.01], [0, 0], [0, 0]], [[2530.2, 1171.23], [1018, 413.5], [0, 0]], [[2662, 1442.56], [1318, 349.27], [0, 0]], [[1177.5, 312.04], [2025.3, 1172.84], [0, 0]], [[1441, 913.72], [984, 671.02], [0, 0]], [[616, 297.6], [1600, 1461.52], [1176, 661.44]], [[2058, 3087.26], [792, 505.43], [722, 431.43]], [[490, 265.97], [1292, 879.1], [530.6, 390.35]], [[483, 243.13], [1143, 1411.9], [1143, 438.26]], [[241, 248.71], [1178, 839.68], [1174, 773.67]], [[804, 776.15], [342, 135.94], [861, 515.38]], [[525, 285.17], [1334, 1006], [917, 618.27]], [[673, 594.32], [883.33, 771.42], [946, 559.45]], [[1000.45, 772.48], [713.88, 494.99], [913, 531.14]], [[526.17, 652.74], [688.17, 529.72], [948, 518.75]], [[616.2, 349.97], [726.2, 375.98], [840.2, 634.65]], [[719.2, 424.73], [727.4, 383.05], [801.4, 386.48]], [[733.4, 432.46], [776.4, 446.39], [1053.3, 498.6]], [[761.4, 359.15], [718, 395.81], [1088, 735.75]], [[873, 528.95], [898, 509.96], [2177, 2036.98]], [[0, 0], [948, 845.78], [811.1, 472.81]], [[548, 479.94], [468, 478.34], [1373.2, 838.65]], [[845, 529.92], [754, 428.65], [2632.24, 1881.36]], [[794.74, 673.53], [666, 279.96], [1167, 606.75]], [[750.99, 605.06], [798.14, 485.63], [1944.51, 2426.04]], [[110.42, 173.47], [770.33, 433.03], [1377.1, 2178.6]], [[1013.33, 493.69], [856.1, 451.09], [1115.44, 580.22]], [[540.61, 393.03], [1181.28, 1006.94], [2246.62, 1148.88]], [[136, 493.68], [582.95, 398.48], [2066.12, 912.38]], [[427, 298.84], [648.28, 410.21], [659, 295.22]], [[472.79, 339.69], [773.45, 425.23], [881.45, 526.35]], [[392.42, 623.7], [647, 223.96], [902.25, 570.45]], [[916.45, 793.44], [582, 229.93], [184.03, 271.96]], [[691.93, 522.17], [457.17, 1097.85], [900, 958.03]]]

gp = [
	`#1авг масса 64.9
картофель 131
кабачки 132
огурцы 172
лук 82-11
мандарин 146-31
&завтрак
слива 661-(1272-900)
абрикос 237-129
персик 620-49
сухари чёрные 42+28
&обед
картофель 187
кабачки 246
лук 27
&ужин`

	, `#2авг масса 64.8
лук 70-44
петрушка 103-94
картофель 156
грибы 129
яйцо 336-129-156
пицца 130/3 бжу 10.4 12.3 26.8 животный белок/жир .5 .5 b12 0.293
бананы 212-66
хлеб белый 20+15
колбаса 36 бжу 11 13 0 животный белок/жир 1 1 b12 0.5
слива 798-681
абрикос 816-734
персик 759-708
&завтрак
пицца 130/3 бжу 10.4 12.3 26.8 животный белок/жир .5 .5 b12 0.293
хлеб белый 20
ветчина 71/2 бжу 22.6 20.9 0 животный белок/жир 1 1 b12 0.4
петрушка 94-46
персик 125-8
груша 184
слива 634-482
&обед
картофель 177
грибы 126
лук 43-3
пицца 130/3 бжу 10.4 12.3 26.8 животный белок/жир .5 .5 b12 0.293
ветчина 71/2 бжу 22.6 20.9 0 животный белок/жир 1 1 b12 0.4
хлеб белый 33
бананы 175-58
персик 607-489
&ужин`

	, `#3авг масса 65.1
грибы 196
картофель 193
яйцо 51
лук 72-32
яблоко 285-178
груша 164-3
&завтрак
грибы 90
картофель 106
яйцо 54
лук 32
огурец 272-74
помидор 70
петрушка 42-22
перец болгарский 85-28
яблоко 176
&обед
грибы 93
картофель 109
яйцо 51
лук 31+86-62
помидор 793-721
огурец 74
перец болгарский 28
петрушка 22-7
яблоко 127-9+125-2
апельсин 240-56
&ужин`

	, `#4авг масса 65
грибы 75
картофель 110
яйцо 43
баклажан 137
лук 62-19
петрушка 100-50
яблоко 848-715
апельсин 947-759
&завтрак
грибы 64
картофель 109
яйцо 54
баклажан 109
огурцы 996-841
помидоры 580-481 
лук 19+(118-67)
петрушка 50-21
&обед
грибы 70
картофель 101
яйцо 43-0
баклажан 145
лук 67+108-77
огурцы 214
помидоры 133
перец болгарский 91
петрушка 21-5+102-69
сухари чёрные 40
&ужин`
	, `#5авг масса 64.7
грибы 211/3
салат оливье 500/3 бжу 5.4 10.9 6.5 животный белок/жир .756 .603 b12 0.19 клетчатка 1.28
персики 1129-570 
&завтрак
грибы 211/3
салат оливье 500/3 бжу 5.4 10.9 6.5 животный белок/жир .756 .603 b12 0.19 клетчатка 1.28
персики 335-68
&обед
грибы 211/3
салат оливье 500/3 бжу 5.4 10.9 6.5 животный белок/жир .756 .603 b12 0.19 клетчатка 1.28
абрикосы 62-10
груша 217-4
огурцы 181
помидор 106-4
лук 71-16
петрушка 55-16
груша 355
хлеб чёрный 55
сухари белые 159
&ужин`
	, `#6авг масса 65
огурец 462-294+184
петрушка15-7
укроп зелень31-4+37-33
лук 15+111-66
перец болгарский144-36
персик 138-9+387-69
абрикос 21-11
слива55-1 
&завтрак
брокколи (574-33)/5
баклажан 151/5
грибы 512/5
сметана 30% 498-485 бжу 2.3 30 3.1 животный белок/жир 1 1 b12 0.36
укроп зелень33-16
лук 66-36
огурец130-50
перец болгарский36
персики 899-529
сухари белые 23+24
сухари черные 44
&обед
брокколи (574-33)/5
баклажан 151/5
грибы 512/5
укроп зелень 16-8
лук 36-26
огурец50
персики 733-479+906-501
сухари черные 57+32
&ужин`
	, `#7авг масса 65.1
брокколи (574-33)/5+(364-18)/4
баклажан 151/5
грибы 512/5+243/4
кабачок (420-7)/4
тушенка 589-393
укроп зелень 7-4
&завтрак
брокколи (574-33)/5+(364-18)/4
баклажан 151/5
грибы 512/5+243/4
кабачок (420-7)/4
тушенка 393-260
абрикос738-708
персик657-499
&обед
брокколи (574-33)/5+(364-18)/4
баклажан 151/5
грибы 512/5+243/4
кабачок (420-7)/4
тушенка 260-127
огурец124
помидор103
лук24+26
&ужин`
	, `#8авг масса 64.8
брокколи (364-18)/4
грибы 243/4
кабачок (420-7)/4
тушенка 123-94
огурцы206-108
помидоры178-103
лук55-25
перец болгарский 67-25
абрикос12-2
персик56-3
&завтрак
баклажаны (263-9)/3
брокколи (733-419)/3
грибы 363/3
тушенка 94-74
огурцы108
помидоры103
лук25+47-34
перец болгарский 25+81-42
/пломбир не считал животные бж b12 0.35
пломбир 539-464 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&обед
баклажаны (263-9)/3
брокколи (733-419)/3
грибы 363/3
кукуруза 113-40
огурцы125
помидоры162-32
лук34+15
перец болгарский 42+90-63
пломбир 80-3 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&ужин`
	, `#9авг масса 64.4
баклажаны (263-9)/3
брокколи (733-419)/3
грибы 363/3
персики 63-10
абрикосы63-4
огурец152
помидор110-5
перец болгарский57
редиска 75+17
лук28+81-68
кукуруза 439-26-188
&завтрак
баклажаны (562-193)/4
брокколи (775-8)/4
грибы 33/4
огурец166
помидор124
редиска110 
лук66
&обед
баклажаны (562-193)/4
брокколи (775-8)/4
грибы 33/4
пломбир 80-3 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&ужин`
	, `#10авг масса 64.6
огурец243-121
помидор187-124
перец болгарский149-86
редиска80-28
лук зелёный34
персики1084-683
пирог с джемом 77 бжу 5.81 3.91 53.77 
мандарин 71-10
слива 34-2
арахис жареный очищенный297-237
&завтрак
персики 610-503+848-611
огурец 120 
помидор 122-27
перец болгарский 80-8
лук 103-57
редиска 27+83-33
пирог с джемом 77 бжу 5.81 3.91 53.77
груша127-4
пломбир 77-2 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&обед
персики 870-584
огурец 51
помидор 26
редиска 30
перец болгарский41
лук 55-36
яблоки 150
пломбир 590-519 + 595-517 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&ужин`
	, `#11авг масса 64
баклажаны (562-193)/4
брокколи (775-8)/4
грибы 33/4
кукуруза 1523-1336-75
яблоко 125
огурец 121
помидоры 106
перец болгарский 86
редиска 78
лук 34+31-8
&завтрак
баклажаны (562-193)/4
брокколи (775-8)/4
грибы 33/4
яблоко 181
&обед
кабачок 191
картошка 272
лук34+21
яблоко 248
пломбир 77+82-5+88+88-7 бжу 4 14 24 животный белок/жир .5 .5 b12 0.35
&ужин`
	, `#12авг масса 64.2
баклажаны 310/3
кабачок 150/3
картошка 704/3
тушёнка 622-425
огурец 81
помидор 86
лук 70-8
перец болгарский 162-83
редиска 80
пирог с джемом 68+70 бжу 5.81 3.91 53.77 
&завтрак
баклажаны 310/3
кабачок 150/3
картошка 704/3
тушёнка 425-243
огурец 83
помидор 86
перец болгарский 80
лук 8+54
редиска 46+17
арахис в сахарной глазури 232-2 бжу 5 36 58
&обед
баклажаны 310/3
кабачок 150/3
картошка 704/3
тушёнка 243-88
сухари черные 49
помидоры 89
редиска 37
перец болгарский 49
лук 118-91
/хлеб чёрный 57
&ужин`

	, `#13авг масса 65
груша 731-522
персики 1129-662
пирог с мясом 152 бжу 15.8 12.2 11.4 животный белок/жир .5 .5 b12 0.377
&завтрак 
персики 986-638
огурцы 129
помидор 98
редиска 60
перец болгарский 61
лук 89-38
&обед 
огурцы 122
помидоры 97
перец болгарский 100
лук 37+20
редиска 56+15
абрикосы 67-6
персики 234-48
&ужин`

	, `#14авг масса 64.4
баклажаны 160
перец болгарский132-74
редиска 189-113
лук 114-72
огурцы 127
помидоры 124
апельсин 188-46
кабачки 1037/3
баклажаны 160/3
кукуруза (605-240)/2
&завтрак 
кабачки 1037/3
баклажаны 160/3
кукуруза (605-240)/2
апельсин 199+225-103
мандарин 121-27
&обед 
кабачки 1037/3
баклажаны 160/3
пирог с мясом 95 бжу 15.8 12.2 11.4 животный белок/жир .5 .5 b12 0.377
пирог с джемом 86 бжу 5.81 3.91 53.77 
перец болгарский74
редиска 113-8
лук 72-7
огурцы 144
помидоры 109
&ужин`

	, `#15авг масса 64.6
картошка 230-135
/остатки картошки 1035-900=135
грибы 240
шпинат 876-789
персики 915-527
&завтрак
картошка 135
грибы 240+52*1218/609
шпинат 822-714+722-704
яблоко 136
пирог с джемом 100 бжу 5.81 3.91 53.77
апельсин 807-620+830-586
&обед
перец болгарский94
редиска 47
лук 55-5
петрушка 54-12+30-9
огурцы 201
помидор 69
яблоко 83
пирог с джемом 56+78 бжу 5.81 3.91 53.77
крекер 96+16+84+17 бжу 11.3 13.4 67.1 
&ужин`

	, `#16авг масса 64.8
петрушка 42+9
творог 9% 138-19
апельсин 744-576
грибы (1950-1807)*1644/1324
макароны 67
вода 2*67
&завтрак
картофель 243
грибы 14+250*1644/1324
тушенка 85-74
апельсин 811-600
панна-котта 160 бжу 2.7 12.5 20.5 животный белок/жир .5 .5 b12 0.356
&обед
картофель 238
грибы 300*1644/1324
апельсин 729-577+742-581
&ужин`

	, `#17авг масса 64.4
огурцы 170
помидоры 71
перец болгарский 76
лук 80-41
щавель 55-7
масло подсолнечное рафинированное 5
пшено 80*.7
вода (796/3-80)*.7
грибы 265*1038/827*.7
апельсины 965-766
&завтрак 
огурцы 131
помидоры 45
перец болгарский 138-51
лук 39-4+4
макароны 70
вода 89
грибы (265*.3+1812-1733)*1038/827
апельсин 742-578
&обед 
макароны 70
вода 89
грибы (70+89)*1038/827
кабачки 412
апельсин 819-611+797-622
драже 5*2 бжу 10 32 49
&ужин`

	, `#18авг масса 64
картошка 240
грибы 240*1.25
масло подсолнечное рафинированное 10
лук 40-12
&завтрак
картошка 232
грибы 232*1.25
масло подсолнечное рафинированное 6
лук 12
яблоко 254-3
персик 87-8
&обед
картошка 220
грибы 220*1.25
масло подсолнечное рафинированное 8
лук 34-13
яблоко 646-524+616-528
кабачок 291
перец болгарский 43
апельсин 807-592+746-621
&ужин`

	, `#19авг масса 63.6
суп 563-140 бжу 3.7 2.1 2.3
чеснок 6
сметана 20% 15
/картофель 100*16/35.9
/опята 15.4*100*16/35.9
/масло растительное .5
/сметана 30% 15 бжу 2.3 30 3.1 животный белок/жир 1 1 b12 0.36
&завтрак
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
&обед
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
&ужин`

	, `#20авг масса 63.3
кабачки 120
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
&завтрак
арбуз 4994/2*(1-1266/4994)
/кабачки 4994/2*(1-1266/4994)
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
&обед
кабачки 104
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
масло подсолнечное рафинированное 19
суп 420 бжу 3.7 2.1 2.3
чеснок 13
сухари чёрные 24
сметана 20% 32
&ужин`

	, `#21авг масса 63.8
крупа пшеничная 100/2
вода (510-133)/2
свёкла 626/6
овощи тушёные 250 бжу 1.2 2.9 6.8
&завтрак
арбуз 5086/2*(1-1266/4994)
&обед
крупа пшеничная 100/2
вода (510-133)/2
овощи тушёные 250 бжу 1.2 2.9 6.8
салат (2306-1478)/2 бжу 0.8	1.2	4.1
кабачок 407-155
хлеб черный 29+44
огурцы 80
&ужин`

	, `#22авг масса 63.3
картошка 232
грибы 709/2
лук 71-39
яблоко 159
&завтрак
картошка 244
грибы 709/2
лук 39-13
абрикосы 1368-929
косточки абрикоса (370-348)*(1368-929)/(1438-809)
&обед
банан 666-563
абрикосы 1438-809
косточки абрикоса 370-348
хлеб белый 49
панна-котта 160 бжу 2.7 12.5 20.5 животный белок/жир .5 .5 b12 0.356
фисташки 749-738
крекер 185-83 бжу 11.3 13.4 67.1 
&ужин`

	, `#23авг масса 63.7
лук 143-102
помидоры 49
перец болгарский 98
огурцы 185
нектарины 84
картошка 211
баклажаны 195
грибы 463/2
сметана топлёная 25% 1044-839
холодец 765-581 бжу 13 20 0 животный белок/жир 1 1 b12 0.9
горчица русский аппетит с хреном 72-61
колбаса 96 бжу 11 13 0 животный белок/жир 1 1 b12 0.5
&завтрак
картошка 249
баклажаны 110
грибы 463/2
яблоки 179
творог 9% 100
сметана топлёная 25% 100
горчица русский аппетит с хреном 61-53
холодец 581-468 бжу 13 20 0 животный белок/жир 1 1 b12 0.9
апельсин 273-56+141-30+123-21+126-32
&обед
горчица русский аппетит с хреном 4+53-32
холодец 468-237 бжу 13 20 0 животный белок/жир 1 1 b12 0.9
творог 9% 200
сметана топлёная 25% 100
/хорошее соотношение
сыр российский 376-170 бжу 25.7 26.3 0 животный белок/жир 1 1 b12 1.5
фундук 55
&ужин`

	, `#24авг масса 64.5
арбуз (3432-498)/2
&завтрак
арбуз (3432-498)/2
&обед
холодец 229-5 бжу 13 20 0 животный белок/жир 1 1 b12 0.9
горчица русский аппетит с хреном 31-14+140-137
персики 690-492+803-493
огурцы 230
помидоры 81
перец болгарский 109
лук 96-45
банан 180-49+430-132
крекер 80-4 бжу 11.3 13.4 67.1
драже 6*2 бжу 10 32 49
&ужин`

	, `#25авг масса 64.3
банан 86
нектарины 867-463
творог 9% 50
сметана брест-литовск 25% 25
арбуз (4185-910)/2
&завтрак
арбуз (4185-910)/2
&обед
огурцы 219
перец болгарский 125
лук 43
помидоры 935-593
руккола 75
кориандр 112-75
сыр российский 169-18 бжу 25.7 26.3 0 животный белок/жир 1 1 b12 1.5
драже 21+40 бжу 10 32 49
фундук 290-192
&ужин`

	, `#26авг масса 64.1
кабачок 392/2
свёкла 266/2
помидоры 662-459
редиска 93-23
руккола 126-44
лук 55-13
перец болгарский 103
&завтрак
крупа пшеничная 50
вода 200
нектарины 996-538
лук 58-25
редиска 48
перец болгарский 65
помидоры 154
руккола 45-14
&обед
крупа пшеничная 50
вода 200
кабачок 392/2
свёкла 266/2
творог 9% 100
сметана брест-литовск 25% 50
фундук 194-19
бананы 568-382
&ужин`

	, `#27авг масса 64.3
крупа пшеничная 50
вода 150
кабачки 732/3
морковь 329
помидоры 184
редиска 38
лук 23
&завтрак
крупа пшеничная 50
вода 150
кабачки 732/3
морковь 184
печенье 180 бжу 7 24 59
драже 40 бжу 10 32 49
нуга с арахисом 25 бжу 11 21 61
вафли fun banan 35 бжу 5.5 23 64
сникерс 15 бжу 8 25.4 58.8 
фундук 16-(298-307)
творог 9% 100
сметана брест-литовск 25% 50
&обед
шоколад 40 бжу 2 34 61
сникерс 8+26 бжу 8 25.4 58.8 
крупа пшеничная 50
вода 150
кабачки 732/3
&ужин`

	, `#28авг масса 64
абрикос 35-2
сметана 20% 59-10
персик 104
дыня (2265-38-1450+980)/3
пюре овощное 196-99 бжу 1 .3 9.5
творожная масса 185 бжу 7.7 20.9 32.1 животный белок/жир 1 1 b12 1
виноград 1062-683
&завтрак
дыня (2265-38-1450+980)/3
груша 166
&обед
дыня (2265-38-1450+980)/3
огурцы 68
редиска 25
лук 20
перец болгарский 67
сметана брест-литовск 25% 90-19
творог 9% 84*2
сметана топлёная 25% 50*2
&ужин`

	, `#29авг масса 63.8
морковь 155+80
крупа пшеничная 50
вода 2.8*50
кабачки 596/3
кукуруза 394-159
творог 9% 112-21
сметана топлёная 25% 79
&завтрак
перец болгарский 130
лук 19
редиска 41+20+63
сметана топлёная 25% 444-250
морковь 80+323-265
крупа пшеничная 50
вода 2.8*50
кабачки 596/3
сникерс 15*3 бжу 8 25.4 58.8
milky way 11*2 бжу 2.7 16.6 72.9
молочный шоколад 45 бжу 8 38 49
нуга с арахисом 25 бжу 11 21 61
&обед
крупа пшеничная 50
вода 2.8*50
кабачки 596/3
морковь 265
milky way 11*2 бжу 2.7 16.6 72.9
нуга с арахисом 25*5 бжу 11 21 61
&ужин`

	, `#30авг масса 64.9
крупа пшеничная 50
вода 2.8*50
кабачки 401/3
морковь 214
milky way 11*2 бжу 2.7 16.6 72.9
нуга с арахисом 25*4 бжу 11 21 61
&завтрак
крупа пшеничная 50
вода 2.8*50
кабачки 401/3
нуга с арахисом 25*7 бжу 11 21 61
сметана топлёная 25% 240-31
&обед
крупа пшеничная 50
вода 2.8*50
кабачки 401/3
пряник 100 бжу 5 5.6 76.3
&ужин`

	, `#31авг масса 65.2
банан 133-65
инжир свежий 143-8
сливы 100-7
арбуз 2047-(2260-1104)
сметана 20% 57-8
пицца 97 бжу 10.4 12.3 26.8 животный белок/жир .5 .5 b12 0.293
пирог с мясом 149 бжу 15.8 12.2 11.4 животный белок/жир .5 .5 b12 0.377
сосиска в тесте 80+79 бжу 11 31 24
//https://health-diet.ru/table_calorie_users/3222777/
&завтрак
арбуз 2473-(2239-1104)
булочка с творогом 97 бжу 8.1 16.5 38.4
&обед
виноград 2621-1281
морковь 109
&ужин`

	, `#1сент масса 65.2
морковь 193
картофель 284
лук 60
масло подсолнечное рафинированное 9
арбуз 5632-3611-(1745-1104)
банан 128-40
пирог с джемом 132+129+135+72 бжу 5.81 3.91 53.77 
&завтрак
арбуз 2482-(1436-1104)
нектарин 116
картошка 268
масло подсолнечное рафинированное 11
лук 70-40
&обед
картошка 238
перец болгарский 88-3
огурцы 199-30
помидоры 221
масло подсолнечное рафинированное 16
лук 40+37-15
арбуз 2482-1081-(1532-1104)
бананы 956-789
пирог с джемом 897+905-2*702 бжу 5.81 3.91 53.77 
&ужин`

	, `#2сент масса 66.5
картошка 255
лук 75+118-107
огурцы 153
помидоры 185+46+325-19
масло подсолнечное рафинированное 22
арбуз 1062-(1465-1104)
&завтрак
картофель 243
лук 107-84
масло подсолнечное рафинированное 22
нектарины 872-499
молоко 2.5% 690-28
&обед
апельсин 1051-824+765-598
картофель 246
лук 84-48
масло подсолнечное рафинированное 13
яблоки 836-575
молоко 3.2% 637-29
&ужин`

	, `#3сент масса 65.2
яблоко 765-458+785-530
крупа пшеничная 50
вода 150
картофель 230
лук 45-15
масло подсолнечное рафинированное 10
&завтрак
апельсины 1035-736+911-631-124
мандарин 124-33+762-530
крупа пшеничная 50
вода 150
картофель 225
лук 15+71-49
масло подсолнечное рафинированное 14
&обед
крупа пшеничная 50
вода 150
картофель 232
лук 49-21
хлеб белый 75
&ужин`

	, `#4сент масса 65.1
крупа пшеничная 50
вода 50*3.5
картофель 218
лук 21
масло подсолнечное рафинированное 9
горох 22
&завтрак
горох 23
крупа пшеничная 50
вода 50*3.5
картофель 228
масло подсолнечное рафинированное 8
лук 31
&обед
крупа пшеничная 50
вода 50*3.5
картофель 222
масло подсолнечное рафинированное 7
сухари черные 50
&ужин`

	, `#5сент масса 64.8
перловка 138/3
вода 184
свекла 670/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&завтрак
перловка 138/3
вода 184
свекла 670/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
сухари черные 52
&обед
перловка 138/3
вода 184
свекла 670/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
сухари черные 51
&ужин`

	, `#6сент масса 65
перловка 138/3
вода 128
свекла 663/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&завтрак
перловка 138/3
вода 128
свекла 663/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
сухари черные 60
&обед
перловка 138/3
вода 128
свекла 663/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
сухари черные 121
&ужин`

	, `#7сент масса 64.8
киви 66+84-20
персик 112-9
виноград 753- 492
банан 658-545
инжир свежий 47+1077-937
баклажаны 675/3
картошка 652/3
перец болгарский 438/3
сливы 74-5
гранат 1207-993
&завтрак
лук 60-10
помидоры 155
огурцы 200
масло подсолнечное рафинированное 11+21
инжир свежий 234-20
баклажаны 675/3
картошка 652/3
перец болгарский 438/3
&обед
баклажаны 675/3
картошка 652/3
перец болгарский 438/3
масло подсолнечное рафинированное 25
огурцы 308
лук 78-31
помидоры 168-4
персики 1698-1301
сливы 33-2+624-483
нектарины 644-529
инжир свежий 598-461
персик 663-489
&ужин`

	, `#8сент масса 66.3
перец болгарский 562/3
баклажаны 595/3
картошка 831/3
яблоко 148
нектарины 294-46
инжир свежий 86
&завтрак
перец болгарский 562/3
баклажаны 595/3
картошка 831/3
помидор 106
огурцы 324
лук 63
масло подсолнечное рафинированное 21+27
&обед
перец болгарский 562/3
баклажаны 595/3
картошка 831/3
помидоры 110
огурцы 376
лук 64-11
масло подсолнечное рафинированное 24+15
&ужин`

	, `#9сент масса 64.3
перец болгарский 476/3
баклажаны 654/3
картошка 964/3
&завтрак
перец болгарский 476/3
баклажаны 654/3
картошка 964/3
&обед
перец болгарский 476/3
баклажаны 654/3
картошка 964/3
&ужин`

	, `#10сент масса 64
баклажаны 691/3
перец болгарский 507/3
картошка 940/3
лук 11
&завтрак
баклажаны 691/3
перец болгарский 507/3
картошка 940/3
&обед
баклажаны 691/3
перец болгарский 507/3
картошка 940/3
&ужин`

	, `#11сент масса 64
крупа пшеничная 200/3
вода 800/3
свёкла 1419/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&завтрак
крупа пшеничная 200/3
вода 800/3
свёкла 1419/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&обед
крупа пшеничная 200/3
вода 800/3
свёкла 1419/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&ужин`

	, `#12сент масса 64.2
картофель 1275/3
&завтрак
картофель 1275/3
&обед
картофель 1275/3
&ужин`

	, `#13сент масса 63.7
крупа пшеничная 150/3
вода 600/3
свёкла 1012/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&завтрак
крупа пшеничная 150/3
вода 600/3
свёкла 1012/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&обед
крупа пшеничная 150/3
вода 600/3
свёкла 1012/3
gallina blanca бульонный кубик 5/3 бжу 7 10 21
&ужин`

	, `#14сент масса 62.5
банан 401-148
колбаса 56 бжу 11 13 0 животный белок/жир 1 1 b12 0.5
рыба вяленая 150-97 бжу 17.5 4.6 0.0 животный белок/жир 1 1 b12 4.1818181818182
помидоры 1644-1337
виноград 1763-1319
&завтрак
помидоры 1337-1108
виноград 1319-958
банан 386-166
рыба вяленая 97 бжу 17.5 4.6 0.0 животный белок/жир 1 1 b12 4.1818181818182
&обед
банан 778-503+763-469
нектарин 204-17+567-334
&ужин`

	, `#15сент масса 64.1
банан 284-99
помидоры 984-739
огурцы 80
лук 175-126
перец болгарский 113-32
укроп зелень 8
&завтрак
банан 269-89+161-55
яблоко 120+101
лук 126-91
перец болгарский 32
помидор 985-724
&обед
яблоко 915-771+125
банан 188-63+975-793
помидор 510-298
лук 91-62
&ужин`

	, `#16сент масса 63.9
яблоко 1013-705
помидоры 1010-707
лук 56-21
&завтрак
банан 567-381
помидор 959-713
укроп зелень 7
лук 21
&обед
банан 156-51+186-51+214-70+171-53+203-63+181-59
помидор 926-706+882-705+911-709
&ужин`

	, `#17сент масса 63.8
геркулес 25
вода 100
банан 565-380
&завтрак
геркулес 25
вода 100
банан 522-362+532-374+55-19+165-51
картофель 276
рис 53/2
вода 216/2
&обед
рис 53/2
вода 216/2
бананы 405-132+129-42+138-42
&ужин`

	, `#18сент масса 63.6
банан 509-363+500-359
&завтрак
картошка 276
кукуруза 737-85-89
банан 530-368
&обед
банан 521-369
картошка 276
&ужин`

	, `#19сент масса 63.9
свёкла (1001-469)/2
картошка 1012/3
&завтрак
свёкла (1001-469)/2
картошка 1012/3
&обед
картошка 1012/3
&ужин`

	, `#20сент масса 63.8
свёкла 469
&завтрак
картошка 1026/2
свёкла 90
&обед
картошка 1026/2
&ужин`

	, `#21сент масса 63.8
сливы 1037-736
арбуз 1653-(692-46)
&завтрак
арбуз 2594-965+54
&обед
сливы 153-2
нектарины 199-29
виноград 1607-924
&ужин`

	, `#22сент масса 63
помидоры 1173 - 763
перец болгарский 361 - 314
кориандр 224 - 187
яблоко 145+179
&завтрак
помидоры 1273-840
перец болгарский 586-485
кориандр 199-171
кабачок 290/2
картошка (292-4)/2
&обед
нектарины 734-369
кабачок 290/2
картошка (292-4)/2
помидоры 1083-730
перец болгарский 69
&ужин`

	, `#23сент масса 63.6
огурец 109+99
перец болгарский 35+42
помидор 776-550+784-514
картошка 68+60+159
&завтрак
перец болгарский 42
огурцы 105
картофель 148
помидоры 320-25
кабачки 319*2/3
картофель 485*2/3
рис 45
вода 200
&обед
кабачки 319/3
картофель 485/3
помидоры 687-328
огурцы 117
&ужин`

	, `#24сент масса 63.8
крупа пшеничная 50
вода 200
свекла 1310/3
&завтрак
&обед
картошка 198+208
крупа пшеничная 50/2
вода 200/2
свекла 1310/6
&ужин`

	, `#25сент масса 62.2
крупа пшеничная 25
вода 100
свекла 1310/6
&завтрак
крупа пшеничная 25
вода 100
свекла 1310/6
картофель 228
&обед
крупа пшеничная 25
вода 100
свекла 1310/6
картофель 212
кабачки 514
&ужин`

	, `#26сент масса 62.3
крупа кукурузная 50
вода 200
свёкла 700/3
печенье 22 бжу 7 24 59
&завтрак
крупа кукурузная 50
вода 200
свёкла 700/3
картофель 218
&обед
геркулес 50
вода 200
свёкла 700/3
картофель 241
&ужин`

	, `#27сент масса 61.8
крупа кукурузная 50
вода 200
свёкла 724/3
картофель 219
&завтрак
крупа кукурузная 50
вода 200
свёкла 724/3
картофель 212
&обед
геркулес 50
вода 200
свёкла 724/3
&ужин`

	, `#28сент масса 61.7
персики 733-523+740-533
сливы 16
груша 635-498
лепёшка ржаная 100 бжу 7.7 17.7 43.6
&завтрак
нектарины 723-523
виноград 1783-1031
хурма 71-5
помидоры 844-709
&обед
персик 911-764
огурец 225
&ужин`

	, `#29сент масса 61.7
персики 1054-742+922-719+861-715
&завтрак
грибы 70+79+82
масло подсолнечное рафинированное 9+7
картошка 75+130+96-30
виноград 1526-1250
&обед
виноград 1250-906
арбуз 1842-1150+1440-1046
&ужин`

	, `#30сент масса 62.4
картофель 230-19
грибы 236*2/3
масло подсолнечное рафинированное 19*2/3
персик 1060-915
&завтрак
картофель 230-16
грибы 236*1/3
масло подсолнечное рафинированное 19*1/3
косточки арбуза 317-306+303-300
арбуз 1638-1049
&обед
арбуз 2036-1183+1546-1057+1280-986+1387-1041
косточки арбуза 745-731
&ужин`

	, `#1окт масса 62.4
картофель 224
баклажаны 151
грибы 108
масло подсолнечное рафинированное 9
яблоко 836-761
&завтрак
арбуз 1853-1272
яблоко 281+223+158
огурец 203
крупа кукурузная 75/3
вода 300/3
картофель 269
&обед
крупа кукурузная 75*2/3
вода 300*2/3
огурец 237+224
&ужин`

	, `#2окт масса 62.5
рис 51
вода 260
&завтрак
рис 20
крупа кукурузная 30
вода 250
&обед
картофель 211+215
баклажан 205
&ужин`

	, `#3окт масса 61.7
свекла 893/3
перловка 150/3
вода 150*2.86/3
&завтрак
свекла 893/3
перловка 150/3
вода 150*2.86/3
&обед
свекла 893/3
перловка 150/3
вода 150*2.86/3
картофель 214
&ужин`

	, `#4окт масса 61.6
сныть 938-777
геркулес 50
вода 200
&завтрак
сныть 777-632
крупа кукурузная 24
геркулес 50-24
вода 200
картофель 206+214
&обед
&ужин`

	, `#5окт масса 61.3
слойка с сыром 25 бжу 12.3 16.5 43.7
свинина вырезка 124-61
язык свиной 53
банан 74-28
виноград 1527-725+46
мясо голени индейки 450*4/9
филе куриной грудки 1156*4/9
&завтрак
виноград 118+990-656
курица (253-63)/2
индейка 1269+170+211-(1033+35)
&обед
курица (253-63)/2
виноград 1075-668
&ужин`

	, `#6окт масса 61.6
индейка 89
виноград 876-654
&завтрак
виноград 797-644+891-656
сливы 568-492
чеснок 4
/суп 742-335 бжу
&обед
виноград 953-654
филе куриной грудки 84
свинина вырезка 147+5
нектарин 37-15+169-13
мандарин 60-39
киви 87-5+86-8
банан 124-30
&ужин`

	, `#7окт масса 61.9
сыр сулугуни 261-115
виноград 1002-668+1024-658+1132-692
&завтрак
помидор 159-19
лук 10
нектарин 193-12
свинина вырезка 88
индейка 83+64
филе куриной грудки 11+112-64
мандарин 74-20
груша 167
бананы 271-89+120-43
яблоко 96
&обед
филе куриной грудки 181
индейка 142
виноград 1193-660
&ужин`

	, `#8окт масса 62.8
виноград 815-658+848-670
яблоко 277
огурцы 122+216
перец болгарский 54+69+56
лук 50+40-14
филе куриной грудки 126
индейка 1261-953
&завтрак
сыр сулугуни 118-71
виноград 825-656+943-650
&обед
виноград 1066-664+934-662+865-650
сыр сулугуни 71-20
редька зелёная 54
сухари белые 151
сухари черные 173
&ужин`

	, `#9окт масса 63.9
картофель 256
лук 12
морковь 208
редька зелёная 188
&завтрак
баклажаны 561/2
перец болгарский (478+194)/2
помидоры 380/2
редька зелёная 202
&обед
баклажаны 561/4
перец болгарский (478+194)/4
помидоры 380/4
&ужин`

	, `#10окт масса 63.8
баклажаны 561/4
перец болгарский (478+194)/4
помидоры 380/4
редька зелёная 360
&завтрак
картофель 209
баклажаны 575*2/7
перец болгарский 436*2/7
помидоры 370*2/7
лук 191*2/7
&обед
картофель 213+229
баклажаны 575*2/7
перец болгарский 436*2/7
помидоры 370*2/7
лук 191*2/7
&ужин`

	, `#11окт масса 63.6
&завтрак
картофель 362*1/3
баклажаны 575*1/7
перец болгарский 436*1/7
помидоры 370*1/7
лук 191*1/7
&обед
геркулес 50
вода 200
картофель 362*2/3
баклажаны 575*2/7
перец болгарский 436*2/7
помидоры 370*2/7
лук 191*2/7
&ужин`

	, `#12окт масса 62.6
картофель 209
виноград 641-486
яйцо 762-702
лук 24- 16
&завтрак
картофель 209
помидоры 795-38-619
лук 16+45-29
перец болгарский 102-42
геркулес 50
вода 200
&обед
картофель 256
помидоры 133-40
лук 26+26-15
перец болгарский 113-38
&ужин`

	, `#13окт масса 62.3
картофель 218
сныть 970-714
&завтрак
картофель 214
лук 39
перец болгарский 90
помидор 22
геркулес 50
вода 200
&обед
картофель 241
сныть 714-671+930-789
пряники 91 бжу 5.9 6.5 70.5
вафли 36 бжу 3.9 30.6 62.5
&ужин`

	, `#14окт масса 62
картофель 244-18
&завтрак
картофель 225-8
сныть 789-667
геркулес 45
вода 200
&обед
картофель 238
сныть 667-653+1010-888
сухари чёрные 75
сухари белые 26
&ужин`

	, `#15окт масса 62
&завтрак
картофель 214+216
сныть 888-783
лечо 1319-1140 бжу 0.9 2.2 7.5 клетчатка 1.3
геркулес 45
вода 200
&обед
макароны 100
вода 137
лечо 1140-983 бжу 0.9 2.2 7.5 клетчатка 1.3
&ужин`

	, `#16окт масса 61.6
картофель 218
лечо 983-844 бжу 0.9 2.2 7.5 клетчатка 1.3
&завтрак
картофель 213+209
сныть 783-672
макароны 84
вода 197
лечо 844-633 бжу 0.9 2.2 7.5 клетчатка 1.3
&обед
сухари черные 68
&ужин`

	, `#17окт масса 61.5
картофель 206
страусник 1041-771
&завтрак
макароны 84
вода 250
лечо 633-559 бжу 0.9 2.2 7.5 клетчатка 1.3
сухари черные 28
картофель 209
страусник 771-655
&обед
макароны 80
вода 250
лечо 559-479 бжу 0.9 2.2 7.5 клетчатка 1.3
&ужин`

	, `#18окт масса 61.4
картофель 218
лечо 479-397 бжу 0.9 2.2 7.5 клетчатка 1.3
&завтрак
картофель 210
страусник 655-497
макароны 80
вода 250
сухари черные 14+33
&обед
картофель 221
страусник 497-421
&ужин`

	, `#19окт масса 61.3
борщ 250 бжу 3.8 1.1 5.6 b12 0.017
мандарин 564-457
сливы 507-478+10
помидоры 639-533
перец болгарский 801-756
авокадо 796-735
хурма 809-644
&завтрак
помидоры 39
перец болгарский 130-71
огурцы 240-132
лук 27
авокадо 82-26
виноград 1095-840
хурма 628-469
&обед
перец болгарский 71
огурцы 132
лук 44-6
авокадо 143-41
виноград 840-698
арбуз 4417-3477-(351-55+97-84)
&ужин`

	, `#20окт масса 61.8
суп грибной 368-18 бжу 2 8.5 4 животный белок/жир .5 1 b12 0
арбуз 3427-2581-(354-49+91-84) 
&завтрак
кабачки 436
баклажан 124
перец болгарский 232
арбуз 2560-1384-(482-47) 
&обед
арбуз 1384-(699-49)+3834-3004-(331-48)
&ужин`

	, `#21окт масса 61.1
плов со свининой 250 бжу 5.5 8.7 2.1 животный белок/жир .5 .5 b12 0.23333333333333
лук 4
арбуз 2934-2208-(343-48)
&завтрак
арбуз 2195-954+49
геркулес 50
вода 200
&обед
картофель 228
страусник 1089-993
кочедыжник женский 1027-911
сухари чёрные 42
&ужин`

	, `#22окт масса 61.1
картофель 209
страусник 993-907
кочедыжник женский 911-807
гранат 669-535
киви 112-8+609-482+670-483
&завтрак
картофель 218
страусник 907-837
кочедыжник женский 807-723
лук 36-2
перец болгарский 65
помидоры 175-39
&обед
картофель 208
лук 18+17
перец болгарский 90
помидоры 188
сухари чёрные 28+42
&ужин`

	, `#23окт масса 61.7
лук 64-28
картофель 214
страусник 837-807
кочедыжник женский 723-602
&завтрак
картофель 218
страусник 807-608
зеленый лук 64-26
сухари чёрные 22
&обед
картофель 135*215/174
страусник 608-455
зеленый лук 26-7
сухари черные 77
&ужин`

	, `#24окт масса 61.4
картофель 211
кочедыжник женский 602-468
зеленый лук 7
лук 28-10
&завтрак
картофель 210
кочедыжник женский 468-375
страусник 455-420
лук 10+20
мука 50
вода 162+20
&обед
картофель 217
кочедыжник женский 375-333
страусник 420-405
лук 73
сухари черные 28
сухари белые 23
сало свиное топлёное 6
&ужин`

	, `#25окт масса 60.6
груша 100-35
сливы 122-2
банан 46-18
помидоры 26
виноград 160
курица 87
свинина вырезка 268
&завтрак
виноград 529-60
мандарины 834-556
хурма 800-505
помидоры 632-526
яблоко 76
&обед
&ужин`

	, `#26окт масса 60.8
помидоры 744-557
лук 48-28
капуста 230
перец болгарский 40
виноград 878-42
&завтрак
лук 26+57-51
помидоры 759-502+655-509
виноград 924-489
&обед
картофель 213
грибы 1530*200/1457
лук 300*200/1457
масло подсолнечное рафинированное 82*200/1457
&ужин`

	, `#27окт масса 60
помидоры 780-511
лук 51-15
&завтрак
картофель 218
грибы 1530*202/1457
лук 300*202/1457
масло подсолнечное рафинированное 82*202/1457
помидоры 633-464+607-469
лук 15+21+15
&обед
виноград 2486+17-546-980
&ужин`

	, `#28окт масса 60.6
редька зеленая 100
сливы 535-479
помидоры 734-475
лук 757-703+789-785
картофель 221
грибы 1530*200/1457
лук 300*200/1457
масло подсолнечное рафинированное 82*200/1457
бананы 755-572
мандарин 557-477
&завтрак
виноград 300
лук 76-54
помидоры 190
&обед
калужское тесто 66 бжу 4.4 2.4 67.9
макароны 50
вода 137/5
грибы 1530*100/1457
лук 300*100/1457
масло подсолнечное рафинированное 82*100/1457
морковь 112
&ужин`

	, `#29окт масса 60.4
слива	26
виноград 36-4
помидоры 1014-747
&завтрак
виноград 301+925-487
яблоки 726-540+183
помидоры 158
лук 49-19
грибы 15
&обед
яблоки 673-475
молоко 2.5% 386-31
вода 100
&ужин`

	, `#30окт масса 59.9
семечки подсолнечника 20
&завтрак
картофель 221
грибы 1530*200/1457+94
лук 300*200/1457+27-5
масло подсолнечное рафинированное 82*200/1457+ 298-278
панировка с куркумой и паприкой 218-213 бжу11.5 1.6 69.7
помидоры 239
виноград 42+150
&обед
виноград 350
помидоры 126
лук 25-2
&ужин`

	, `#31окт масса 60
картофель 213
грибы 68+45
лук 2+9
яблоко 60
боярышник 80
&завтрак
картофель 214
грибы 1530*192/1457
лук 300*192/1457
масло подсолнечное рафинированное 82*192/1457
сало свиное топлёное 3
виноград 150+275-17+263-17
&обед
помидоры 149+168
лук 21+7+21
виноград 570-17
&ужин`

	, `#1нояб масса 60.8
картофель 210+214
грибы 1530*188/1457+519-475+1336/5
лук 300*188/1457+314/5
масло подсолнечное рафинированное 82*188/1457
жир говяжий 47+53/5
&завтрак
картофель 226
грибы 1336/5
лук 314/5
жир говяжий 53/5
&обед
&ужин`

	, `#2нояб масса 59.9
бананы 1107-745
киви 651-473+538-485
&завтрак
помидоры 622-470
фейхоа 12
груша 683-543
хурма 571-464+812-655+658-574
яблоко 712-643+709-658
&обед
банан 604-510
виноград 604-27
&ужин`

	, `#3нояб масса 60.5
бананы 788-580
груша 395
боярышник 48
семечки подсолнечника 35
&завтрак
яблоко 695-460
банан 184-56
нектарин 57-7
картофель 205
грибы 143
панировка с куркумой и паприкой 213-207 бжу11.5 1.6 69.7
сало свиное топленое 23
петрушка 34-22
укроп зелень 33-29
&обед
редиска 119
петрушка 22-14
салат латук 118-46
&ужин`

	, `#4нояб масса 59.4
бананы 769-552+813-565
семечки подсолнечника 14-5 
&завтрак
картофель 236
грибы 1336/5
лук 314/5
жир говяжий 100/5
петрушка 14-5
салат латук 46-3
виноград 846-512
банан 609-509
&обед
морковь 688-462
&ужин`

	, `#5нояб масса 59.6
банан 639-523+584-500+788-565
морковь 631-462
виноград 238+282-34
&завтрак
картофель 226
грибы 1336/5
лук 314/5
жир говяжий 100/5
морковь 98
&обед
банан 653-523+669-565
&ужин`

	, `#6нояб масса 59.4
морковь 170+232
банан 644-505
&завтрак
картофель 226+221
грибы 1336/5+598-475
лук 314/5+13
жир говяжий 100/5
банан 607-502+651-538
морковь 131
укроп зелень 5
&обед
банан 634-510+667-560
&ужин`

	, `#7нояб масса 59.7
семечки подсолнечника 151
боярышник 100
калина 50
&завтрак
морковь 79+81+69+151
картофель 214
лук 21
укроп зелень 4
грибы 612-475
&обед
бананы 683-526+613-504
&ужин`

	, `#8нояб масса 59.7
виноград 54+638-483
огурцы 34
манго 976-551
банан 630-537
слива 21+43
лук 14+97-84+81-48
укроп зелень 5
помидоры 652-468+695-463
огурец 20
&завтрак
арбуз 4635-752-(633-52+558-49)
&обед
лук 48-15
помидоры 212
яблоко 687-492
банан 649-560+715-626
&ужин`

	, `#9нояб масса 59.7
арбуз 739-(599-50)+3949-2969
яблоко 196
&завтрак
арбуз 2969-313-(843-50)
картофель 222
грибы 194
лук 63
мандарин 637-495+661-528
&обед
мандарин 1156-639
банан 805-703+873-769
&ужин`

	, `#10нояб масса 59.9
арбуз 759-461-333+49+977+3272-1955-646
&завтрак
арбуз 1955-1308+646
чеснок 524-477
бананы 662-512
&обед
картофель 219
огурцы 201
&ужин`

	, `#11нояб масса 60.1
картофель 213
свинина вырезка 204
орляк 944/7
лук 321/7
морковь 301/7
жир говяжий 139/7
груши 1068-467
&завтрак
косточки арбуза 44-(39-17)
картофель 208
сосиски 74
&обед
&ужин`

	, `#12нояб масса 59.5
картофель 209
сосиски 62
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
помидор 92
салат фриллис 83
лук 21
жир говяжий 210
виноград 864-648+1087-658
&завтрак
сыр плавленый 40 бжу 8 20 9 животный белок/жир 1 1 b12 0.4
слива 100-5
киви 64-5
мандарин 780-572+756-540
банан 704-517
груши 749-464
виноград 878-647+1001-678
&обед
&ужин`

	, `#13нояб масса 60
нектарины 623-502
яблоко 778-526
хурма 435-110
редька чёрная 79
&завтрак
картофель 225
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
редька зелёная 111+65
виноград 862-648
яблоко 171
&обед
&ужин`

	, `#14нояб масса 59.6
картофель 112
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
яблоко 94
виноград 967-647
&завтрак
картофель 112
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
перец болгарский 650-521
лук 35-7
виноград 848-647+807-645
&обед
виноград 849-647
&ужин`

	, `#15нояб масса 58.9
картофель 232/2
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
лук 7
морковь 78+108
виноград 848-644
&завтрак
картофель 232/2
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
морковь 121
виноград 866-642+807-644
&обед
морковь 101
виноград 880-644
&ужин`

	, `#16нояб масса 58.8
картофель 232/2
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
киви 814-640
гранат 750-628+823-605
хурма 627-465
&завтрак
картофель 232/2
орляк 944/14
лук 321/14
морковь 301/14
жир говяжий 139/14
манго 797-532
гранат 889-586
мандарин 808-558
&обед
&ужин`

	, `#17нояб масса 58.6
картофель 232/2
орляк 944/14*4/3
лук 321/14*4/3
морковь 301/14*4/3
жир говяжий 139/14*4/3
груша 782-468+783-663
гранат 726-553+712-518
яблоко 663-520
&завтрак
картофель 232/2
орляк 944/14*4/3
лук 321/14*4/3
морковь 301/14*4/3
жир говяжий 139/14*4/3
лук 38-19
помидоры 611-469
груша 803-477
&обед
&ужин`

	, `#18нояб масса 59.1
картофель 210/2
орляк 944/14*4/3
лук 321/14*4/3
морковь 301/14*4/3
жир говяжий 139/14*4/3
курица 969-(1194-767)
хурма 1127-769
манго 769-663
&завтрак
картофель 210
жир говяжий .35*607/2
мандарины 944-561
хурма 758-578
&обед
&ужин`

	, `#19нояб масса 58.8
жир говяжий .35*607/2
курица 663-523
творог 9% 170
ветчина 160 бжу 22.6 20.9 0 животный белок/жир 1 1 b12 0.4
авокадо 775-687
ряженка 417-25
хурма 721-473
сырок творожный глазированный 45 бжу 7.5 23.1 36.1 животный белок/жир .5 .5 b12 1
дымовица 160-20 бжу 13 5 0 животный белок/жир 1 1 b12 0.5
гранат 852-551
&завтрак
киви 660-533+719-491
курица 200
творог 9% 756-461
&обед
мандарины 854-526+842-576
&ужин`

	, `#20нояб масса 59.3
картофель 221/2
огурцы 605-500
помело 1459-925
рёбра копчёно-варёные 354-157 бжу 9 33 0 животный белок/жир 1 1 b12 1.08
хурма 571-464
айва 787-469
&завтрак
картофель 221/2
огурцы 579-478+10
помело 878-502
огурцы 173
помидоры 148
перец болгарский73-25
лук 51-7
&обед
&ужин`

	, `#21нояб масса 59.9
картофель 214/2
скумбрия в масле 704-539 бжу 14.4 28.9 0 животный белок/жир 1 .5 b12 12
свекла 1449-1335+1322-1156
салат фриллис 537-497+30
хурма 629-467
манго 776-511+773-518
авокадо 673-594
творог 5% 300 бжу 16 5 3 животный белок/жир 1 1 b12 1.32
&завтрак
картофель 214/2
огурцы 390-309
лук 5
свекла 1151-1000
морковь 131
&обед
свекла 92
яблоко 732-477+651-588
хурма 1353-796
&ужин`

	, `#22нояб масса 59.9
картофель 107*2
огурцы 1111-922
хурма 1436-845
рёбра копчёно-варёные 1294-1198 бжу 9 33 0 животный белок/жир 1 1 b12 1.08
яйцо 2с2
лук зелёный 9
яблоко 1005-771
&завтрак
картофель 226
кабачковая икра 591-480
хурма 673-471
салат фриллис 230-166
банан 154-53+160-48
огурцы 923-813
хурма 770-477
&обед
&ужин`

	, `#23нояб масса 60.5
рёбра копчёно-варёные 963-924 бжу 9 33 0 животный белок/жир 1 1 b12 1.08
айва 204
хурма 109-11
огурцы 114
помидоры 115
перец болгарский 67
укроп зелень 25+18
лук зеленый 43
апельсин 843-602
&завтрак
картофель 210
скумбрия в масле 527-452 бжу 14.4 28.9 0 животный белок/жир 1 .5 b12 12
яблоко 699-473+849-477
лук зелёный 21
яйцо 2с1
&обед
&ужин`

	, `#24нояб масса 60.3
рёбра копчёно-варёные 996-935 бжу 9 33 0 животный белок/жир 1 1 b12 1.08
груша 151+201+681-467
мандарин 269+658-526
апельсин 49
перец болгарский 95
лук зеленый 24+85-52
помидоры 610+166-514
персики в собственном соку 1078-552 бжу .5 .5 14 клетчатка 1.3
банан 134-37+137-38+275-81
&завтрак
&обед
&ужин`

	, `#25нояб масса 59.6
курица 1101-(322-46)-123
банан 1158-680
мандарин 1152-568
говядина 341
&завтрак
курица 1548-906-(287-50)
хурма 1058-475+1045-470
&обед
&ужин`

	, `#26нояб масса 60.3
курица 729-(273-48)
манго 805-530
хурма 714-466
лук зеленый 65-32
петрушка 33-17
помидоры 879-563
&завтрак
хурма 851-477
мандарины 708-496
&обед
&ужин`

	, `#27нояб масса 60.2
курица 1072-907-(119-48)+1674-906-304+119
яблоко 606-464
хурма 1299-459-18
&завтрак
помидоры 686-464
лук зеленый 85-40
&обед
мандарин 159+77
виноград 108
&ужин`

	, `#28нояб масса 60.1
рёбра копчёно-варёные 40 бжу 9 33 0 животный белок/жир 1 1 b12 1.08
скумбрия в масле 50 бжу 14.4 28.9 0 животный белок/жир 1 .5 b12 12
арбуз 3047-(1262-47)+5925-3382-842+48
&завтрак
&обед
&ужин`

	, `#29нояб масса 59.6
курица 217
яйцо 1c1
арбуз 3764-2537-464+46+2537-1014-621+49+1012-466-(349-48)
киви 57-5
фейхоа 37+673-509
&завтрак
перец болгарский 54
помидоры 756-468
лук зеленый 72-12
манго 1015-584
фейхоа 690-505
&обед
&ужин`

	, `#30нояб масса 59.8
скумбрия в масле 404-271 бжу 14.4 28.9 0 животный белок/жир 1 .5 b12 12
арбуз 4596-1795-1024+48
курица 149
хурма 755-467
помидоры 717-487
лук зеленый 8
лук 74-45
&завтрак
арбуз 1024+431+1477-461-1201+48
&обед
&ужин`

	, `#1дек масса 59.1
арбуз (3840-1533+48)/2
&завтрак
арбуз (3840-1533+48)/2
яйцо 4с1
лук 33
макароны 100
вода 245
кабачковая икра 477-393
груша 650-485
&обед
&ужин`

	, `#2дек масса 59.3
макароны 100
вода 245
кабачковая икра 393-283
мандарины 818-539
киви 590-512
яблоко 790-517
молоко 3.2% 399-43
&завтрак
семечки подсолнечника 10
банан 608-495
хурма 1103-523
яблоко 769-488
&обед
&ужин`

	, `#3дек масса 59.9
картофель 233-61
грибы 754-525-(111-79)
лук 111-79
яблоко 703-488
&завтрак
курица 1498-906-(175-49)
мандарины 809-540+835-550
хурма 1086-506
&обед
помидоры 795-553
огурцы 49
виноград 1349-987
хурма 1024-501
&ужин`

	, `#4дек масса 60.6
грибы 657-511
картофель 230
лук 78-55
хурма 1172-817+771-491
курица 872-162+50 бжу 14 28 0 b12 0.31
мандарины 813-549
&завтрак
мандарины 1094-929
виноград 1350-978+1274-1019
&обед
арахис неочищенный сырой 11
хурма 896-521
мандарины 885-549
&ужин`

	, `#5дек масса 62
картофель 227
огурцы 1594-1357
чеснок 1357-1331
&завтрак
котлета по киевски 71 бжу 17.9 23 3.2 b12 .2
мандарины 983-736
яблоко 261
хурма 1223-510
&обед
яйцо 3с1
лук 54-34
мандарины 931-586
&ужин`

	, `#6дек масса 61.3
картофель 232
огурцы 1328-1127
мандарины 639-589
&завтрак
говядина 678-186+51
хурма 1095-495
&обед
апельсин 677-529+850-591+964-580+900-642
яблоко 94
&ужин`

	, `#7дек масса 60.9
почки свиные 482/2
/вода от почек/сердца свиного
&завтрак
почки свиные 482/2
макароны 100
помидоры 784-502
мандарины 894-580+872-631
&обед
хурма 1676-502
&ужин`

	, `#8дек масса 60.7
макароны 100
вода 140
сердце свиное 710/2
помидоры 720-511
&завтрак
яблоко 806-532
помидор 68
&обед
виноград 1262-674
мандарины 942-669
&ужин`

	, `#9дек масса 60.8
картофель 226
огурцы 1119-918
хурма 98
&завтрак
макароны 100
вода 140
сердце свиное 710/2
апельсин 1280-1029+943-655
мандарин 835-635
&обед
хурма 1161-498
виноград 483-229
&ужин`

	, `#10дек масса 60
макароны 100
вода 140
кабачковая икра 282-210
помидоры 836-695
виноград 545-325
&завтрак
говядина 1051/3
лук 28-14
помидоры 695-539+718-542+693-506
&обед
хурма 1235-496
мандарины 756-549
&ужин`

	, `#11дек масса 60.9
горбуша 535-481
картофель 240
огурцы 86
говядина (460-296)*1051/891
помидоры 747-525
лук 11
мандарины 863-669
&завтрак
говядина 1051/3-(460-296)*1051/891
мандарины 934-604
апельсины 885-658
&обед
хурма 1160-498
апельсин 790-539
&ужин`

	, `#12дек масса 60.7
стрипсы 85 бжу 24.9 12.4 8 животный белок/жир .7 .3 b12 .34
говядина 1051/6
яблоко 851-585
&завтрак
говядина 1051/6
яблоко 676-505
мандарины 736-615
апельсин 888-667
&обед
хурма 1103-498
мандарины 771-537+681-572
&ужин`

	, `#13дек масса 60.4
яйцо 2со
грибы 165
огурцы 182-97
лук 75-39
яблоко 212-4
&завтрак
яйцо 2со
грибы 916-849
квашеная капуста 627-515
помидоры 111
огурцы 97
лук 39+59-51
яблоко 170
&обед
яйцо 2со
лук 51-40
хурма 1117-502
мандарин 664-572
&ужин`

	, `#14дек масса 60.4
грибы 89
яйцо 2со
лук 40-18
мандарины 1028-794
киви 652-501
яблоко 101
&завтрак
грибы 109
яйцо 2с1
лук 18
мандарины 946-673
апельсин 804-587
&обед
грибы 79
яйцо 2с1
лук 163-134
огурец 192-77
помидор 95
яблоко 649-498
мандарины 880-658
&ужин`

	, `#15дек масса 60.6
грибы 100
яйцо 2с1
лук 134-118
киви 844-508
мандарины 785-614
&завтрак
грибы 103
яйцо 2с1
масло подсолнечное рафинированное 1
лук 118-102
киви 789-513
мандарины 878-609+1
&обед
грибы 98
яйцо 1с0
яйцо 1с1
масло подсолнечное рафинированное 3
лук 118-63
огурцы 75
помидоры 665-485
мандарины 903-707
апельсин 959-903
яблоко 137
грейпфрут 692-555
&ужин`

	, `#16дек масса 60.4
квашеная капуста 82
огурцы 554-529
помидоры 175
яйцо 2с1
лук зелёный 103-49
мандарины 1011-696
&завтрак
квашеная капуста 110
смесь листовых овощей 121-63 бжу 1.5 .2 2 клетчатка 1.2
говядина 100
яблоко 580-486
мандарины 995-639
&обед
говядина 100
хурма 1091-510
мандарин 678-518
яблоко 247
&ужин`

	, `#17дек масса 60.3
квашеная капуста 132
помидоры 724-495
лук зеленый 20
смесь листовых овощей 60+131-98 бжу 1.5 .2 2 клетчатка 1.2
сыр чанах 100 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
мандарин 1203-904
&завтрак
квашеная капуста 110
говядина 50
сыр чанах 52 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
помидоры 812-609
лук зеленый 25-12
смесь листовых овощей 98-36 бжу 1.5 .2 2 клетчатка 1.2
мандарины 724-531
яблоко 746-531
&обед
хурма 679-485+1014-493
мандарины 821-567+977-584+1012-600+912-680
арахис неочищенный сырой 550-543+251-217+271-242+227-206
грецкий орех 374-365+355-284
&ужин`

	, `#18дек масса 61.1
&завтрак
помидоры 691-502
огурцы 103
лук зеленый 7
лук 61-33
смесь листовых овощей 34 бжу 1.5 .2 2 клетчатка 1.2
говядина 100+654-397
яблоко 230
&обед
яйцо 1с0
лук 3
мандарины 1247-1007
апельсин 1007-855
хурма 840-485
&ужин`

	, `#19дек масса 59.6
помидор 956-573
сыр чанах 48 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
сосиски 117 бжу 10 19 0 b12 0.6 животный белок/жир 1 1
&завтрак
помидор 914-619
сыр чанах 48 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
сосиски 125 бжу 10 19 0 b12 0.6 животный белок/жир 1 1
&обед
квашеная капуста 78
яйцо 1с1
лук 28-11
мандарины 942-732
яблоко 600-504
хурма 806-798+795-486+1097-497
&ужин`

	, `#20дек масса 60.2
помидоры 858-489
сыр чанах 100 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
мандарины 980-705
апельсин 684-583
&завтрак
огурцы 814-488
сыр чанах 104-37 бжу 21 26 0 b12 1.5 животный белок/жир 1 1
яблоко 916-710
груша 710-555
&обед
квашеная капуста 103
лук 10
мойва (2401-2018-91)*1641/1501
хурма 1640-530+657-481+1082-510
мандарины 910-568
&ужин`

	, `#21дек масса 60.8
квашеная капуста 104
руккола 94-52
лук 142-129
говядина 115
мойва (2018-32-1710)*1641/1501-115
мандарины 979-645
&завтрак
квашеная капуста 109
лук 129-107
руккола 62-40
петрушка 109-97
айва 1013-951+623-512
яблоко 951-623
&обед
квашеная капуста 101
лук 107-90
петрушка 97-79
хурма 1148-505
мандарины 944-556
&ужин`

	, `#22дек масса 60.5
мойва 150*1641/1501
квашеная капуста 660-513
петрушка 79-50
лук 90-57
яблоко 876-518
семечки подсолнечника 20
&завтрак
мойва 98*1641/1501
яблоко 1298-1067
мандарины 1067-617
семечки подсолнечника 10
&обед
мойва 102*1641/1501
огурцы 203
помидоры 200
лук 57-13
петрушка 50-11
мандарины 1000-598+727-596+917-657
грецкий орех 293-246+469-434+384-330+282-234
фундук 283-243+326-302
апельсин 834-528
&ужин`

	, `#23дек масса 61
мойва 101*1641/1501
&завтрак
мойва 100*1641/1501
яблоко 173
апельсин 1395-907
&обед
курица 85*1446/1240
говядина 36*1446/1240
яблоко 788-514
мандарины 923-709+996-679+797-582
кедровый орех 251-235+212-205
фундук 382-305+347-289+329-271
&ужин`

	, `#24дек масса 60.3
мойва 100*1641/1501
лук 12
петрушка 5
огурец 126
помидор 757-574
груша 924-874
мандарины 874-740
апельсин 740-662
ананас 335-19
&завтрак
мойва 119*1641/1501
помидоры 726-484
лук 230-184
яблоко 710-488
мандарины 810-594
&обед
говядина 105*1446/1240
помидоры 114
огурцы 601-498
лук 184-139
мандарины 961-594
яблоко 169+195
&ужин`

	, `#25дек масса 60.7
говядина 100*1446/1240
яблоко 219
апельсин 740-535
&завтрак
говядина 98*1446/1240
лук 139-111
огурцы 65
помидоры 584-494
яблоко 287
мороженое 581-489 бжу 3.5 14 44 b12 0.4 животный белок/жир 1 1
хурма 505
&обед
говядина 94*1446/1240
лук 111-66
огурцы 128
помидоры 230
яблоко 347+291
мандарин 51+877-614
хурма 590
апельсин 730-538
&ужин`

	, `#26дек масса 60.9
котлета 136 бжу 12 35 0 b12 2
&завтрак
говядина 96*1446/1240
мандарины 1096-881
яблоко 256
&обед
говядина 91*1446/1240
огурцы 649-494
лук 66-31
мандарины 1206-771+796-596+833-700
апельсин 1064-698+895-652
яблоко 219+174
&ужин`

	, `#27дек масса 60.9
филе куриной грудки 182
помидор 16
слива 28-4
яблоко 205
&завтрак
говядина 92*1446/1240
мандарины 1000-672
яблоко 213
&обед
хурма 145-27
мандарины 797-555
яблоко 299
&ужин`

	, `#28дек масса 59.9
говядина 89*1446/1240
мандарины 976-733
груши 1102-976
&завтрак
говядина 93*1446/1240
мандарины 1056-760
яблоко 693-509
огурцы 158
лук 27
&обед
говядина 93*1446/1240
мандарины 1048-743
груша 251
яблоко 754-537
&ужин`

	, `#29дек масса 59.7
говядина (1047-906)*1446/1240
тёма биотворог 95 бжу 7.6 4 10.6 b12 0.5 животный белок/жир 1 1
сметана 15% 146-13
&завтрак
мандарины 1193-817
апельсин 817-719+1195-1162
грейпфрут 1162-1022
&обед
говядина 150*722/1005*1005/841
лук 150*283/1005*1005/841
мандарины 909-786
апельсин 786-727
яблоко 889-637+801-512
&ужин`

	, `#30дек масса 59.7
говядина 151*722/841
лук 151*283/841
мандарины 890-627
груша 875-622
яблоко 147
сыр классический брест-литовск 73
&завтрак
яблоко 816-537
мандарины 1124-821
&обед
говядина 154*722/841
лук 154*283/841
&ужин`

	, `#31дек масса 59.4
говядина (370-196)*722/841
лук (370-196)*283/841
яблоко 490-6-0
&завтрак
холодец 155-49 бжу 13 20 0 животный белок/жир 1 1 b12 0.9
пельмени (755-454)*14/12 бжу 8.6 13.4 21.9 животный белок/жир .5 .28 b12 0.21 клетчатка 1.61
&обед
голубцы 978-446 бжу 14 9.6 2.4 b12 0.644
мандарины 196-47
яблоко 219
&ужин`

]