function load() {
	s = 'Список составлен на 1 января 2023 года. <a href="#ts">статистика колонок</a>'
	gs=gs.replaceAll('—','-')
	a = gs.split("\n")
	t = a[0].toLowerCase().split(';').slice(1)
	t.push('мин(г1,<br>г2)')
	t[3] = 'год1';//начало -> начало1
	t[6] = 'год2';//начало -> начало2
	// t[3]+=1;//начало -> начало1
	// t[6]+=2;//начало -> начало2
	sp = e => e.substr(1).trim().split(';')

	d = []
	a.forEach((e, i, a) => {
		if (!e.match(/^;(?!;)/)) {
			return
		}
		b = sp(e);

		if (b[0] == 'Йемен') {
			//take from next string
			b = sp(a[i + 1]);
			b[0] = 'Йемен';
		}
		else {
			//add from next string
			if (i < a.length - 1 && /^;;/.test(a[i + 1])) {
				c = sp(a[i + 1])[1];
				if (c.length) {
					//console.log(c)
					b[1] += ' ' + c.trim().toLowerCase();
				}
			}
		}

		for (i = 0; i < 6; i++) {
			if (i == 3) {
				continue;
			}
			b[i] = long(b[i].replace(/\[\d+\]/g, ''));
		}

		b[3] = Number(b[3] || b[6])
		b[6] = Number(b[6])
		b.push(Math.min(b[3], b[6]))
		d.push(b)
	})

	s += new Table(t, d, {o:"cnbs0", class: 't' }).html()
	+'<table id="ts"><tr>'

	for(c=0;c<t.length;c++){
		if([2,5].includes(c)){
			continue
		}
		m=new Map()
		//There are 'Председатель Правительства' and 'Председатель правительства' so use toLowerCase
		d.forEach(e=>{
			b=e[c]
			if(Array.isArray(b)){
				o=b[0]
				b=b[1]
			}
			else{
				o=b
			}
			if(c){
				if(typeof b=='string'){
					b=b.toLowerCase()
				}
			}
			else{
				o=b=b.substr(0,1).toLowerCase()//store lowercases
			}
			j = m.get(b)
			m.set(b, j ? [j[0] + 1, j[1]] : [1, o])
		})
		a=[]
		m.forEach((v,k)=>a.push([[v[1],k],v[0]]))
		if(!c){
			b=[]
			for(i='а'.charCodeAt(0);i<='я'.charCodeAt(0);i++){
				j=String.fromCharCode(i)
				if(!m.get(j)){
					b.push(j)
				}
			}
			s1='<p style="max-width:200px">Буквы с которых не начинаются страны: '+b.join(', ')+'.'
		}
		
		co=[]
		co[1]=["1 0","1d 0"]

		s+='<td>'+new Table([c?t[c].replace('<br>',''):span('1-ая буква страны',75),'кол-во'], a, {o:"cnbas11",class:"tc"} ,co).html()
		if(!c){
			s+=s1
		}
	}

	el('p').innerHTML = s +'</table>'
	// +t1.html()


}

function long(s){
	const c = 30
	let l = 100 * c / s.length
	return l < 100? [span(s, l), s]:s
}

function span(s,percent){
	return '<span style="font-size:'+percent.toFixed(0)+'%">'+s+'</span>'
}

/*copy from https://ru.wikipedia.org/wiki/Список_действующих_глав_государств_и_правительств 
and pasted to excel then stored to csv file*/
gs=`Флаг;Страна;Глава государства;Имя;Начало;Глава правительства;Имя;Начало
;Австрия;Президент;Александр Ван дер Беллен;2017;Канцлер;Карл Нехаммер;2021
;;;нем. Alexander Van der Bellen;;;нем. Karl Nehammer;
;Албания;Президент;Байрам Бегай;2022;Премьер-министр;Эди Рама;2013
;;;алб. Bajram Begaj;;;алб. Edi Rama;
;Андорра;Князь-соправитель;Жоан Энрик Вивес-и-Сисилья;2003;Премьер-министр;Хавьер Эспот Самора;2019
;;;кат. Joan Enric Vives i Sicília;;;кат. Xavier Espot Zamora;
;;Представитель;Жозеп Мария Маури;2012;;;
;;;кат. Josep Maria Mauri;;;;
;;Князь-соправитель;Эмманюэль Макрон;2017;;;
;;;фр. Emmanuel Macron;;;;
;;Представитель;Патрик Стшода;2017;;;
;;;фр. Patrick Strzoda;;;;
;Белоруссия;Президент;Александр Лукашенко;1994;Премьер-министр;Роман Головченко;2020
;;;белор. Аляксандр Лукашэнка;;;белор. Раман Галоўчанка;
;Бельгия;Король;Филипп;2013;Премьер-министр;Александр Де Кро;2020
;;;фр. Philippe;;;фр. Alexander De Croo;
;Болгария;Президент;Румен Радев;2017;Премьер-министр;Гылыб Донев;2022
;;;болг. Румен Радев;;;болг. Гълъб Донев;
;Босния и Герцеговина;Председатель Президиума[1];Желька Цвиянович;2022;Премьер-министр;Зоран Тегелтия;2019
;;;серб. Жељка Цвијановић;;;серб. Зоран Тегелтија;
;;Члены Президиума;Денис Бечирович  (босн.)рус.;2022;;;
;;;босн. Denis Bećirović;;;;
;;;Желько Комшич;2018;;;
;;;хорв. Željko Komšić;;;;
;Ватикан;Папа Римский;Франциск;2013;Государственный секретарь;Пьетро Паролин;2013
;;;;;;итал. Pietro Parolin;
;;;лат. Franciscus;;;;
;;Председатель Губернаторства;Фернандо Вергес Альсага;2021;;;
;;;исп. Fernando Vérgez Alzaga;;;;
;Великобритания;Король;Карл III;2022;Премьер-министр;Риши Сунак;2022
;;;англ. Charles III;;;англ. Rishi Sunak;
;Венгрия;Президент;Каталин Новак;2022;Премьер-министр;Виктор Орбан;2010
;;;венг. Novák Katalin;;;венг. Orbán Viktor;
;Германия;Президент;Франк-Вальтер Штайнмайер;2017;Канцлер;Олаф Шольц;2021
;;;нем. Frank-Walter Steinmeier;;;нем. Olaf Scholz;
;Греция;Президент;Катерина Сакелларопулу;2020;Премьер-министр;Кириакос Мицотакис;2019
;;;греч. Αικατερίνη Σακελλαροπούλου;;;греч. Κυριάκος Μητσοτάκης;
;Дания;Королева;Маргрете II;1972;Премьер-министр;Метте Фредериксен;2019
;;;;;;дат. Mette Frederiksen;
;;;дат. Margrethe II;;;;
;Ирландия;Президент;Майкл Хиггинс;2011;Премьер-министр;Лео Варадкар;2022
;;;ирл. Micheál Ó hUigínn;;;ирл. Leo Varadkar;
;Исландия;Президент;Гвюдни Йоуханнессон;2016;Премьер-министр;Катрин Якобсдоттир;2017
;;;исл. Guðni Jóhannesson;;;исл. Katrín Jakobsdóttir;
;Испания;Король;Филипп VI;2014;Премьер-министр;Педро Санчес;2018
;;;исп. Felipe VI;;;исп. Pedro Sánchez;
;Италия;Президент;Серджо Маттарелла;2015;Премьер-министр;Джорджа Мелони;2022
;;;итал. Sergio Mattarella;;;итал. Giorgia Meloni;
;Косово;Президент;Вьоса Османи;2021;Премьер-министр;Альбин Курти;2021
;;;алб. Vjosa Osmani;;;алб. Albin Kurti;
;Латвия;Президент;Эгилс Левитс;2019;Премьер-министр;Кришьянис Кариньш;2019
;;;латыш. Egils Levits;;;латыш. Krišjānis Kariņš;
;Литва;Президент;Гитанас Науседа;2019;Премьер-министр;Ингрида Шимоните;2020
;;;лит. Gitanas Nausėda;;;лит. Ingrida Šimonytė;
;Лихтенштейн;Князь;Ханс-Адам II;1989;Премьер-министр;Даниэль Риш;2021
;;;нем. Hans-Adam II;;;нем. Daniel Risch;
;;Князь-регент;Алоиз;2004;;;
;;;нем. Alois;;;;
;Люксембург;Великий герцог;Анри;2000;Премьер-министр;Ксавье Беттель;2013
;;;люксемб. Henri;;;люксемб. Xavier Bettel;
;Мальта;Президент;Джордж Велла;2019;Премьер-министр;Роберт Абела;2020
;;;мальт. George Vella;;;мальт. Robert Abela;
;Молдавия;Президент;Майя Санду;2020;Премьер-министр;Наталья Гаврилица;2021
;;;молд. Maia Sandu;;;молд. Natalia Gavrilița;
;Монако;Князь;Альбер II;2005;Государственный министр;Пьер Дарту;2020
;;;;;;фр. Pierre Dartout;
;;;фр. Albert II;;;;
;Нидерланды;Король;Виллем-Александр;2013;Премьер-министр;Марк Рютте;2010
;;;нидерл. Willem-Alexander;;;нидерл. Mark Rutte;
;Норвегия;Король;Харальд V;1991;Премьер-министр;Йонас Гар Стёре;2021
;;;норв. Harald V;;;норв. Jonas Gahr Støre;
;Польша;Президент;Анджей Дуда;2015;Премьер-министр;Матеуш Моравецкий;2017
;;;польск. Andrzej Duda;;;польск. Mateusz Morawiecki;
;Португалия;Президент;Марселу Ребелу ди Соза;2016;Премьер-министр;Антониу да Кошта;2015
;;;порт. Marcelo Rebelo de Sousa;;;порт. António da Costa;
;Приднестровье;Президент;Вадим Красносельский;2016;Председатель Правительства;Александр Розенберг;2022
;Россия;Президент;Владимир Путин;2012;Председатель Правительства;Михаил Мишустин;2020
;Румыния;Президент;Клаус Йоханнис;2014;Президент Совета Министров;Николае Чукэ;2021
;;;рум. Klaus Iohannis;;;рум. Nicolae Ciucă;
;Сан-Марино;Капитаны-регенты;Мария Луиза Берти;;;;2022
;;;;;;;
;;;итал. Maria Luisa Berti;;;;
;;;Мануэль Чаватта;;;;
;;;итал. Manuel Ciavatta;;;;
;Северная Македония;Президент;Стево Пендаровский;2019;Премьер-министр;Димитар Ковачевский;2022
;;;макед. Стево Пендаровски;;;макед. Димитар Ковачевски;
;Сербия;Президент;Александр Вучич;2017;Председатель Правительства;Ана Брнабич;2017
;;;серб. Александар Вучић;;;серб. Ана Брнабић;
;Словакия;Президент;Зузана Чапутова;2019;Премьер-министр;Эдуард Хегер;2021
;;;словацк. Zuzana Čaputová;;;словацк. Eduard Heger;
;Словения;Президент;Наташа Пирц-Мусар;2022;Председатель Правительства;Роберт Голоб;2022
;;;словен. Nataša Pirc Musar;;;словен. Robert Golob;
;Украина;Президент;Владимир Зеленский;2019;Премьер-министр;Денис Шмыгаль;2020
;;;укр. Володимир Зеленський;;;укр. Денис Шмигаль;
;Финляндия;Президент;Саули Нийнистё;2012;Государственный министр;Санна Марин;2019
;;;фин. Sauli Niinistö;;;фин. Sanna Marin;
;Франция;Президент;Эмманюэль Макрон;2017;Премьер-министр;Элизабет Борн;2022
;;;фр. Emmanuel Macron;;;фр. Élisabeth Borne;
;Хорватия;Президент;Зоран Миланович;2020;Председатель Правительства;Андрей Пленкович;2016
;;;хорв. Zoran Milanović;;;хорв. Andrej Plenković;
;Черногория;Президент;Мило Джуканович;2018;Председатель Правительства;Дритан Абазович;2022
;;;черног. Мило Ђукановић;;;черног. Дритан Абазовић;
;Чехия;Президент;Милош Земан;2013;Председатель Правительства;Петр Фиала;2021
;;;чеш. Miloš Zeman;;;чеш. Petr Fiala;
;Швейцария;Президент[2];Иньяцио Кассис;;;;2022
;;;;;;;
;;;итал. Ignazio Cassis;;;;
;;Вице-президент;Ален Берсе;;;;2022
;;;фр. Alain Berset;;;;
;;Члены;Ули Маурер;;;;2008
;;Федерального;нем. Ueli Maurer;;;;
;;совета;Симонетта Соммаруга;;;;2010
;;;итал. Simonetta Sommaruga;;;;
;;;Ги Пармелен;;;;2016
;;;фр. Guy Parmelin;;;;
;;;Карин Келлер-Зуттер;;;;2019
;;;нем. Karin Keller-Sutter;;;;
;;;Виола Амерд;;;;2019
;;;нем. Viola Amherd;;;;
;Швеция;Король;Карл XVI Густав;1973;Государственный министр;Ульф Кристерссон;2022
;;;швед. Carl XVI Gustaf;;;швед. Ulf Kristersson;
;Эстония;Президент;Алар Карис;2021;Премьер-министр;Кая Каллас;2021
;;;эст. Alar Karis;;;эст. Kaja Kallas;
;;;;;;;
Азия[править | править код];;;;;;;
;;;;;;;
Флаг;Страна;Глава государства;Имя;Начало;Глава правительства;Имя;Начало
;Абхазия;Президент;Аслан Бжания;2020;Премьер-министр;Александр Анкваб;2020
;;;абх. Аслан Бжьаниа;;;абх. Алеқсандр Анқәаб;
;Азербайджан;Президент;Ильхам Алиев;2003;Премьер-министр;Али Асадов;2019
;;;азерб. İlham Əliyev;;;азерб. Əli Əsədov;
;Армения;Президент;Ваагн Хачатурян;2022;Премьер-министр;Никол Пашинян;2018
;;;арм. Վահագն Խաչատուրյան;;;арм. Նիկոլ Փաշինյան;
;Афганистан;Глава эмирата, амир аль-муминин;Хайбатулла Ахундзада;2021;И. о. премьер-министра;Мохаммад Хасан Ахунд;2021
;;;пушту ھیبت الله اخوندزاده‎;;;пушту محمد حسن اخوند‎;
;Бангладеш;Президент;Абдул Хамид;2013;Премьер-министр;Шейх Хасина Вазед;2009
;;;бенг. আব্দুল হামিদ;;;бенг. হাসিনা ওয়াজেদ;
;Бахрейн;Король;Хамад ибн Иса Аль Халифа;1999;Премьер-министр;Салман ибн Хамад ибн Иса Аль Халифа;2020
;;;араб. حمد بن عيسى آل خليفة‎;;;араб. سلمان بن حمد آل خليفة‎;
;Бруней;Султан и;Хассанал Болкиах;;;;1967
;;Премьер-министр;малайск. Hassanal Bolkiah;;;;
;Бутан;Король;Джигме Кхесар Намгьял Вангчук;2006;Премьер-министр;Лотай Церинг;2018
;;;дзонг-кэ འཇིགས་མེད་གེ་སར་རྣམ་རྒྱལ་དབང་ཕྱུག་;;;дзонг-кэ བློ་གྲོས་ཚེ་རིང;
;Восточный Тимор;Президент;Жозе Рамуш-Орта;2022;Премьер-министр;Таур Матан Руак;2018
;;;порт. José Ramos-Horta;;;порт. Taur Matan Ruak;
;Вьетнам;Генеральный секретарь Коммунистической партии;Нгуен Фу Чонг;;;;2011
;;;вьетн. Nguyễn Phú Trọng;;;;
;;Президент;Нгуен Суан Фук;2021;Премьер-министр;Фам Минь Тинь;2021
;;;вьетн. Nguyễn Xuân Phúc;;;вьетн. Phạm Minh Chính;
;Грузия;Президент;Саломе Зурабишвили;2018;Премьер-министр;Ираклий Гарибашвили;2021
;;;груз. სალომე ზურაბიშვილი;;;груз. ირაკლი ღარიბაშვილი;
;Израиль;Президент;Ицхак Герцог;2021;Премьер-министр;Биньямин Нетаньяху;2022
;;;ивр. ‏יצחק הרצוג‏‎;;;ивр. ‏בנימין נתניהו‏‎;
;Индия;Президент;Драупади Мурму;2022;Премьер-министр;Нарендра Моди;2014
;;;хинди द्रौपदी मुर्मू;;;хинди नरेन्द्र मोदी;
;Индонезия;Президент;Джоко Видодо;;;;2014
;;;индон. Joko Widodo;;;;
;Иордания;Король;Абдалла II;1999;Премьер-министр;Бишер аль-Хасауна;2020
;;;араб. عبد الله‎;;;араб. بشر الخصاونة‎;
;Ирак;Президент;Абдул Латиф Рашид;2022;Премьер-министр;Мохаммед Шиа ас-Судани;2022
;;;араб. عبد اللطيف رشيد‎;;;араб. محمد شياع السوداني‎;
;Иран;Высший руководитель;Али Хаменеи;1989;Президент;Ибрахим Раиси;2021
;;;перс. علی خامنه‌ای‎;;;перс. سید ابراهیم رئیسی‎;
;Йемен;Признанные мировым сообществом (Аден);;;;;
;;Президент;Ришад Мухаммед аль-Алими;2022;Премьер-министр;Маин Абдул-Малик Саид;2018
;;;араб. رشاد محمد العليمي‎;;;араб. معين عبدالملك سعيد الصبري‎;
;;Руководство хуситов (Сана);;;;;
;;Председатель Верховного Политического Совета;Махди аль-Машат;2018;Премьер-министр;Абдул Азиз бин Салех Хабтур;2016
;;;араб. مهدي المشاط‎;;;араб. عبد العزيز بن حبتور‎;
;Казахстан;Президент;Касым-Жомарт Токаев;2019;Премьер-министр;Алихан Смаилов;2022
;;;каз. Қасым-Жомарт Тоқаев;;;каз. Әлихан Смайылов;
;Камбоджа;Король;Нородом Сиамони;2004;Премьер-министр;Хун Сен;1985
;;;кхмер. នរោត្ដម សីហមុនី;;;кхмер. ហ៊ុន សែន;
;Катар;Эмир;Тамим бин Хамад Аль Тани;2013;Премьер-министр;Халид бин Халифа Аль Тани;2020
;;;араб. تميم بن حمد آل ثاني‎;;;араб. خالد بن خليفة بن آل ثاني‎‎;
;Кипр;Президент;Никос Анастасиадис;;;;2013
;;;греч. Νίκος Αναστασιάδης;;;;
;Киргизия;Президент;Садыр Жапаров;2021;И. о. председателя кабинета министров;Акылбек Жапаров;2021
;;;кирг. Садыр Жапаров;;;кирг. Акылбек Жапаров;
;Китай;Председатель;Си Цзиньпин;2013;Премьер Госсовета КНР;Ли Кэцян;2013
;;;кит. 习近平;;;кит. 李克强;
;Китайская Республика;Президент;Цай Инвэнь;2016;Председатель Исполнительного Юаня;Су Чжэньчан;2019
;;;кит. 蔡英文;;;кит. 蘇貞昌;
;Северная Корея;Высший руководитель и;Ким Чен Ын;;;;2011
;;Председатель Государственного Совета;кор. 김정은;;;;
;;Председатель Президиума Верховного Народного Собрания КНДР;Чхве Рён Хэ;2019;Председатель совета министров;Ким Док Хун;2020
;;;кор. 최룡해;;;кор. 김덕훈;
;Южная Корея;Президент;Юн Сок Ёль;2022;Премьер-министр;Хан Доксу;2022
;;;кор. 윤석열;;;кор. 한덕수;
;Кувейт;Эмир;Наваф аль-Ахмад ас-Сабах;2020;Премьер-министр;Ахмед аль-Наваф аль-Ахмед ас-Сабах;2022
;;;араб. نواف الأحمد الجابر الصباح‎;;;араб. ‎;
;Лаос;Президент;Тхонглун Сисулит;2021;Премьер-министр;Сонексай Сипхандон;2022
;;;лаос. ທອງລຸນ ສີສຸລິດ;;;лаос. ສອນ​ໄຊ ສີ​ພັນ​ດອນ;
;Ливан;И. о. президента;Наджиб Микати;2022;Премьер-министр;Наджиб Микати;2021
;;;араб. نجيب ميقاتي‎;;;араб. نجيب ميقاتي‎;
;Малайзия;Верховный правитель;Абдулла;2019;Премьер-министр;Анвар Ибрагим;2022
;;;малайск. Abdullah;;;малайск. Anwar Ibrahim;
;Мальдивы;Президент;Ибрагим Мохамед Солих;;;;2018
;;;мальд. އިބްރާހީމް މުޙައްމަދު ޞާލިޙު;;;;
;Монголия;Президент;Ухнаагийн Хурэлсух;2021;Премьер-министр;Лувсаннамсрайн Оюун-Эрдэнэ;2021
;;;монг. Ухнаагийн Хүрэлсүх;;;монг. Лувсаннамсрайн Оюун-Эрдэнэ;
;Мьянма;Временный президент;Мьин Шве;2021;Премьер-министр;Мин Аун Хлайн;2021
;;;бирм. မြင့်ဆွေ;;;бирм. မင်းအောင်လှိုင်;
;Нагорный Карабах (Арцах)[3];Президент;Араик Арутюнян;2020;Государственный министр;Рубен Варданян;2022
;;;арм. Արայիկ Հարությոնյան;;;арм. Ռուբեն Վարդանյան;
;Непал;Президент;Бидхья Деви Бхандари;2015;Премьер-министр;Пушпа Камал Дахал;2022
;;;;;;непальск. प्रचण्ड;
;;;;;;;
;;;непальск. विद्यादेवी भण्डारी;;;;
;Объединённые Арабские Эмираты;Президент;Мухаммад ибн Заид Аль Нахайян;2022;Премьер-министр;Мохаммед аль-Мактум;2006
;;;араб. محمد بن زايد آل نهيان‎;;;араб. محمد آل مكتوم‎;
;Оман;Султан и;Хейсам бен Тарик;;;;2020
;;Премьер-министр;араб. هيثم بن طارق آل سعيد‎‎;;;;
;Пакистан;Президент;Ариф Алви;2018;Премьер-министр;Шахбаз Шариф;2022
;;;урду عارف علوی‎;;;урду شہباز شریف‎;
;Палестина[4];Президент;Махмуд Аббас;2013;Премьер-министр;Мохаммад Штайех;2019
;;;араб. محمود عباس‎;;;араб. محمد اشتية‎;
;Саудовская Аравия;Король;Салман ибн Абдул-Азиз Аль Сауд;2015;Премьер-министр;Мухаммед ибн Салман Аль Сауд;2022
;;;араб. سلمان بن عبد العزيز‎;;;араб. محمد بن سلمان آل سعود‎;
;Северный Кипр;Президент;Эрсин Татар;2020;Премьер-министр;Унал Устель;2022
;;;тур. Ersin Tatar;;;тур. Ünal Üstel;
;Сингапур;Президент;Халима Якоб;2017;Премьер-министр;Ли Сяньлун;2004
;;;малайск. Halimah Yacob;;;кит. 李显龙;
;Сирия;Президент;Башар Асад;2000;И. о. премьер-министра;Хусейн Арнус;2020
;;;араб. بشار الأسد‎;;;араб. حسين عرنوس‎;
;Таджикистан;Президент;Эмомали Рахмон;1994;Премьер-министр;Кохир Расулзада;2013
;;;тадж. Эмомалӣ Раҳмон;;;тадж. Коҳир Расулзода;
;Таиланд;Король;Маха Вачиралонгкорн;2016;Премьер-министр;Прают Чан-Оча;2014
;;;тайск. มหาวชิราลงกรณ;;;тайск. ประยุทธ์ จันทร์โอชา;
;Туркмения;Президент;Сердар Бердымухамедов;;;;2022
;;;туркм. Serdar Berdimuhamedow;;;;
;Турция;Президент;Реджеп Тайип Эрдоган;;;;2014
;;;тур. Recep Tayyip Erdoğan;;;;
;Узбекистан;Президент;Шавкат Мирзиёев;2016;Премьер-министр;Абдулла Арипов;2016
;;;узб. Shavkat Mirziyoyev;;;узб. Abdulla Oripov;
;Филиппины;Президент;Бонгбонг Маркос;;;;2022
;;;тагальск. Bongbong Marcos;;;;
;Шри-Ланка;Президент;Ранил Викрамасингхе;2022;Премьер-министр;Динеш Гунавардена;2022
;;;синг. රනිල් වික්‍රමසිංහ;;;синг. දිනේෂ් ගුණවර්ධන;
;Южная Осетия;Президент;Алан Гаглоев;2022;Председатель правительства;Константин Джуссоев;2022
;;;осет. Алан Гаглойты;;;осет. Константин Джусойты;
;Япония;Император;Нарухито;2019;Премьер-министр;Фумио Кисида;2021
;;;яп. 徳仁;;;яп. 岸田 文雄;
;;;;;;;
Африка[править | править код];;;;;;;
;;;;;;;
Флаг;Страна;Глава государства;Имя;Начало;Глава правительства;Имя;Начало
;Алжир;Президент;Абдельмаджид Теббун;2019;Премьер-министр;Айман Бенабдеррахман;2021
;;;араб. عبد المجيد تبون‎;;;араб. أيمن بن عبد الرحمان‎‎;
;Амбазония;Президент;Марианта Нджомия;2022;Премьер-министр;вакансия;2022
;;;англ. Marianta Njomia;;;;
;Ангола;Президент;Жуан Лоренсу;;;;2017
;;;порт. João Lourenço;;;;
;Бенин;Президент;Патрис Талон;;;;2016
;;;фр. Patrice Talon;;;;
;Ботсвана;Президент;Мокветси Масиси;;;;2018
;;;англ. Mokgweetsi Masisi;;;;
;Буркина-Фасо;Глава Патриотического движения за сохранение и восстановление;Ибрагим Траоре;2022;Премьер-министр;Аполлинер Жоаким Кьелем де Тамбела;2022
;;;фр. Ibrahim Traore;;;фр. Apollinaire Joachim Kyélem de Tambéla;
;Бурунди;Президент;Эварист Ндайишимие;2020;Премьер-министр;Жерве Ндиракобуча;2022
;;;рунди и фр. Évariste Ndayishimiye;;;рунди и фр. Gervais Ndirakobuca;
;Габон;Президент;Али Бонго Ондимба;2009;Премьер-министр;Роз Рапонда;2020
;;;;;;фр. Rose Raponda;
;;;фр. Ali Bongo Ondimba;;;;
;Гамбия;Президент;Адама Бэрроу;;;;2017
;;;англ. Adama Barrow;;;;
;Гана;Президент;Нана Акуфо-Аддо;;;;2017
;;;англ. Nana Akufo-Addo;;;;
;Гвинея;Временный президент;Мамади Думбуя;2021;Премьер-министр;Бернар Гому;2022
;;;фр. Mamadi Doumbouya;;;фр. Bernard Gomou;
;Гвинея-Бисау;Президент;Умару Сисоку Эмбало;2020;Премьер-министр;Нуну Гомеш Набиам;2020
;;;порт. Umaro Sissoco Embaló;;;порт. Nuno Gomes Nabiam;
;Джибути;Президент;Исмаил Омар Гелле;1999;Премьер-министр;Абдулкадер Камил Мохамед;2013
;;;фр. Ismaïl Omar Guelleh;;;фр. Abdoulkader Kamil Mohamed;
;Египет;Президент;Абдул-Фаттах Ас-Сиси;2014;Премьер-министр;Мустафа Мадбули;2018
;;;араб. عبد الفتاح السيسي‎;;;араб. مصطفى مدبولي‎;
;Замбия;Президент;Хакаинде Хичилема;;;;2021
;;;англ. Hakainde Hichilema;;;;
;Западная Сахара;Президент;Брагим Гали;2016;Премьер-министр;Мохамед Вали Акейк;2018
;;;араб. إبراهيم غالي‎;;;араб. محمد والي أكيك‎;
;Зимбабве;Президент;Эммерсон Мнангагва;;;;2017
;;;англ. Emmerson Mnangagwa;;;;
;Кабо-Верде;Президент;Жозе Мария Невеш;2021;Премьер-министр;Улиссеш Коррейа-и-Сильва;2016
;;;порт. José Maria Neves;;;порт. Ulisses Correia e Silva;
;Камерун;Президент;Поль Бийя;1982;Премьер-министр;Джозеф Дион Нгуте;2019
;;;фр. Paul Biya;;;фр. Joseph Dion Ngute;
;Кения;Президент;Уильям Самои арап Руто;2022;Премьер-министр;Мусалия Мудавади;2022
;;;англ. и суахили William Samoei arap Ruto;;;англ. и суахили Musalia Mudavadi;
;Коморы;Президент;Азали Ассумани;;;;2016
;;;араб. غزالي عثماني‎;;;;
;Конго;Президент;Дени Сассу-Нгессо;1997;Премьер-министр;Анатоль Макоссо;2021
;;;фр. Denis Sassou Nguesso;;;фр. Anatole Collinet Makosso;
;ДР Конго;Президент;Феликс Чисекеди;2019;Премьер-министр;Жан-Мишель Сама Луконде;2021
;;;;;;фр. Jean-Michel Sama Lukonde;
;;;фр. Félix Tshisekedi;;;;
;Кот-д'Ивуар;Президент;Алассан Уаттара;2011;Премьер-министр;Патрик Аши;2021
;;;фр. Alassane Ouattara;;;фр. Patrick Achi;
;Лесото;Король;Летсие III;1996;Премьер-министр;Сэм Матекане;2022
;;;англ. Letsie III;;;англ. Sam Matekane;
;Либерия;Президент;Джордж Веа;;;;2018
;;;англ. George Weah;;;;
;Ливия;Председатель Президентского Совета;Мохаммад аль-Манфи;2021;Премьер-министр;Абдель Хамид Дбейба;2021
;;;араб. محمد يونس المنفي ‎;;;"араб. عبد الحميد الدبيبة‎;‎";
;Маврикий;Президент;Притвираджсинг Ропун;2019;Премьер-министр;Правинд Джагнот;2017
;;;англ. Pradeep Roopun;;;англ. Pravind Jugnauth;
;Мавритания;Президент;Мухаммед ульд Газуани;2019;Премьер-министр;Мохаммед Ульд Билал;2020
;;;араб. محمد ولد الشيخ محمد أحمد ولد الغزواني‎;;;араб. محمد ولد بلال‎;
;Мадагаскар;Президент;Андри Радзуэлина;2019;Премьер-министр;Кристиан Нтсай;2018
;;;малаг. Andry Rajoelina;;;малаг. Christian Ntsay;
;Малави;Президент;Лазарус Чаквера;;;;2020
;;;англ. Lazarus Chakwera;;;;
;Мали;Председатель Национального комитета спасения народа;Ассими Гоита;2021;Премьер-министр;Абдулай Майга;2022
;;;фр. Assimi Goita;;;фр. Abdoulaye Maïga;
;Марокко;Король;Мухаммед VI;1999;Премьер-министр;Азиз Аханнуш;2021
;;;араб. محمد‎;;;араб. عزيز أخنوش‎;
;Мозамбик;Президент;Филипе Ньюси;2015;Премьер-министр;Адриану Малеяни;2022
;;;порт. Filipe Nyusi;;;порт. Adriano Maleiane;
;Намибия;Президент;Хаге Гейнгоб;2015;Премьер-министр;Саара Куугонгельва-Амадхила;2015
;;;англ. Hage Geingob;;;англ. Saara Kuugongelwa;
;Нигер;Президент;Мохамед Базум;2021;Премьер-министр;Ухумуду Махамаду;2021
;;;;;;фр. Ouhoumoudou Mahamadou;
;;;фр. Mohamed Bazoum;;;;
;Нигерия;Президент;Мохаммаду Бухари;;;;2015
;;;англ. Muhammadu Buhari;;;;
;Руанда;Президент;Поль Кагаме;2000;Премьер-министр;Эдуар Нгиренте;2017
;;;руанда и англ. Paul Kagame;;;руанда и фр. Edouard Ngirente;
;Сан-Томе и Принсипи;Президент;Карлуш Вила-Нова;2021;Премьер-министр;Патрис Тровоада;2022
;;;порт. Carlos Vila Nova;;;порт. Patrice Trovoada;
;Сейшельские Острова;Президент;Уовел Рамкалаван;;;;2020
;;;фр. Wavel Ramkalawan;;;;
;Сенегал;Президент;Маки Салл;2012;Премьер-министр;Амаду Ба;2022
;;;фр. Macky Sall;;;фр. Amadou Ba;
;Сомали;Президент;Хасан Шейх Махмуд;2022;Премьер-министр;Хамза Абди Барре;2022
;;;сомал. Xasan Sheekh Maxamuud;;;сомал. Hamza Abdi Barre;
;Сомалиленд;Президент;Муса Бехи Абди;;;;2017
;;;араб. موسى بيهي عبدي‎;;;;
;Судан;Председатель Суверенного совета;Абдель Фаттах аль-Бурхан;2019;И. о. премьер-министра;Осман Хусейн Осман;2022
;;;араб. عبد الفتاح عبد الرحمن البرهان‎;;;;
;Сьерра-Леоне;Президент;Джулиус Маада Био;2018;Главный министр;Джейкоб Саффа;2021
;;;англ. Julius Maada Bio;;;англ. Jacob Jusu Saffa;
;Танзания;Президент;Самия Сулуху;2021;Премьер-министр;Кассим Маджалива;2015
;;;англ. Samia Suluhu;;;англ. Kassim Majaliwa;
;Того;Президент;Фор Гнассингбе;2005;Премьер-министр;Коми Селом Классу;2015
;;;фр. Faure Gnassingbé;;;фр. Komi Sélom Klassou;
;Тунис;Президент;Каис Саид;2019;Премьер-министр;Нажла Буден Ромдан;2021
;;;араб. قيس سعيد‎;;;араб. نجلاء بودن رمضان‎;
;Уганда;Президент;Йовери Мусевени;1986;Премьер-министр;Робина Наббанджа;2021
;;;англ. Yoweri Museveni;;;англ. Robinah Nabbanja;
;Центрально-Африканская Республика;Президент;Фостен-Арканж Туадера;2016;Премьер-министр;Феликс Молуа;2022
;;;фр. Faustin-Archange Touadéra;;;фр. Félix Moloua;
;Чад;Председатель Переходного военного совета;Махамат Деби;2021;Премьер-министр;Салех Кебзабо;2022
;;;фр. Mahamat Déby Itno;;;фр. Saleh Kebzabo;
;Экваториальная Гвинея;Президент;Теодоро Обианг Нгема Мбасого;1979;Премьер-министр;Франсиско Паскуаль Обама Асуе;2016
;;;исп. Teodoro Obiang Nguema Mbasogo;;;исп. Francisco Pascual Obama Asue;
;Эритрея;Президент;Исайяс Афеверки;;;;1993
;;;тигринья ኢሳይያስ ኣፈወርቂ;;;;
;Эсватини;Король;Мсвати III;1986;Премьер-министр;Клеопас Дламини;2021
;;;англ. Mswati III;;;англ. Cleopas Dlamini;
;Эфиопия;Президент;Сахле-Ворк Зевде;2018;Премьер-министр;Абий Ахмед Али;2018
;;;амх. ሳህለወርቅ ዘውዴ;;;амх. አብይ አህመድ አሊ;
;Южно-Африканская Республика;Президент;Сирил Рамафоса;;;;2018
;;;зулу Cyril Ramaphosa;;;;
;Южный Судан;Президент;Сальваторе Киир Маярдит;;;;2011
;;;англ. Salva Kiir;;;;
;;;;;;;
Америка[править | править код];;;;;;;
;;;;;;;
Флаг;Страна;Глава государства;Имя;Начало;Глава правительства;Имя;Начало
;Антигуа и Барбуда;Король;Карл III;2022;Премьер-министр;Гастон Браун;2014
;;;англ. Charles III;;;англ. Gaston Browne;
;;Генерал-губернатор;Родни Уильямс;2014;;;
;;;англ. Rodney Williams;;;;
;Аргентина;Президент;Альберто Фернандес;2019;Председатель Кабинета Министров;Хуан Луис Мансур;2021
;;;исп. Alberto Fernández;;;исп. Juan Luis Manzur;
;Багамы;Король;Карл III;2022;Премьер-министр;Филип Дэвис;2021
;;;англ. Charles III;;;англ. Philip Davis;
;;Генерал-губернатор;Корнелиус Смит;2019;;;
;;;англ. Cornelius Smith;;;;
;Барбадос;Президент;Сандра Мейсон;2021;Премьер-министр;Миа Моттли;2018
;;;англ. Sandra Mason;;;англ. Mia Mottley;
;Белиз;Король;Карл III;2022;Премьер-министр;Джонни Брисеньо;2020
;;;англ. Charles III;;;англ. Johnny Briceño;
;;Генерал-губернатор;Фройла Цалам;2021;;;
;;;англ. Froyla Tzalam;;;;
;Боливия;Президент;Луис Арсе;;;;2020
;;;исп. Luis Alberto Arce Catacora;;;;
;Бразилия;Президент;Жаир Болсонару;;;;2019
;;;порт. Jair Bolsonaro;;;;
;Венесуэла;Президент;Николас Мадуро;;;;2013
;;;исп. Nicolás Maduro;;;;
;Гаити;и. о. президента и премьер-министра;Ариэль Анри;;;;2021
;;;гаит. креольск. и фр. Ariel Henry;;;;
;Гайана;Президент;Ирфаан Али;2020;Премьер-министр;Марк Филлипс;2020
;;;англ. Irfaan Ali;;;англ. Mark Phillips;
;Гватемала;Президент;Алехандро Джамматтеи;;;;2020
;;;исп. Alejandro Giammattei;;;;
;Гондурас;Президент;Сиомара Кастро Сармьенто;;;;2022
;;;исп. Xiomara Castro Sarmiento;;;;
;Гренада;Король;Карл III;2022;Премьер-министр;Дикон Митчелл;2022
;;;англ. Charles III;;;англ. Dickon Mitchell;
;;Генерал-губернатор;Сесиль Ла Гренейд;2013;;;
;;;англ. Cécile La Grenade;;;;
;Доминика;Президент;Чарльз Саварин;2013;Премьер-министр;Рузвельт Скеррит;2004
;;;англ. Charles Savarin;;;англ. Roosevelt Skerrit;
;Доминиканская Республика;Президент;Луис Абинадер;;;;2020
;;;исп. Luis Abinader;;;;
;Канада;Король;Карл III;2022;Премьер-министр;Джастин Трюдо;2015
;;;англ. Charles III;;;англ. и фр. Justin Trudeau;
;;Генерал-губернатор;Мэри Саймон;2021;;;
;;;англ. и фр. Mary Simon;;;;
;Колумбия;Президент;Густаво Петро;;;;2022
;;;исп. Gustavo Petro;;;;
;Коста-Рика;Президент;Родриго Чавес Роблес;;;;2022
;;;исп. Rodrigo Chaves Robles;;;;
;Куба;Президент;Мигель Диас-Канель;2018;Председатель Совета Министров;Мануэль Марреро;2019
;;;исп. Miguel Díaz-Canel;;;исп. Manuel Marrero;
;Мексика;Президент;Андрес Мануэль Лопес Обрадор;;;;2018
;;;исп. Andrés Manuel López Obrador;;;;
;Никарагуа;Президент;Даниэль Ортега;;;;2007
;;;исп. Daniel Ortega;;;;
;Панама;Президент;Лаурентино Кортисо Коэн;;;;2019
;;;исп. Laurentino Cortizo Cohen;;;;
;Парагвай;Президент;Марио Абдо Бенитес;;;;2018
;;;исп. Mario Abdo Benítez;;;;
;Перу;Президент;Дина Болуарте;2022;Премьер-министр;Альберто Отарола;2022
;;;исп. Dina Boluarte;;;исп. Alberto Otárola;
;Сальвадор;Президент;Найиб Букеле;;;;2019
;;;исп. Nayib Bukele;;;;
;Сент-Винсент и Гренадины;Король;Карл III;2022;Премьер-министр;Ральф Гонсалвеш;2001
;;;англ. Charles III;;;англ. Ralph Gonsalves;
;;Генерал-губернатор;Сьюзен Дуган;2019;;;
;;;англ. Susan Dougan;;;;
;Сент-Китс и Невис;Король;Карл III;2022;Премьер-министр;Терренс Дрю;2022
;;;англ. Charles III;;;англ. Terrance Drew;
;;Генерал-губернатор;Тэпли Ситон;2015;;;
;;;англ. Tapley Seaton;;;;
;Сент-Люсия;Король;Карл III;2022;Премьер-министр;Филип Пьер;2021
;;;англ. Charles III;;;англ. Philip Pierre;
;;И. о. генерал-губернатора;Эррол Чарльз;2021;;;
;;;англ. Errol Charles;;;;
;Соединённые Штаты Америки;Президент;Джо Байден;;;;2021
;;;англ. Joseph Biden;;;;
;Суринам;Президент;Чан Сантохи;;;;2020
;;;нидерл. Chan Santokhi;;;;
;Тринидад и Тобаго;Президент;Пола-Мэй Уикс;2018;Премьер-министр;Кит Роули;2015
;;;англ. Paula-Mae Weekes;;;англ. Keith Rowley;
;Уругвай;Президент;Луис Альберто Лакалье Поу;;;;2020
;;;исп. Luis Alberto Lacalle Pou;;;;
;Чили;Президент;Габриэль Борич;;;;2022
;;;исп. Gabriel Boric Font;;;;
;Эквадор;Президент;Гильермо Лассо;;;;2021
;;;исп. Guillermo Lasso;;;;
;Ямайка;Король;Карл III;2022;Премьер-министр;Эндрю Холнесс;2016
;;;англ. Charles III;;;англ. Andrew Holness;
;;Генерал-губернатор;Патрик Аллен;2009;;;
;;;англ. Patrick Allen;;;;
;;;;;;;
Австралия и Океания[править | править код];;;;;;;
;;;;;;;
Флаг;Страна;Глава государства;Имя;Начало;Глава правительства;Имя;Начало
;Австралия;Король;Карл III;2022;Премьер-министр;Энтони Албаниз;2022
;;;англ. Charles III;;;англ. Anthony Albanese;
;;Генерал-губернатор;Дэвид Харли;2019;;;
;;;англ. David Hurley;;;;
;Вануату;Президент;Никенике Вуробараву;2022;Премьер-министр;Ишмаэль Калсакау;2022
;;;англ. Nikenike Vurobaravu;;;англ. Ishmael Kalsakau;
;Кирибати;Президент;Танети Маамау;;;;2016
;;;кириб. Taneti Mamau;;;;
;Маршалловы Острова;Президент;Дэвид Кабуа;;;;2020
;;;англ. David Kabua;;;;
;Микронезия;Президент;Дэвид Пануэло;;;;2019
;;;англ. David Panuelo;;;;
;Науру;Президент;Расс Кун;;;;2022
;;;англ. Russ Kun;;;;
;Ниуэ[5];Король;Карл III;2022;Премьер-министр;Далтон Тагелаги;2020
;;;англ. Charles III;;;англ. Dalton Tagelagi;
;;Генерал-губернатор[6];Синди Киро;2021;;;
;;;англ. Cindy Kiro;;;;
;Новая Зеландия;Король;Карл III;2022;Премьер-министр;Джасинда Ардерн;2017
;;;англ. Charles III;;;англ. Jacinda Ardern;
;;Генерал-губернатор;Синди Киро;2021;;;
;;;англ. Cindy Kiro;;;;
;Острова Кука[5];Король;Карл III;2022;Премьер-министр;Марк Браун;2020
;;;англ. Charles III;;;англ. Mark Brown;
;;Представитель короля;Том Марстерс;2013;;;
;;;англ. Tom Marsters;;;;
;Палау;Президент;Сурангель Уиппс;;;;2021
;;;англ. Surangel Whipps Jr.;;;;
;Папуа — Новая Гвинея;Король;Карл III;2022;Премьер-министр;Джеймс Марапе;2019
;;;англ. Charles III;;;англ. James Marape;
;;;Боб Дадае;2017;;;
;;Генерал-губернатор;англ. Bob Dadae;;;;
;Самоа;Верховный Вождь;Ваалетоа Суалауви II;2017;Премьер-министр;Наоми Матаафа;2021
;;;самоан. Va'aletoa Sualauvi II;;;самоан. Naomi Mataʻafa;
;Соломоновы Острова;Король;Карл III;2022;Премьер-министр;Манассе Согаваре;2019
;;;англ. Charles III;;;англ. Manasseh Sogavare;
;;Генерал-губернатор;Дэвид Вунаги;2019;;;
;;;англ. David Vunagi;;;;
;Тонга;Король;Тупоу VI;2012;Премьер-министр;Сиаоси Совалени;2021
;;;тонг. Tupou VI;;;тонг. Siaosi Sovaleni;
;Тувалу;Король;Карл III;2022;Премьер-министр;Каусеа Натано;2019
;;;англ. Charles III;;;англ. Kausea Natano;
;;Генерал-губернатор;Тофига Фалани;2021;;;
;;;англ. Tofiga Falani;;;;
;Фиджи;Президент;Уильям Катонивере;2021;Премьер-министр;Ситивени Рабука;2022
;;;фидж. Wiliame Katonivere;;;фидж. Sitiveni Rabuka;
`