const mass = 60
const title = ['продукт', 'белки', 'жиры', 'углеводы', 'ккал', 'б/ж', '%б/кк', 'р/гБелка', `руб/мес на ${mass}кг`, 'цена', 'масса', 'артикул'];
/*query
0 take data from ga array
1 make php query and output table
2 make php query and output string from query
*/
const query = isLocal() ? 0 : 0;//for remote always 0
const showArt = 0

const artIndex = title.indexOf('артикул')

function load() {
	if (!showArt) {
		title.splice(artIndex, 1)
	}
	if (query) {
		fetchpost('../php/siteupdate.php?globus_protein', {}, callback)
	}
	else {
		callback()
	}
}

function callback(s) {
	if (query == 2) {
		s = 'ga = ' + s
		navigator.clipboard.writeText(s).then(() => el('p').innerHTML = 'string copied to clipboard<br>' + el('p').innerHTML, () => alert('cann\'t copy to clipboard'))
	}
	else {
		try {
			a = query ? JSON.parse(s) : ga
			d = a.map(e => {
				[p, f, c, art, m, price] = e.slice(1)
				k = 4 * p + 9 * f + 4 * c
				n = price / (m / 100 * p)
				mm = n * mass * 30;//month money
				b = [...e.slice(0, 4), normalize(k, 1), f ? normalize(p / f, 2) : ['&infin;', Infinity],
				formatNumber(400 * p / k, 2), normalize(n, 2), [formatNumber(mm, 1), mm]
					, price, [formatNumber(m, 0), m], art]
				if (!showArt) {
					b.splice(artIndex, 1)
				}
				return b
			})
			s = new Table(title, d, "cns6d").html()
		}
		catch (ex) {
			console.log(ex)
			s += '<br>' + ex
		}

	}
	el('p').innerHTML = s
}

ga = [["Арахис натуральный Ваш выбор ядра, 500 г", 30, 43, 9, 768928004, 500, 229.99], ["Бедро цыплят-бройлеров охлажденное Первая Свежесть натуральное, 1 кг", 17, 13, 0.4, 6719005, 1000, 349.99], ["Голень индейки охлаждённая Индилайт, 1 кг", 16, 11, 0, 387157007, 1000, 385.99], ["Голень цыплят-бройлеров охлаждённая Петелинка с кожей, 1 кг", 19, 14, 0, 267711008, 1000, 325.99], ["Горох колотый шлифованный, 900 г", 23, 1.6, 48.1, 701938008, 900, 37.99], ["Грецкий орех Семушка в скорлупе, 500 г", 16, 52, 12, 726934009, 500, 399.99], ["Грудинка говяжья без кости, 1 кг", 17.6, 10.9, 0, 44670009, 1000, 929.9], ["Грудинка говяжья на кости, на подложке, 1 кг", 15.9, 18.9, 0, 44676001, 1000, 499.9], ["Грудка цыплёнка охлаждённая Домашняя птица, 1 кг", 18, 14, 0, 252406001, 1000, 499.99], ["Желатин пищевой Русский продукт Бакалея 101, 50 г", 87, 0, 0, 692958009, 50, 129.9], ["Йогурт греческий Teos 2%, 250 г", 8, 2, 4.2, 496410000, 250, 79.99], ["Йогурт питьевой Teos Active натуральный 2%, 260 г", 5.8, 2, 3, 727204002, 260, 76.99], ["Кальмар замороженный, филе, 1 кг", 18, 2, 2, 58976005, 1000, 599.99], ["Кефир Домик в деревне 1%, 900 г", 3, 1, 4, 358303006, 900, 99.99], ["Кости мясные свиные, 1 кг", 10, 22, 0, 113779008, 1000, 89.9], ["Креветки варёно-мороженые Polar 200_300 очищенные, 500 г", 17, 1, 1, 350685001, 500, 735.99], ["Лопатка свиная без кости, на подложке, 1 кг", 18.7, 6, 0, 44596002, 1000, 529.9], ["Минтай мороженый Ваш выбор обезглавленный, 1 кг", 16, 1, 0, 643735000, 1000, 198.99], ["Молоко пастеризованное Простоквашино отборное 3,4-4,5%, 930 мл", 2.9, 3.4, 4.7, 27688007, 930, 103.99], ["Окорок свиной без кости, на подложке, 1 кг", 17.8, 7.5, 0, 44590000, 1000, 529.9], ["Окунь замороженный, тушка, 1 кг", 18.5, 0.9, 0, 42385004, 1000, 399.99], ["Окунь замороженый, филе, 1 кг", 18.5, 0.9, 0, 79014007, 1000, 699.99], ["Печень говяжья охлажденная Мираторг, 1 кг", 18, 4, 0, 786555008, 1000, 579.99], ["Печень куриная охлаждённая Верхневолжская птицефабрика, 1 кг", 15, 10, 0, 438271003, 1000, 236.99], ["Печень свиная, 1 кг", 18.8, 3.8, 4.7, 622091004, 1000, 329.9], ["Протеин яичный сухой Волжанин со вкусом Ванильное мороженое, 750 г", 80, 0, 0, 789724005, 750, 1799.99], ["Ребрышки говяжьи на подложке, 1 кг", 15.9, 18.9, 0, 44671006, 1000, 499.9], ["Рулька свиная со шкурой, 1 кг", 12.1, 19.7, 0, 44628000, 1000, 249.9], ["Свиная шкурка, 1 кг", 18, 16, 0, 482515009, 1000, 11.9], ["Сельдь провесная тушка, 1 кг", 18.4, 15, 0, 93304651009, 1000, 549.9], ["Семечки подсолнечника сушёные в скорлупе, 1 кг", 21, 53, 11, 385771007, 1000, 259.99], ["Сыр полутвёрдый Тильзитер Радость вкуса Люкс 45%, 1 кг", 25.2, 26.3, 0, 265687008, 1000, 959.9], ["Творог Глобус 9 %, 180 г", 16, 9, 3, 777598007, 180, 82.99], ["Тунец Глобус кусками в собственном соку, 185 г", 24, 0.5, 0, 278056006, 185, 159.99], ["Тушка цыплёнка-бройлера охлаждённая Верхневолжская птицефабрика, 1 кг", 16, 14, 0, 271854005, 1000, 189.99], ["Филе грудки индейки охлажденное Индилайт, 500 г", 20, 2.5, 0, 778591007, 500, 375.99], ["Форель соленая Капитан филе-кусок с кожей, 200 г", 22, 6, 0, 844767008, 200, 509.99], ["Шея говяжья без кости, 1 кг", 19.1, 6.1, 0, 93300368000, 1000, 969.9], ["Язык говяжий охлажденный Мираторг, 1 кг", 16, 16, 0, 786540004, 1000, 1749.99], ["Язык свиной, 1 кг", 15.9, 16, 2.1, 622096009, 1000, 669.9], ["Яичный белок жидкий Волжанин пастеризованный, 500 г", 11, 0, 1, 806409007, 500, 162.99], ["Яйца куриные Ваш выбор С0, коричневые, 10 шт.", 12.7, 11.5, 0.7, 210666003, 611, 139.99], ["Яйца куриные Ваш выбор С2, коричневые, 10 шт.", 12.7, 11.5, 0.7, 210670000, 462, 82.99], ["Яйца куриные Три несушки категория СВ, 10 шт.", 12.7, 11.5, 0.7, 497085009, 678, 187.99]]