function load() {
	a = ['молоко/кефир/простокваша с 2чл сахара на стакан', 'молоко/кефир/простокваша без сахара', 'компот', 'чай с 2чл сахара на стакан', 'квас', 'сок']
	b = [80, 60, 40, 400 * .2 / 2.5, 27, 21]
	el('beverage1').innerHTML = '<table class="table_border table_color beverage1"><thead><tr><th rowspan=2><th colspan=3>килокалорий<tr><th>100г<th>стакан 250мл<th>2 стакана 250мл</thead><tbody>' + a.reduce((a, e, i) =>
		a + '<tr>' + implode([e, b[i], 2.5 * b[i], 5 * b[i]], '<td>'), '') + '</table>'
	/*овощи/каша=2
	
	воды 4*(59.2*2+100*8.1/16*.74+250*.92)=1543
	нужно 29*65=1885

	растительный белок
	2.5*(1.8+1.3)+1.4+4*.4+2.368*12.6=40.5868
	*/
	recipeLoad({
		p: `№примерный рацион на день человека массой 65кг
/на 4 приёма пищи
4{
гречка 59.2
вода 200%
курица 100*8.1/16
масло подсолнечное 16.3-100*8.1/16*.14
капуста 250/4
морковь 250/4
лук 100/4
яблоко 400/4
}`
		, columns: { "р/кг": 0, "строка в чеке / дата чека": 0, "р/1000кк": 0, "р всего": 0 }
		, mass: 65
		, days: 1
		,id:'beverage2'
		,h4:1
	})

}