<?php
//localhost/php/politburo.php

define('TITLE', 'title="');
$BD = [['Рождение</th>', 'Дата рождения</th>'], ['Смерть</th>', 'Дата смерти</th>']];
$month = ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"];

//  preg_match('/(\d+)\)/', '(1883—1938)', $matches);
//  var_dump($matches[1]);    
// exit;
$gn = [
    /*     "Феликс Эдмундович Дзержинский (1877—1926) 2.6.1924 -",
"Михаил Васильевич Фрунзе (1885—1925) 2.6.1924 -",
"Григорий Иванович Петровский (1878—1958) 1.1.1926 -",
"Николай Александрович Угланов (1886—1937) 1.1.1926 -",
"Карл Янович Бауман (1892—1937) 29.4.1929 -",
"Сергей Иванович Сырцов (1893—1937) 29.4.1929 -",
"Павел Петрович Постышев (1887—1939) 10.2.1934 -",
"Роберт Индрикович Эйхе (1890—1940) 1.2.1935 -",
"Николай Иванович Ежов (1895—1940) 12.10.1937 -",
"Александр Сергеевич Щербаков (1901—1945) 21.2.1941 -",
"Андрей Януарьевич Вышинский (1883—1954) 16.10.1952 -",
"Арсений Григорьевич Зверев (1900—1969) 16.10.1952 -",
"Иван Григорьевич Кабанов (1898—1972) 16.10.1952 -",
"Николай Семёнович Патоличев (1908—1989) 16.10.1952 -",
"Николай Михайлович Пегов (1905—1991) 16.10.1952 -",
"Александр Михайлович Пузанов (1906—1998) 16.10.1952 -",
"Иван Фёдорович Тевосян (1902—1958) 16.10.1952 -",
"Павел Фёдорович Юдин (1899—1968) 16.10.1952 -",
// "МирДжафар Аббасович Багиров (1895—1956) 5.3.1953 -",

"Дмитрий Трофимович Шепилов (1905—1995) 27.2.1956 -",
"Ян Эдуардович Калнберзинь (1893—1986) 29.6.1957 -",
"Василий Павлович Мжаванадзе (1902—1988) 29.6.1957 -",
"Пётр Николаевич Поспелов (1898—1979) 29.6.1957 -",
"Шараф Рашидович Рашидов (1917—1983) 31.10.1961 -",
"Леонид Николаевич Ефремов (1912—2007) 23.11.1962 -",
"Пётр Нилович Демичев (1908—1996) 16.11.1964 -",
"Пётр Миронович Машеров (1918—1980) 8.4.1966 -",
"Борис Николаевич Пономарёв (1905—1995) 19.5.1972 -",
"Тихон Яковлевич Киселёв (1917—1983) 21.10.1980 -",
"Владимир Иванович Долгих (1924—2020) 24.5.1982 -",
"Сергей Леонидович Соколов (1911—2012) 23.4.1985 -",
"Николай Владимирович Талызин (1929—1991) 15.10.1985 -",
"Борис Николаевич Ельцин (1931—2007) 18.2.1986 -",
"Юрий Филиппович Соловьёв (1925—2011) 6.3.1986 -",
"Дмитрий Тимофеевич Язов (1924—2020) 26.6.1987 -",
"Георгий Петрович Разумовский (род.1936) 18.2.1988 -",
 */
    "Александра Павловна Бирюкова (1929—2008) 30.9.1988 -",
    "Александр Владимирович Власов (1932—2002) 30.9.1988 -",
    "Анатолий Иванович Лукьянов (1930—2019) 30.9.1988 -",
    "Евгений Максимович Примаков (1929—2015) 20.9.1988 -",
    "Борис Карлович Пуго (1937—1991) 20.9.1988 -"
];

$g = array_unique($gn);
// echo(count($gn)." ".count($g));

$in = 1;
foreach ($g as $t) {
    // if($in<71){
    //     $in++;
    //     continue;
    // }
    $a = preg_split("/\s+/u", $t); //\xc2\xa0 automatically for utf8
    $url = 'https://ru.wikipedia.org/wiki/' . $a[2] . ",_" . $a[0] . '_' . $a[1];
    if (in_array($a[2], ['Кузнецов', 'Михайлов'])) {
        $url .= "_(государственный_деятель)";
    } elseif ($a[2] == 'Фролов') {
        $url .= "_(философ)";
    }
    $live = $a[3] == "(род.";
    $birthDeath = [0, 0];
    if ($live) {
        $birthDeath[0] = intval(substr($a[4], 0, -1));
    } else {
        $birthDeath[0] = intval(substr($a[3], 1, 4));
        preg_match('/(\d+)\)/', $a[3], $matches);
        $birthDeath[1] = intval($matches[1]);
    }

    $c = file_get_contents($url);
    $max = $live ? 1 : 2;

    for ($bd = 0; $bd < $max; $bd++) {
        $B = $BD[$bd];
        $p = strpos($c, $B[0]);
        if ($p === false) {
            $p = strpos($c, $B[1]);
            if ($p === false) {
                die("error" . __LINE__ . $url . " " . $t);
            } else {
                $p += strlen($B[1]);
                $p1 = strpos($c, $B[1], $p);
                if ($p1 !== false) {
                    die("error" . __LINE__);
                }
            }
        } else {
            $p += strlen($B[0]);
            $p1 = strpos($c, $B[0], $p);
            if ($p1 !== false) {
                die("error" . __LINE__);
            }
        }

        $error = false;
        for ($i = 0; $i < 2; $i++) {
            $s = getTitle($c);
            if ($i == 1) {
                if (!$error && intval(substr($s, 0, 4) != $birthDeath[$bd])) {
                    // if($bd==1 && $a[2]!='Громыко' || $bd==0 && !in_array($a[2],['Кириченко','Сталин'])){//TODO
                    //     die("error".__LINE__." $bd [".$birthDeath[$bd]."][".$s."]".$t);
                    // }
                }

                if ($bd + 1 == $max) {
                    if ($a[2] == 'Громыко') {
                        $db[1] = "2.7.";
                    } elseif ($a[2] == 'Сталин') {
                        $db[0] = "21.12.";
                    }

                    $n = $t;
                    for ($j = 0; $j < $max; $j++) {
                        $n = str_replace($birthDeath[$j], $db[$j] . $birthDeath[$j], $n);
                    }
                    // echo $in;
                    if ($error) {
                        echo "error";
                    }
                    $n = str_replace(['(', ')', '—'], ['', '', '-'], $n);
                    echo "\"" . $n . "\",<br>";
                }
            } else {
                if ($s == 'по юлианскому календарю') {
                    $p = $p2 + 1;
                    $s = getTitle($c);
                }

                if (preg_match('/\d+/', $s, $matches)) {
                    $day = $matches[0];
                    $q = substr($s, strlen($day) + 1);
                    $j = array_search($q, $month);
                    if ($j === false) {
                        if ($bd == 1 && $a[2] == 'Громыко') {
                        } else {
                            die("error" . __LINE__ . "#" . $s . "#" . $t);
                        }
                    } else {
                        $db[$bd] = $day . "." . ($j + 1) . ".";
                    }
                } else {
                    $error = true;
                    $db = "error" . __LINE__ . "#" . $s . "#";
                }
            }

            $p = $p2 + 1;
        }
    }
    $in++;
    //break;
}

function getTitle($c)
{
    global $p, $p1, $p2;
    $p1 = strpos($c, TITLE, $p);
    if ($p1 === false) {
        die("error" . __LINE__);
    }

    $p1 += strlen(TITLE);
    $p2 = strpos($c, '"', $p1);
    return substr($c, $p1, $p2 - $p1);
}
